# Створіть словник, який містить ключ — назва книги, значення — кількість сторінок у ній.
# Напишіть програму, яка виводить на екран книгу з найбільшою кількістю сторінок.
# Вивести на екран книгу з найменшою кількістю сторінок.
# Порахувати середнє значення сторінок у всіх книгах.
books = {
    "Гарі Потер-1": 150,
    "Гарі Потер-2": 125,
    "Гарі Потер-3": 170,
    "Гарі Потер-4": 200

}


book = ""
count1 = 10000 
for name, count in books.items():
    if count1 > count:
        book = name 
        count1 = count 
print(f"Книга з найменьшою кількістю сторінок має назву {book} та містить ось таку кількість сторінок: {count1}")

book_name = min(books, key=books.get)
print(f"Книга з найменьшою кількістю сторінок має назву {book_name} та містить ось таку кількість сторінок: {books[book_name]}")

book_name = min(books, key=lambda key: books[key])
print(f"Книга з найменьшою кількістю сторінок має назву {book_name} та містить ось таку кількість сторінок: {books[book_name]}")