products = [
    "Гречка",
    "Макарони",
    "Спагеті",
    "Картопля",
    "Буряк",
    "Морква",
    "Капуста",
    "Цибуля",
    "Часник",
    "Борошно",
    "Яйця",
    "Соняшникова олія",
    "Вершкове масло",
    "Сіль",
    "Перець",
    "Цукор",
    "Оцет",
    "Сода",
    "Чай",
    "Кава"
]

products_sold = []

commands = [
    "1. Показати список наявних товарів",
    "2. Додати новий товар до списку",
    "3. Додати список товарів",
    "4. Видалити товар за ім'ям",
    "5. Видалити товар за номер",
    "6. Відсортувати список товарів за ім'ям",
    "7. Продати товар",
    "8. Знайти номер товару за ім'ям",
    "9. Показати список проданих товарів",
    "10. Показати історію продажів",
    "11. Вийти з програми"
]

while True:
    for command in commands:
        print(command)

    command = input("\nВведіть номер команди: ")

    if command == "1":
        for i, product in enumerate(products, start=1):
            print(f"{i}: {product}")

        input("\nНатисніть 'enter' для продовження\n")

    elif command == "2":
        product = input("\nВведіть новий товар для додавання до списку: ")

        if product in products:
            input("\nТакий товар вже доданий\nНатисніть 'enter' для продовження\n")
        else:
            products.append(product)
            input("\nНовий товар доданий до списку\nНатисніть 'enter' для продовження\n")