# Trailing Spaces
# Rainbow Brackets

# Print

print('Hello')

print("Hello")
print("Ім'я")

print("""Hello""")
print("""Моє ім'я "підставити своє ім'я" """)

#  __      ______  _________   ___ __ __  ______        ________  _________
# /_/\    /_____/\/________/\ /__//_//_/\/_____/\      /_______/\/________/\
# \:\ \   \::::_\/\__.::.__\/ \::\| \| \ \::::_\/_     \__.::._\/\__.::.__\/
#  \:\ \   \:\/___/\ \::\ \    \:.      \ \:\/___/\       \::\ \    \::\ \
#   \:\ \___\::___\/_ \::\ \    \:.\-/\  \ \::___\/_      _\::\ \__  \::\ \
#    \:\/___/\:\____/\ \::\ \    \. \  \  \ \:\____/\    /__\::\__/\  \::\ \
#     \_____\/\_____\/  \__\/     \__\/ \__\/\_____\/    \________\/   \__\/


print("""
 __      ______  _________   ___ __ __  ______        ________  _________
/_/\\    /_____/\\/________/\\ /__//_//_/\\/_____/\\      /_______/\\/________/\\
\\:\\ \\   \\::::_\\/\\__.::.__\\/ \\::\\| \\| \\ \\::::_\\/_     \\__.::._\\/\\__.::.__\\/
 \\:\\ \\   \\:\\/___/\\ \\::\\ \\    \\:.      \\ \\:\\/___/\\       \\::\\ \\    \\::\\ \\
  \\:\\ \\___\\::___\\/_ \\::\\ \\    \\:.\\-/\\  \\ \\::___\\/_      _\\::\\ \\__  \\::\\ \\
   \\:\\/___/\\:\\____/\\ \\::\\ \\    \\. \\  \\  \\ \\:\\____/\\    /__\\::\\__/\\  \\::\\ \\
    \\_____\\/\\_____\\/  \\__\\/     \\__\\/ \\__\\/\\_____\\/    \\________\\/   \\__\\/
""")

# Типи змінних

a = 9 # int - integer
b = 4.6 # float
c = "Hi" # str - string

a = 7
print(a)
print(f"{a}")
print(f"{a=}")
print(f"{a = }")

print("{}".format(a))
print("{a}".format(a=a))
print("{a}".format(a=9))
print("{b}".format(b=a))


b = 11
print("a + b =", a + b, end=", ")
print(f"a + b = {a + b}")
print(a, '+', b, '=', a + b)

print(1, 2, 3, 4, 5, 6, sep='-')
print(1, 2, 3, 4, 5, 6, sep='\n')

# Мене-!-звати-!-Микола-!-Олександрович

print("12" + "25")



# Input

input("What is your name? My name is ")

name = input("Enter your name: ")
print(f"My name is {name}")

age = input("How old are you? ")
print("Мені {}".format(age))

city = input("Where do you live? ")
print(f"Я живу у місті {city}")

print(f"Мене звати {name}. Мені {age} років. На даний час я проживаю в місті {city}")

a = int(input("Введіть число 1: "))
b = int(input("Введіть число 2: "))
print(a + b)

# Передати програмі кількість свої домашніх тварин.
# Порахувати скільки всього тварин є в домогосподарстві,
# та вивести повідомлення у форматі "Котів: 5, собак: 1, корів: 9. Всього тварин 15"

cats = int(input("Скільки у тебе котів: "))
dogs = int(input("Скільки у тебе собак: "))
cows = int(input("Скільки у тебе корів: "))

print("Котів: ", cats, ", собак: ", dogs, ", корів: ", cows, ". Всього тварин ", cats + dogs + cows, sep="")
print(f"Котів: {cats}, собак: {dogs}, корів: {cows}. Всього тварин {cats + dogs + cows}")
print("Котів: {cats}, собак: {dogs}, корів: {cows}".format(cats=cats, dogs=dogs, cows=cows), ". Всього тварин", cats + dogs + cows, sep="")

# float

a = int(float(input("Введіть перше ціле число:\n")))
b = int(float(input("Введіть друге ціле число:\n")))
print(a, '+', b, '=', a + b)
print(a, '-', b, '=', a - b)
print(a, '*', b, '=', a * b)
print(a, '/', b, '=', a / b)
print(a, '**', b, '=', a ** b)
print(a, '//', b, '=', a // b)
print(a, '%', b, '=', a % b)

# Написати програму, яка буде рахувати площу поля за довжиною та шириною

length = input("Введіть довжину поля: ")
width = input("Введіть ширину поля: ")

area = float(length) * float(width)

################

# Напишіть програму для підрахунку дрібних грошей. Вона повинна питати:

# «Скільки у вас монет по 50 копійок?»;
# «Скільки у вас монет по 25 копійок?»;
# «Скільки у вас монет по 10 копійок?»;
# «Скільки у вас монет по 5 копійок?».
# Після цього на екрані повинна з'явитися загальна сума.

count_50 = int(input("Скільки у вас монет по 50 копійок? "))
count_25 = int(input("Скільки у вас монет по 25 копійок? "))
count_10 = int(input("Скільки у вас монет по 10 копійок? "))
count_5 = int(input("Скільки у вас монет по 5 копійок? "))

sum_coin = count_50 * 50 + count_25 * 25 + count_10 * 10 + count_5 * 5

count_grn = sum_coin // 100
count_coin = sum_coin % 100

print(f"Гривень: {count_grn}\nКопійок: {count_coin}")

# Обчисліть добуток перших 20 натуральних чисел. Виведіть на екран обчислене значення.

# Запишіть букву 'A' (латинську, велику) 100 разів поспіль. 

# Запишіть слово 'Python' 100 раз поспіль. 