# a = 1
# b = 5
# c = 1
# d = 5


# #print header
# print(end = '\t')
# for i in range(c, d + 1) :
#     print(i, end = '\t')
# print("")

# #print table
# for i in range(a, b + 1) :
#     print(i, end = '\t')
#     for j in range(c, d + 1) :
#         print(i * j, end = '\t')
#     print("")


# a = 0
# while True:
#     print(a)
#     if a >= 20:
#         break
#     a = a + 1



# while True:
#     name = input('Enter name:')
#     if name == 'stop': break
#     print('Hello', name)



# a = 0
# while a < 6:
#     a = a + 1
#     if not a % 2:
#         continue
#     print(a)


# Організувати безперервне введення з клавіатури чисел.
# Якщо число більше 20, то вивести його на екран.
# Якщо число більше 100 — закінчити роботу програми.

# while True:
#     i = int(input())

#     if i > 100 :
#         break

#     if i < 20 :
#         continue

#     print(i)



# Оператори continue і break працюють тільки всередині одного циклу.
# У ситуації вкладених циклів немає способу вийти з усіх циклів одразу

# while True:
#     number = input("number = ")
#     number = int(number)
#     while True:
#         print(number)
#         number = number - 1
#         if number < 0:
#             break






# Порахувати середнє арифметичне всіх чисел кратних 5 з певного інтервалу
# start = int(input("Початок діапазону > "))
# end = int(input("Кінець діапазону > "))

# # average
# summ = 0
# count = 0

# for i in range(start, end+1):
#     if i % 5 == 0:
#         summ += i
#         count += 1

# avg = summ / count
# print(f"Середнє арифметичне чисел кратних 5 з діапазону {start}-{end} -> {avg} {summ=}, {count=}")






# Написати програму, яка буде підраховувати суму всіх парних чисел від 1 до 100. ---------1
# summ = 0

# for i in range(1, 101):
#     if i % 2 == 0:
#         summ += i

# print(f"Сума парних чисел від 1 до 100: {summ}")






# Написати програму, яка приймає на вхід рядок, введений з клавіатури, ---------------2
# і підраховує кількість входження в рядок останньої літери,
# якою закінчується цей рядок.
# string = input("Ввевіть речення: ")
# count = 0

# for char in string:
#     if char == string[-1]:
#         count += 1

# print(f"Кількість літер '{string[-1]}' - {count}")





# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.






# Написати код який буде просити команду і відразу її друкувати
# до поки він його не напише "stop", "exit" aбо "bye".



# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).
# A = 70
# B = -5
# C = -9

# if A > B > C or C > B > A:
#     print(B)
# elif A > C > B or B > C > A:
#     print(C)
# elif B > A > C or C > A > B:
#     print(A)



# Написати код який рахує добуток всіх чисел в діапазоні який задав користувач




# Арифметичні дії над числами пронумеровані
# таким чином: 1 — додавання, 2 — віднімання, 3 — множення, 4 — ділення.
# Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0).
# Виконати над числами вказану дію та вивести результат.






# Написати програму, яка виведе список квадратів чисел.





# Одиниці вимірювання довжини пронумерованітак:
# 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр.
# Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та довжина відрізка в цих одиницях(дійсне ціле).
# Знайти довжину відрізка в метрах.








# Написати програму, яка виведе числа від 7 до 77 використовуючи цикл





# На технічній співбесіді претенденти на посаду одержують оцінку за тест.
# У наступний тур співбесіди проходять кандидати, які склали тест на 83 бали включно або вище.
# Реалізуйте оператор контролю виконання так, щоб він привласнив логічній змінній is_next значення True,
# якщо кількість набраних балів буде більшою або дорівнює 83.
# В іншому випадку значення змінної дорівнює False.






# Дано змінну a = -56. Виводити a, поки a <= 15, збільшуючи змінну на 3





# Дано ціле число, що лежить у діапазоні 1-999.
# Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.
# a = 48
# count_of_digit = 0
# is_even = None

# if a // 100:
#     count_of_digit = 3
# elif a // 10:
#     count_of_digit = 2
# else:
#     count_of_digit = 1

# if a % 2:
#     is_even = False
# else:
#     is_even = True

# print(f"Number {a} {'even' if is_even else 'odd'} and have {count_of_digit} digit")






# Написати програму, яка на початку додасть “I am glad to see you, ” до кожного із імен в списку
# і виведе привітання на екран.
# lst=["Alex", "Petro", "Max", "Andrii", "Lev"]. Приклад — I am glad to see you, Alex!






# Необхідно обчислити корінь квадратного рівняння.
# a · x2 + b · x + c = 0
# Дискримінант рівняння помістіть у змінну D
# D = b2 - 4 · a · c
# Корінь рівняння помістіть у змінні x1 та x2
# x1 = (-b + D ** 0.5) / (2 · a)
# x2 = (-b - D ** 0.5) / (2 · a)








# Дано слово "Молоко". За допомогою циклу порахувати скільки літер "о" містить в собі це слово.







# Зробити попередню програму більш універсальною:
# Запитувати у користувача речення та літеру для пошуку.









# Використати блок “else” щоб вивести повідомлення "Цикл повністю завершився"
# після успішного виходу з циклу (довільний)








# Написати програму, яка порахує і виведе числа у 4 степені від 1 до числа, яке задасть користувач









# Дано дійсне число — ціна 2 л молока. Вивести вартість 1, 2, ..., 10 л молока.








# Дано дійсне число - ціна 3 кг сала. Вивести вартість 1.2, 1.4, ..., 2 кг сала.









# Дано діапазон чисел від -100 до 0. Вивести на екран лише числа, які закінчуються на нуль








# Дано діапазон чисел (Користувач обирає сам (input)).
# Вивести на екран лише числа, які діляться на 3 та закінчуються на нуль







# Написати програму, яка виведе факторіал числа, яке задасть користувач (цикл while)






# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”




