# a = 1
# b = 5
# c = 1
# d = 5


# #print header
# print(end = '\t')
# for i in range(c, d + 1) :
#     print(i, end = '\t')
# print("")

# #print table
# for i in range(a, b + 1) :
#     print(i, end = '\t')
#     for j in range(c, d + 1) :
#         print(i * j, end = '\t')
#     print("")


# a = 0
# while True:
#     print(a)
#     if a >= 20:
#         break
#     a = a + 1



# while True:
#     name = input('Enter name:')
#     if name == 'stop': break
#     print('Hello', name)



# a = 0
# while a < 6:
#     a = a + 1
#     if not a % 2:
#         continue
#     print(a)


# Організувати безперервне введення з клавіатури чисел.
# Якщо число більше 20, то вивести його на екран.
# Якщо число більше 100 — закінчити роботу програми.

# while True:
#     i = int(input())

#     if i > 100 :
#         break

#     if i < 20 :
#         continue

#     print(i)



# Оператори continue і break працюють тільки всередині одного циклу.
# У ситуації вкладених циклів немає способу вийти з усіх циклів одразу

# while True:
#     number = input("number = ")
#     number = int(number)
#     while True:
#         print(number)
#         number = number - 1
#         if number < 0:
#             break






# Порахувати середнє арифметичне всіх чисел кратних 5 з певного інтервалу
# start = int(input("Початок діапазону > "))
# end = int(input("Кінець діапазону > "))

# # average
# summ = 0
# count = 0

# for i in range(start, end+1):
#     if i % 5 == 0:
#         summ += i
#         count += 1

# avg = summ / count
# print(f"Середнє арифметичне чисел кратних 5 з діапазону {start}-{end} -> {avg} {summ=}, {count=}")






# Написати програму, яка буде підраховувати суму всіх парних чисел від 1 до 100. ---------1
# summ = 0

# for i in range(1, 101):
#     if i % 2 == 0:
#         summ += i

# print(f"Сума парних чисел від 1 до 100: {summ}")






# Написати програму, яка приймає на вхід рядок, введений з клавіатури, ---------------2
# і підраховує кількість входження в рядок останньої літери,
# якою закінчується цей рядок.
# string = input("Вевіть речення: ")
# count = 0

# for char in string:
#     if char == string[-1]:
#         count += 1

# print(f"Кількість літер '{string[-1]}' - {count}")






# Написати код який буде просити ім'я користувача до поки він його не напише
# Написати код який рахує суму всіх чисел в діапазоні який задав користувач
# Написати програму, яка виведе таблицю множення числа, яке задав користувач. Приклад (2 4 6 8 10 12 14 16 18 20)
# Написати програму, яка виведе число від -10 до -1 використовуючи цикл
# Дано змінну a = 1. Виводити a, поки a <= 15.
# Написати програму, яка додасть “Hello” до кожного із імен в списку і виведе привітання на екран. lst=["Dima", "Yaroslav", "Zhenya", "Sasha", "Andrii", "Max"]. Приклад — Hello Dima!
# Дано слово “Цивілізація”. За допомогою циклу порахувати скільки літер “і” містить в собі це слово.
# Зробити попередню програму більш універсальною — Запитувати у користувача слово та літеру для пошуку.
# Використати блок “else” щоб вивести повідомлення “Завершено” після успішного виходу з циклу (довільний)
# Написати програму, яка порахує і виведе куби всіх чисел від 1 до числа, яке задасть користувач
# Дано дійсне число — ціна 1 кг цукерок. Вивести вартість 1, 2, ..., 10 кг цукерок.
# Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 1.2, 1.4, ..., 2 кг цукерок.
# Дано діапазон чисел від 0 до 100. Вивести на екран лише парні числа
# Дано діапазон чисел (Користувач обирає сам (input)). Вивести на екран лише непарні числа і 0 (в кінці)
# Написати програму, яка виведе факторіал числа, яке задасть користувач (цикл while)
# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”



