# a = True and False
# print(a)




# a = True or False
# print(a)



# a = not 2 < 0
# print(a)


# is_nice = True
# state = "nice" if is_nice else "not nice"


# some_data = None
# msg = som_data or "Дані відсутні"


# score = 75
# grade = "Pass" if score >= 60 else "Fail"


# Оголосити змінні х, у, z  (числа). За допомогою умовного оператора перевірити яке число більше.
# x = 50
# y = 10
# z = 100
# if x > y:
#     if x > z:
#         print(x)
#     else:
#         print(z)
# elif y > z:
#     print(y)
# else:
#     print(z)




# Прийняти на вхід число — вік користувача. Перевірити чи може користувач самостійно відкрити рахунок у банку (вік >= 18)




# Створити програму-помічник, яка приймає на вхід температуру води (float).
# Після цього програма проведе аналіз та підкаже, який стан води. (Принаймі 2 умови)
# temp = float(input())
# if temp < 0:
#     print("Лід")
# elif temp < 100:
#     print("Вода")
# else:
#     print("Пара")

# if temp < 0:
#     print("Лід")

# if temp < 100:
#     print("Вода")

# if temp >= 100:
#     print("Пара")




# Прийняти на вхід число, перевірити, чи закінчується число на 0.
# a = float(input("Введіть будь яке число > "))
# a = int(a)
# if a % 10 == 0:
#     print(f"Число {a} закінчується на '0'")
# else:
#     print(f"Число {a} не закінчується на '0'")





# Дано ціле число. Якщо воно негативне, додати до нього 20; інакше відняти 5. Вивести отримане число.



# Дано ціле число. Якщо воно є позитивним, помножити його на 5; інакше піднести до степеня 3. Вивести отримане число.




# Дано чотири числа. Знайти кількість чисел, які діляться на 5.
# a = 45
# b = 75
# c = -105
# d = 99

# n = 0
# if a % 5 == 0:
#     n += 1

# if b % 5 == 0:
#     n += 1

# if c % 5 == 0:
#     n += 1

# if d % 5 == 0:
#     n += 1

# print(f"К-ть чисел, які діляться на 5: {n}")







# Дано п'ять чисел. Знайти кількість чисел, які ділять на 2 та к-ть чисел які діляться на 3 у даному наборі.






# Дано дві змінні дійсного типу: A, B.
# Перерозподілити значення даних змінних так, щоб в A опинилось більше значення, а B — менше.
# Вивести нові значення змінних A та B.
# A = 7
# B = 30
# if A < B:
#     C = A
#     A = B
#     B = C

# print(A, B)







# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.




######### Дано три числа. Знайти найменше з них.




# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).
# A = 70
# B = -5
# C = -9

# if A > B > C or C > B > A:
#     print(B)
# elif A > C > B or B > C > A:
#     print(C)
# elif B > A > C or C > A > B:
#     print(A)





# Арифметичні дії над числами пронумеровані таким чином: 1 — додавання, 2 — віднімання, 3 — множення, 4 — ділення. Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0). Виконати над числами вказану дію та вивести результат.
# Одиниці вимірювання довжини пронумеровані так: 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр. Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та довжина відрізка в цих одиницях(дійсне ціле). Знайти довжину відрізка в метрах.



# На технічній співбесіді претенденти на посаду одержують оцінку за тест.
# У наступний тур співбесіди проходять кандидати, які склали тест на 83 бали включно або вище.
# Реалізуйте оператор контролю виконання так, щоб він привласнив логічній змінній is_next значення True,
# якщо кількість набраних балів буде більшою або дорівнює 83.
# В іншому випадку значення змінної дорівнює False.



# Дано ціле число, що лежить у діапазоні 1-999.
# Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.
a = 48
number_of_digit = 0
is_even = None

if a // 100:
    number_of_digit = 3
elif a // 10:
    number_of_digit = 2
else:
    number_of_digit = 1

if a % 2:
    is_even = False
else:
    is_even = True

print(f"Number {a} {"even" if is_even else "odd"} and have {number_of_digit} number of digit")





# У нас є три логічні змінні.
# Перша визначає статус користувача is_active, яка дорівнює True або False.
# Друга is_admin визначає, чи є у користувача права адміністратора теж булевого типу.
# Третя is_permission — чи дозволено доступ, теж булевого типу.
# Приведіть змінні is_active, is_admin та is_permission до булевого вигляду.
# Надайте змінній access значення, яке покаже, чи є доступ у користувача. Використовуйте логічні оператори.
# Адміністратор завжди має доступ, незалежно від значень змінних is_permission та is_active.
# Користувач має доступ, тільки якщо is_permission дорівнює True та is_active також дорівнює True.





# Як відомо, зазвичай розробників заведено поділяти на три категорії:
# Джун (Junior), Мідл ( Middle) — основний розробник у компанії та Сеньйор (Senior) — старший розробник.
# Орієнтовно можна вважати, що до 1 року роботи включно — це Джуніор,
# понад 5 років — це Сеньйор розробник, а від одного року до 5 включно — мідл.
# Є змінна work_experience, що визначає стаж роботи програміста.
# Залежно від стажу роботи, присвоїти змінній developer_type значення "Junior", "Middle" або "Senior".






# Необхідно обчислити корінь квадратного рівняння.
# a · x2 + b · x + c = 0
# Дискримінант рівняння помістіть у змінну D
# D = b2 - 4 · a · c
# Корінь рівняння помістіть у змінні x1 та x2
# x1 = (-b + D ** 0.5) / (2 · a)
# x2 = (-b - D ** 0.5) / (2 · a)





