# Створіть програму, яка приймає список товарів та повертає список,
# в якому кожен елемент дорівнює кількості букв, з яких складається товар.

# products = []
# char_count = []

# while True:
#     product = input("Введіть назву товару для додавання у список, або напишіть 'stop' > ")

#     if product == 'stop':
#         break

#     products.append(product)
#     print(f"Товар '{product}' доданий у список")

# for product in products:
#     count = 0

#     for char in product:
#         count += 1

#     char_count.append(count)

# for i, product in enumerate(products):
#     print(f"{i + 1}. {product}. Кількість букв: {char_count[i]}")
# else:
#     print("Список товарів:", products)
#     print("Кількість букв", char_count)




# Написати програму, що рахує різницю всіх чисел у списку.






# Написати програму, що рахує частку всіх елементів у списку.






# Написати програму, що перевірить чи є щось в списку, і якщо є, то виведе кількість елементів у ньому.






# Написати програму, яка видалить зі списку 1-й, 3-й і 6-й елементи зі списку
# my_list = ["Хліб", "Банани", "Риба", "Насіння", "Майонез", "Кетчуп", "Соус"]

# my_list.pop(6)
# my_list.pop(3)
# my_list.pop(1)

# print(my_list)




# Написати програму, що дістає мінімальне число зі списку.







# Піднести кожен із елементів списку до четвертого степеня










# Видалити слово "Банани" зі списку.
# products = ["Хліб", "Банани", "Риба", "Банани", "Насіння", "Майонез", "Кетчуп", "Банани", "Соус"]






# Написати програму, що прибере дублікати зі списку.








# Написати програму, що порахує кількість додатніх елементів у списку та кількість від’ємних









# Написати програму, що порахує кількість унікальних елементів у списку.








# Написати програму, що виведе список, після видалення із нього парних елементів






# Створіть програму, яка приймає список чисел та виводить на екран кожне третє число у списку.




# Написати програму, що виведе список, після видалення із нього чисел, які закінчуються на нуль






# Створити програму, яка приймає список слів та повертає список слів у зворотньому порядку.






# Створити програму, яка приймає список чисел та повертає список елементів, які є менші за середнє значення списку.







# Написати програму, яка знайде список слів, які мають 5 і більше символів







# З'єднати два списки




# До одного списку додати інший у зворотньому напрямку