# a = True and False
# print(a)




# a = True or False
# print(a)



# a = not 2 < 0
# print(a)


# is_nice = True
# state = "nice" if is_nice else "not nice"


# some_data = None
# msg = som_data or "Дані відсутні"


# score = 75
# grade = "Pass" if score >= 60 else "Fail"


# Оголосити змінні х, у, z  (числа). За допомогою умовного оператора перевірити яке число більше.
# x = 50
# y = 10
# z = 100
# if x > y:
#     if x > z:
#         print(x)
#     else:
#         print(z)
# elif y > z:
#     print(y)
# else:
#     print(z)




# Прийняти на вхід число — вік користувача. Перевірити чи може користувач самостійно відкрити рахунок у банку (вік >= 18)




# Створити програму-помічник, яка приймає на вхід температуру води (float).
# Після цього програма проведе аналіз та підкаже, який стан води. (Принаймі 2 умови)
# temp = float(input())
# if temp < 0:
#     print("Лід")
# elif temp < 100:
#     print("Вода")
# else:
#     print("Пара")

# if temp < 0:
#     print("Лід")

# if temp < 100:
#     print("Вода")

# if temp >= 100:
#     print("Пара")




# Прийняти на вхід число, перевірити, чи закінчується число на 0.
# a = float(input("Введіть будь яке число > "))
# a = int(a)
# if a % 10 == 0:
#     print(f"Число {a} закінчується на '0'")
# else:
#     print(f"Число {a} не закінчується на '0'")





# Дано ціле число. Якщо воно негативне, додати до нього 20; інакше відняти 5. Вивести отримане число.



# Дано ціле число. Якщо воно є позитивним, помножити його на 5; інакше піднести до степеня 3. Вивести отримане число.




# Дано чотири числа. Знайти кількість чисел, які діляться на 5.
# a = 45
# b = 75
# c = -105
# d = 99

# n = 0
# if a % 5 == 0:
#     n += 1

# if b % 5 == 0:
#     n += 1

# if c % 5 == 0:
#     n += 1

# if d % 5 == 0:
#     n += 1

# print(f"К-ть чисел, які діляться на 5: {n}")







# Дано п'ять чисел. Знайти кількість чисел, які ділять на 2 та к-ть чисел які діляться на 3 у даному наборі.






# Дано дві змінні дійсного типу: A, B.
# Перерозподілити значення даних змінних так, щоб в A опинилось більше значення, а B — менше.
# Вивести нові значення змінних A та B.
# A = 7
# B = 30
# if A < B:
#     C = A
#     A = B
#     B = C

# print(A, B)







# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.




######### Дано три числа. Знайти найменше з них.




# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).
# A = 70
# B = -5
# C = -9

# if A > B > C or C > B > A:
#     print(B)
# elif A > C > B or B > C > A:
#     print(C)
# elif B > A > C or C > A > B:
#     print(A)





# Арифметичні дії над числами пронумеровані таким чином: 1 — додавання, 2 — віднімання, 3 — множення, 4 — ділення. Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0). Виконати над числами вказану дію та вивести результат.
# Одиниці вимірювання довжини пронумеровані так: 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр. Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та довжина відрізка в цих одиницях(дійсне ціле). Знайти довжину відрізка в метрах.
# Дано ціле число, що лежить у діапазоні 1-999. Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.