# Записати сторони трикутника, та знайти його площу
# S = sqrt(p(p-a)(p-b)(p-c))
# p = (a + b + c) / 2

# М'яч падає з висоти h. Знайти максимальну швидкість м'яча та за який час він упаде на землю.
# v = sqrt(2 * g * h)
# t = sqrt((2 * h) / g)

first_number = 45.3
second_number = -96.1
bool_type = first_number > second_number and first_number > 0 and second_number < 0
print(bool_type)

# Оголосити змінну “name”, в яку присвоїти своє ім’я.
# Оголосити дві змінні, одна з яких дорівнюватиме довільному числу. Інша — значення попередньої змінної збільшене на 10.
# Оголосити змінну - довжина сторони квадрату. Обчислити площу квадрату і вивести на екран.
# Оголосити змінні — сторони прямокутника. Обчислити площу та периметр прямокутника та вивести їх на екран.
# Оголосити змінні — радіус та число P (3.14). Визначити довжину кола та площу круга.
# Оголосити 2 змінні — строки “name” & “ surname”. Вивести на екран рядок у форматі “Мене звати - name surname” (за допомогою конкатенації рядків)
# Оголосити змінні — 3 кути трикутника (їхня градусна міра). Оголосити наступну змінну is_valid, аби отримати булеве значення (is_valid = angle1 + angle2 + angle3 == 180)
# Автомобіль на першій половині шляху їхав зі швидкістю 30 км/год, а на другій — зі швидкістю 40 км/год. Знайти середню швидкість на всьому шляху.
# Головний герой фільму Таксі — Даніель проїжджає відстань 83 км за 30 хв. З якою швидкістю він рухається? (оголосити змінні - відстань та час. Обчислити швидкість та вивести її на екран)
# Створити дві змінні типу string і помістити туди ім’я та прізвище. Вивести привітання, враховуючи персональні дані. (Використання f-строки)
# Створити програму звертання до користувача, використовуючи input(). Приймаємо поля “name”, “surname”, “gender” (Mam, Sir)
# Створити програму обрахунку віку користувача через n кількість років. (2 змінні - поточний вік, кількість років.). Вивести результат на екран.
# Дано змінні A, B, C. Змінити їх значення, перемістивши вміст A — в B , B — в C , C — в A і вивести нові значення змінних A, B, C.
# Відомо, що X кг цукерок коштує A карбованців. Визначити, скільки коштує 1 кг та Y кг цих же цукерок.
# Дана маса M у кілограмах. Використовуючи операцію ділення націло, визначити кількість повних тонн у ній (1 тонна = 1000 кг).
# Дано розмір файлу в байтах. Використовуючи операцію ділення націло, знайти кількість повних кіло байтів, які займає даний файл. (1 кілобайт = 1024 байти).
# Дано двозначне число. Знайти суму та добуток його цифр.
# З початку доби пройшло N секунд (N — ціле). Знайти кількість повних хвилин з початку доби.
# Дано ціле число A. Перевірити істинність висловлювання: «Число A є позитивним».