# Записати сторони трикутника, та знайти його площу
# S = sqrt(p(p-a)(p-b)(p-c))
# p = (a + b + c) / 2
a = 3
b = 4
c = 5
p = (a + b + c) / 2
S = (p * (p - a) * (p - b) * (p - c)) ** 0.5

# М'яч падає з висоти h. Знайти максимальну швидкість м'яча та за який час він упаде на землю.
# v = sqrt(2 * g * h)
# t = sqrt((2 * h) / g)
g = 9.8
h = 10
v = (2 * g * h) ** 0.5
t = ((2 * h) * g) ** 0.5

first_number = 45.3
second_number = -96.1
bool_type = first_number > second_number and first_number > 0 and second_number < 0
print(bool_type)

# Оголосити змінну “city”, в яку присвоїти назву міста.
city = "Одеса"

# Оголосити три змінні, одна з яких дорівнюватиме довільному числу. Друга - в двічі більше число, третя - з протилежним знаком до другої змінної.
a = 4.3
b = a * 2
c = -b

# Оголосити змінну - довжина ребра куба. Обчислити його об'єм і вивести на екран.
a = 1.9
V = a ** 3
print(f"Об'єм куба дорівнює {V}")

# Оголосити змінні — сторони довільного шестикутника. Обчислити периметр шестикутника та вивести його на екран.
a = 2.3
b = 4.6
c = 4.6
d = 5.1
e = 5.1
f = 3.4
p = a + b + c + d + e + f
print(f"Периметр шестикутника дорівнює {p}")

# Оголосити змінні — площа кола. Визначити довжину кола та сторону вписаного правильного трикутника. Вивести на екран довжину кола та довжину сторони трикутника.
# R = sqrt(S / Pi)
# l = 2 * Pi * R
# a = R * sqrt(3)
Pi = 3.14
S = 36 * Pi
R = (S / Pi) ** 0.5
l = 2 * Pi * R
a = R * 3 ** 0.5
print(f"Довжина кола: {l} см.\nСторона трикутника має довжину, яка дорівнює {a} см.")

# Оголосити змінні — 4 кути (їхня градусна міра). Оголосити наступну змінну is_quad, аби отримати булеве значення чи являється дана фігура чотирикутником
a1 = 50
a2 = 140
a3 = 14 # 123
a4 = 47
is_quad = (a1 + a2 + a3 + a4) == 360
answer = "Так :)" if is_quad else "Ні (:"
print(f"Це чотирикутник? '{answer}'")

# Автомобіль на першій половині часу їхав зі швидкістю 36 км/год, а на другій — зі швидкістю 88.8 км/год. Знайти середню швидкість на всьому шляху.
# Vc = (V1 + V2) / 2
V1 = 36
V2 = 88.8
Vc = (V1 + V2) / 2
print(f"Середня швидкість автомобіля {Vc}")

# Автомобіль на першій половині шляху їхав зі швидкістю 25.5 км/год, а на другій — зі швидкістю 101.3 км/год. Знайти середню швидкість на всьому шляху.
#Vc = (2 * V1 * V2) / (V1 + V2)

# Створити програму звертання до користувача, щоб він ввів довільний символ. Побудувати квадрат
symbol = input("Введіть символ > ")
line = f"{symbol} " * 5
medium = f"{symbol}\t{symbol}\n" * 3
print(f"{line}\n{medium}{line}")

# Створити програму обрахунку віку. Користувач вводить рік народження і поточний рік.
birth_year = int(input("Введи свій рік народження > "))
now_year = int(input("Введи поточний рік > "))
age = now_year - birth_year

# Дано змінні A, B, C, D. Змінити їх значення, перемістивши вміст A — в D , D — в C , C — в B, B - в A і вивести нові значення змінних A, B, C, D.
A = 1
B = 2
C = 3
D = 4
E = D
D = A #
F = C
C = E #
E = B
B = F #
A = E #
print(A, B, C, D)
D, C, B, A = A, D, C, B

# Відомо, що X кг борошна коштує B гривень. Визначити, скільки коштує 1 кг та Y кг борошна.
X = 20
B = 564
Y = 1000
price_1 = B / X
price_y = price_1 * Y



# Дана маса M у кілограмах. Використовуючи операцію ділення націло, визначити кількість повних тонн у ній (1 тонна = 1000 кг).
# Дано розмір файлу в байтах. Використовуючи операцію ділення націло, знайти кількість повних кіло байтів, які займає даний файл. (1 кілобайт = 1024 байти).
# Дано двозначне число. Знайти суму та добуток його цифр.
# З початку доби пройшло N секунд (N — ціле). Знайти кількість повних хвилин з початку доби.
# Дано ціле число A. Перевірити істинність висловлювання: «Число A є позитивним».