# Створіть лямбда-функцію для обчислення куба числа.






# Напишіть лямбда-функцію, яка перевіряє,
# чи є одне число кратним іншому, і перевірте її для різних пар чисел.







# Створіть лямбда-функцію для обчислення середнього арифметичного двох чисел.






# Напишіть лямбда-функцію для конвертації температури з Цельсія в Фаренгейт і навпаки.





# Використовуючи теорему Піфагора,
# створіть лямбда-функцію для обчислення довжини гіпотенузи прямокутного трикутника за даними катетами.






# Створіть лямбда-функцію для перевірки, чи є заданий рік високосним.
# Високосний рік ділиться на 4, але якщо він ділиться на 100, то має ділитися і на 400.






# Напишіть лямбда-функцію для визначення максимального з трьох чисел.







# Створіть декілька лямбда-функцій для виконання основних математичних операцій:
# додавання, віднімання, множення, ділення.
# Потім створіть просту програму-калькулятор,
# яка використовує ці функції для обчислення результату введеного користувачем виразу.