# Оголосити словник, що має наступну структуру «ключ» — номерний знак транспортного засобу
# (наприклад «АА2565ІН»), значення «власник авто» (наприклад, Іванов Іван)
# Додати в словник два нові авто
# Знайти власника за номером автомобіля
# Обійти словник і вивести прізвища людей, які мають більше одного авто

# transport = {
#     'AA1111AA': 'Іванов Іван',
#     'IVANOV'  : 'Іванов Іван',
#     'AA0007AA': 'Семенов Андрій',
#     'AA007AA' : 'Іванов Іван',
#     'AВ1111AВ': 'Вінниця Водоканал',
#     'AІ1010КК': 'Семенов Андрій',
# }






# Створіть словник “stock”, який міститиме в собі ключ — назва товару,
# значення — кількість товару на складі.
# Написати програму, яка запитує який товар та кількість, яку хоче купити користувач.
# Вивести на екран True, якщо користувач може купити цей товар, якщо ні — False.










# Створіть словник, який містить дані про користувачів вашого веб-сайту.
# Ключами в цьому словнику будуть імена користувачів, а значеннями — інформація про користувачів.
# Попросіть користувача ввести імена користувачів, про яких хоче дізнатися інформацію, через пробіл.
# Вивести інформацію про цих користувачів у форматі (Ім’я: вік, стать, електронна пошта).
# users = {
#     "alex": {
#         "Ім'я": "Олександр",
#         "Стать": "Чоловіча"
#     },
#     "adolf": {
#         "Ім'я": "Адольф",
#         "Вік": 56,
#         "Стать": "Чоловіча",
#         "e-mail": "adolpfik322kawai@mail.com"
#     },
#     "mark": {
#         "Ім'я": "Марк",
#         "Вік": 96,
#         "e-mail": "markevych@tutamail.com"
#     },
# }

# users_input = input("Введіть ім'я користувачів, інформацію про яких хочете дізнатися\n->" ).split()
# information = input("Введіть яку інформацію ви хочете дізнатися; \n").split()
# for name in users_input:
#     user = users.get(name, {"Інфо": "немає такого імені"})
#     print(user)

#     for info in information:
#         print(user.get(info, f"Така інформація ({info}) відсутня для даного користувача"))











# Створіть словник, який містить ключ — ім’я студента, значення — список із балами.
# Попросіть користувача ввести ім’я студента.
# Порахувати середній бал студента, ім’я якого ввів користувач.
# math_scores = {
#     "Олександр": [8, 9, 7, 9, 6],
#     "Андрій": [10, 7, 9, 10, 10],
#     "Олег": [6, 7, 6, 9, 6]
# }

# name = input("Введіть ім'я студента, щоб дізнатись його середній бал: ")
# student_scores = math_scores.get(name, [0])
# avg = sum(student_scores) / len(student_scores)
# print(f"Середній бал студента '{name}' дорівнює {avg}")








# Створіть словник, який містить ключ — ім’я студента, значення — список із балами.
# Напишіть програму, яка порахує середній бал усіх учнів та виведе його на екран.
# math_scores = {
#     "Олександр": [8, 9, 7, 9, 6],
#     "Андрій": [10, 7, 9, 10, 10],
#     "Олег": [6, 7, 6, 9, 6]
# }










# Напишіть програму, яка дозволяє користувачу зберігати інформацію про товари у словник.
# Ключ — назва товару, а значення — ціна та кількість одиниць на складі.
# Програма повинна мати наступні опції: ✅ Додати новий товар ✅ Видалити товар
# ✅ Змінити ціну або кількість товару ✅ Переглянути список всіх товарів та їх характеристик












# Створіть словник, який містить ключ — назва книги, значення — кількість сторінок у ній.
# Напишіть програму, яка виводить на екран книгу з найбільшою кількістю сторінок.
# Вивести на екран книгу з найменшою кількістю сторінок.
# Порахувати середнє значення сторінок у всіх книгах.











# Потрібно підсумувати числа, виключивши будь-які цифри, які є частиною слова.
# Текст складається з чисел, пробілів та літер з англійського алфавіту.
# my_string = "This picture is an oil on canvas painting by Danish artist Anna Petersen between 1845 and 1910 year"










# Створіть словник, який містить дані про ціни на різні товари у різних магазинах.
# Ключами в цьому словнику будуть назви товарів, а значеннями — словники з назвами магазинів та цінами на ці товари у цих магазинах.
# prices = {
#     "яблоко": {"магазин_1": 2.5, "магазин_2": 2.3, "магазин_3": 2.2},
#     "банан": {"магазин_1": 1.5, "магазин_2": 1.3, "магазин_3": 1.2},
#     "апельсин": {"магазин_1": 3, "магазин_2": 2.9, "магазин_3": 3.2},
# }








# Посортувати за спаданням ціни

# products = [
#     {"name": "bread", "price": 100},
#     {"name": "wine", "price": 138},
#     {"name": "meat", "price": 15},
#     {"name": "water", "price": 1},
# ]









# Напишіть програму, яка питає у користувача, що він хоче купити.
# Вивести на екран номер магазину, в якому можна купити:
# ✅ найдешевше
# ✅ найдорожче










# Порахувати кількість входження слів у речені за записати їх у словник {"що", 3}
# my_string = "Напишіть програму, яка питає у користувача, що він хоче купити. Вивести на екран номер магазину, в якому можна купити"










# Порахувати середню ціну по всіх магазинах.











# Ваша задача - знайти кут підйому сонця над горизонтом, знаючи час доби.
# Вхідні дані: сонце сходить на сході о 6:00 ранку, що відповідає куту 0 градусів.
# О 12:00 дня сонце досягає зеніту, що означає, що кут дорівнює 90 градусів. 18:00 - час заходу сонця,
# тому кут дорівнює 180 градусам.
# Якщо на вхід буде подано час ночі (до 6:00 ранку або після 6:00 вечора),
# ваша програма повинна повернути - "I don't see the sun!".