
# Створіть словник, який містить ключ — ім’я студента, значення — список із балами.
# Попросіть користувача ввести ім’я студента.
# Порахувати середній бал студента, ім’я якого ввів користувач.
math_scores = {
    "Олександр": [8, 9, 7, 9, 6],
    "Андрій": [10, 7, 9, 10, 10],
    "Олег": [6, 7, 6, 9, 6]
}
name = input("Введіть імя стюдента щоб дізнатись середній бал")
student_scores = math_scores.get(name, [0])
aner =  sum(student_scores) / len(student_scores)
print(f"Середній бал студента '{name}' дорівнює {aner}")
