# Записати сторони трикутника, та знайти його площу
# S = sqrt(p(p-a)(p-b)(p-c))
# p = (a + b + c) / 2

# М'яч падає з висоти h. Знайти максимальну швидкість м'яча та за який час він упаде на землю.
# v = sqrt(2 * g * h)
# t = sqrt((2 * h) / g)

# first_number = 45.3
# second_number = -96.1
# bool_type = first_number > second_number and first_number > 0 and second_number < 0
# print(bool_type)

# Оголосити змінну “city”, в яку присвоїти назву міста.

# Оголосити три змінні, одна з яких дорівнюватиме довільному числу. Друга - в двічі більше число, третя - з протилежним знаком до другої змінної.

# Оголосити змінну - довжина ребра куба. Обчислити його об'єм і вивести на екран.

# Оголосити змінні — сторони довільного шестикутника. Обчислити периметр шестикутника та вивести його на екран.

# Оголосити змінні — площа кола. Визначити довжину кола та сторону вписаного правильного трикутника. Вивести на екран довжину кола та довжину сторони трикутника.
# R = sqrt(S / Pi)
# l = 2 * Pi * R
# a = R * sqrt(3)

# Оголосити змінні — 4 кути (їхня градусна міра). Оголосити наступну змінну is_quad, аби отримати булеве значення чи являється дана фігура чотирикутником

# Автомобіль на першій половині часу їхав зі швидкістю 36 км/год, а на другій — зі швидкістю 88.8 км/год. Знайти середню швидкість на всьому шляху.
# Vc = (V1 + V2) / 2

# Автомобіль на першій половині шляху їхав зі швидкістю 25.5 км/год, а на другій — зі швидкістю 101.3 км/год. Знайти середню швидкість на всьому шляху.
#Vc = (2 * V1 * V2) / (V1 + V2)

# Створити програму звертання до користувача, щоб він ввів довільний символ. Побудувати за його допомогою квадрат

# Створити програму обрахунку віку. Користувач вводить рік народження і поточний рік.

# Дано змінні A, B, C, D. Змінити їх значення, перемістивши вміст A — в D , D — в C , C — в B і вивести нові значення змінних A, B, C, D.


