# Зрізи

# Виокремлення ім’я та прізвища
# Заданий рядок, який містить ім’я та прізвище користувача, що розділені пробілом
# Написати програму з використанням зрізів, яка виокремить ім’я та прізвище

# pip = "Ivan Ivanov Ivanovich"
# delimiter = " "
# names = []

# if delimiter not in pip:
#     print("В даному рядку тільки одне слово")
# else:
#     delimiter_count = pip.count(delimiter)

#     idx = 0
#     for _ in range(delimiter_count):
#         idx_start = idx
#         idx = pip.find(delimiter, idx) + 1
#         name = pip[idx_start:idx-1]
#         names.append(name)
#     else:
#         name = pip[idx:]
#         names.append(name)

# print(names)

# Дано рядок, який містить довільне речення, слова в якому розділені пробілами.
# З використанням зрізів знайти і вивести слово, яке має найбільшу довжину.

# string = "Дано рядок, який містить довільне речення, слова в якому розділені пробілами. З використанням зрізів знайти і вивести слово, яке має найбільшу довжинуttttttttttttttttttttttttttttttt."
# delimiter = " "

# longest_word = ""
# len_longest_word = 0

# idx = 0
# delimiter_count = string.count(delimiter)

# for _ in range(delimiter_count+1):
#     idx_start = idx
#     idx = string.find(delimiter, idx) + 1
#     word = string[idx_start:idx-1]
#     len_word = len(word)
#     if len_word > len_longest_word:
#         longest_word = word
#         len_longest_word = len_word

# print(longest_word)

# Задано список номерів мобільних телефонів:
# Вважаючи, що всі номери записані у форматі +38 (код) 111-11-11,
# порахувати кількість абонентів оператора, що має коди «067», «097», «068»

# phones = ['+38(067) 999-99-99', '+38(066) 999-99-99','+38(067) 888-88-88', '+38(068) 777-77-77']
# codes = ['067', '097', '068']
# count = 0

# for number in phones:
#     if number[4:7] in codes:
#         count += 1

# print(count)


# Множини

### Створити множину

### Додати до неї новий елемент

### Видалити елемент з виключенням

### Видалити елемент з множини не викликаючи виключення


# Дано список клієнтів, які купили товар А та список клієнтів, які купили товар В.
# Знайти:
# - клієнтів, які купили обидва товари А і B
# - створити один список клієнтів, шляхом операції об’єднання






# Створіть список з чисел від 1 до 10 та використайте зрізи для виводу елементів від другого до п'ятого включно.
# Створіть рядок та використайте зрізи для виводу перших трьох та останніх трьох символів.
# Створіть список зі стрічок та використайте зрізи для виводу останніх трьох символів з кожної стрічки.
# Створіть список зі стрічок та використайте зрізи для виводу символів з кожної стрічки у зворотньому порядку.
# Створіть множину та перевірте, чи є вона підмножиною іншої множини.
# Створіть список, який містить у собі 10 стрічок, які складаються з двох слів, розділених пробілом. Використовуючи зрізи, виведіть на екран кожне слово з кожної стрічки у зворотньому порядку.
# Створіть множину, яка містить у собі числа від 1 до 20. Використовуючи методи множин, створіть дві нові множини - одну з парними числами, іншу з непарними числами.
# Створіть список, який містить у собі 20 випадкових чисел від 1 до 50. Використовуючи зрізи, виведіть на екран середнє арифметичне значення елементів з першої половини списку та другої половини списку окремо.
# Створіть дві множини, які містять у собі випадкові числа від 1 до 20. Виведіть на екран відсортований список з усіх унікальних чисел, які містяться в обох множинах.
# Створіть список, який містить у собі 10 випадкових чисел від 1 до 100. Використовуючи зрізи, виведіть на екран максимальне значення елементів з перших п'яти елементів списку, та мінімальне значення елементів з останніх п'яти елементів списку.
# Створіть множину, яка містить у собі 8 випадкових стрічок. Використовуючи методи множин, створіть нову множину, яка містить у собі усі унікальні букви, що зустрічаються в усіх стрічках.
# Створіть список, який містить у собі 10 випадкових стрічок, кожна з яких містить у собі випадкову кількість слів. Використовуючи зрізи та методи множин, виведіть на екран всі унікальні слова, які містяться у всіх стрічках.
# Створіть множину, яка містить у собі 10 випадкових чисел від 1 до 50. Використовуючи методи множин, створіть нову множину, яка містить у собі елементи з початку та кінця по одному. Наприклад, якщо вхідна множина містить елементи {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}, то нова множина повинна містити елементи {1, 10, 2, 9, 3, 8, 4, 7, 5, 6}.
