# Створіть словник з переліком фруктів та їх калорійністю.
# Виведіть на екран калорійність вашого улюбленого фрукту.
# fruits = {
#     "Яблоко": 132,
#     "Груша": 142,
#     "Апельсин": 456
#     }

# print(fruits["Апельсин"])


# Створіть словник з іменами та віком декількох людей.
# Виведіть на екран найстаршу людину.
# fruits = {
#     "Яблоко": 132,
#     "Груша": 1402,
#     "Апельсин": 456
#     }
# print(max(fruits.keys(), key=lambda k: fruits[k]))





# Створіть список з чисел від 1 до 10 та використайте зрізи для виводу елементів від другого до п'ятого включно.








# Створіть рядок та використайте зрізи для виводу перших трьох та останніх трьох символів.






# Створіть словник з назвами міст та їх кількістю населення.
# Виведіть на екран назву міста з найбільшою кількістю населення.






# Напишіть програму, яка об'єднує два словники в один.
# Ключі та значення в обох словниках повинні бути різними.






# Створіть список зі стрічок та використайте зрізи для виводу останніх трьох символів з кожної стрічки.







# Напишіть програму, яка дозволяє користувачам реєструватися на сайті та зберігає їх дані у словнику.
# Ключ — ім'я користувача, а значення — пароль.









# Перетворення рядка у словник. Напишіть програму, яка перетворює рядок у словник,
# де ключ — перша буква слова, а значення — саме слово.
# Рядок вводиться користувачем з клавіатури.






# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).








# Створіть список зі стрічок та використайте зрізи для виводу символів з кожної стрічки у зворотньому порядку.












# Гра "Вгадай слово".
# У цій грі комп'ютер загадує слово, а користувач повинен відгадати його, отримуючи на кожну спробу підказку від програми.
# Наприклад, на першій спробі програма може вивести довжину слова, на другій — першу букву слова, на третій — останню букву і т.д.










# Створіть програму, яка приймає рядок, та повертає рядок, з якого було видалено всі пробіли.








# Напишіть програму, яка приймає від користувача список з імен та оцінок, та обчислює середній бал для кожного учня.
# Результат виводиться у вигляді словника, де ключ — ім'я учня, а значення — середній бал.








# Створіть множину та перевірте, чи є вона підмножиною іншої множини.










# Напишіть програму, яка дозволяє користувачу зберігати інформацію про товари у словник.
# Ключ — назва товару, а значення — ціна та кількість одиниць на складі.
# Програма повинна мати наступні опції: ✅ Додати новий товар ✅ Видалити товар
# ✅ Змінити ціну або кількість товару ✅ Переглянути список всіх товарів та їх характеристик
