# Створіть словник з переліком фруктів та їх калорійністю.
# Виведіть на екран калорійність вашого улюбленого фрукту.
# fruits = {
#     "Яблоко": 132,
#     "Груша": 142,
#     "Апельсин": 456
#     }

# print(fruits["Апельсин"])


# Створіть словник з іменами та віком декількох людей.
# Виведіть на екран найстаршу людину.
# fruits = {
#     "Яблоко": 132,
#     "Груша": 1402,
#     "Апельсин": 456
#     }
# print(max(fruits.keys(), key=lambda k: fruits[k]))





# Створіть словник з назвами міст та їх кількістю населення.
# Виведіть на екран назву міста з найбільшою кількістю населення.






# Напишіть програму, яка об'єднує два словники в один.
# Ключі та значення в обох словниках повинні бути різними.
# dict_1 = {1: 1, 2: 2, 3: 3}
# dict_2 = {4: 4, 2: 2, 1: 3}
# dict_1.update(dict_2)
# print(dict_1)






# Напишіть програму, яка дозволяє користувачам реєструватися на сайті та зберігає їх дані у словнику.
# Ключ — ім'я користувача, а значення — пароль.






# Перетворення рядка у словник. Напишіть програму, яка перетворює рядок у словник,
# де ключ — перша буква слова, а значення — саме слово.
# Рядок вводиться користувачем з клавіатури.
# words = "Перетворення рядка у словник. Напишіть програму".split()
# my_dict = {word[0]: word for word in words}
# print(my_dict)





# Гра "Хто є хто".
# У цій грі користувач повинен відгадати тварину, яку ми загадали.
# Ми надаємо користувачеві опис цієї тварини, включаючи її колір, розмір, дії і т.д.
# Користувач повинен ввести свій варіант тварини, а програма повинна повідомити користувачеві, чи він відгадав правильно, чи ні.







# Гра "Вгадай слово".
# У цій грі комп'ютер загадує слово, а користувач повинен відгадати його, отримуючи на кожну спробу підказку від програми.
# Наприклад, на першій спробі програма може вивести довжину слова, на другій — першу букву слова, на третій — останню букву і т.д.





# Напишіть програму, яка приймає від користувача список з імен та оцінок, та обчислює середній бал для кожного учня.
# Результат виводиться у вигляді словника, де ключ — ім'я учня, а значення — середній бал.







# Напишіть програму, яка дозволяє користувачу зберігати інформацію про товари у словник.
# Ключ — назва товару, а значення — ціна та кількість одиниць на складі.
# Програма повинна мати наступні опції: ✅ Додати новий товар ✅ Видалити товар
# ✅ Змінити ціну або кількість товару ✅ Переглянути список всіх товарів та їх характеристик