# Створіть програму, яка приймає від користувача дві строки та перетворює їх у список,
# де перший елемент — це перша літера першої строки, другий елемент — друга літера першої строки,
# третій елемент — перша літера другої строки, четвертий — друга літера другої строки і т.д.
# Виведіть цей список.
first_string = "Привіт. Я з Одеси"
second_string = "Будемо знайомі"

my_list = []
for i in range(0, len(first_string) - 1, 2):
    if i < len(second_string):
        my_list.extend([first_string[i], first_string[i+1], second_string[i], second_string[i+1]])

print(my_list)
















# Створіть програму, яка приймає від користувача дві строки та знаходить найбільший загальний підрядок у цих строках. Виведіть цей підрядок.
# Створіть програму, яка приймає від користувача дві строки та знаходить найкоротший загальний підрядок у цих строках. Виведіть цю підрядок.
# Створіть програму, яка приймає від користувача дві строки та порівнює їх лексикографічно (за алфавітом). Виведіть результат порівняння у вигляді логічного значення (True або False).
# Створіть програму, яка приймає від користувача строку та знаходить кількість слів у цьому рядку (слово — це послідовність символів, розділених пробілами). Виведіть цю кількість.
# Створіть програму, яка приймає від користувача строку та знаходить кількість голосних літер у цьому рядку Виведіть цю кількість.
# Створіть програму, яка приймає від користувача строку та знаходить кількість приголосних літер у цьому рядку. Виведіть цю кількість.
# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом (слово, яке читається однаково зліва направо та справа наліво). Виведіть результат у вигляді логічного значення (True або False).
# Створіть програму, яка приймає від користувача дві строки та перевіряє, чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку). Виведіть результат у вигляді логічного значення (True або False).
# Створіть програму, яка приймає від користувача строку та знаходить найбільшу лексикографічно підпослідовність (послідовність символів, яка є підпослідовністю даної послідовності та має найбільше лексикографічне значення). Виведіть цю підпослідовність.
# Створіть програму, яка приймає від користувача строку та перетворює її у список, де кожен елемент — це слово зі строки. Виведіть цей список.
# Створіть програму, яка приймає від користувача дві строки та перетворює їх у список, де кожен елемент — це символ зі строки. Виведіть цей список.
# Створіть програму, яка приймає від користувача строку та знаходить кількість цифр у цій строці. Виведіть цю кількість.
