# Напишіть програму, яка приймає список чисел та повертає новий список, що містить лише унікальні елементи вхідного.
# Напишіть програму, яка приймає словник, та змінює всі значення на їх квадрати.
# Створіть програму, яка приймає список рядків та повертає список унікальних слів, які зустрічаються в цих рядках.
# Напишіть програму, яка приймає список рядків та повертає список, в якому кожен елемент — це рядок, який містить першу літеру кожного слова в вхідному рядку.
# Створіть програму, яка приймає список та повертає рядок, який містить всі елементи вхідного списку, розділені комами.
# Напишіть програму, яка приймає два словника та повертає словник, що містить ключі та значення обох вхідних словників.
# Створіть програму, яка приймає список та повертає список, який містить тільки непарні елементи вхідного списку.
# Напишіть програму, яка приймає два списки та повертає список, який містить елементи, які зустрічаються у обох вхідних списках.
# Створіть програму, яка приймає список та повертає словник, де ключі — це елементи списку, а значення — це кількість входжень цих елементів в список.
# Напишіть програму, яка приймає список чисел та повертає список, в якому кожен елемент — це кількість входжень цього числа в вхідному списку.
# Створіть програму, яка приймає список та повертає новий список, в якому всі елементи вхідного списку випадковим чином перетасовані.
# Напишіть програму, яка приймає словник та повертає список ключів, значення яких є максимальними у словнику.
# Створіть програму, яка приймає список та повертає новий список, в якому всі елементи вхідного списку упорядковані в зворотному порядку.
# Напишіть функцію, яка приймає два списки та повертає True, якщо обидва списки містять однакові елементи, незалежно від їх порядку.
# Створіть програму, яка приймає список та повертає новий список, в якому кожен елемент — це сума попередніх елементів вхідного списку (тобто, перший елемент нового списку — це перший елемент вхідного списку, другий елемент нового списку — це сума першого та другого елементів вхідного списку і т.д.).