animals = [
    "Кілер",
    "Катран",
    "Крістіан",
    "Кербер",
    "Дарлінг",
    "Рефлект",
    "Фарадей",
    "Діксон",
    "Арнольд",
    "Парнас"
]

animals_cured = []

commands = [
    "1. Показати список тварин на лікуванні",         # print(animals)
    "2. Додати нову тварину до списку на лікування",  # animals.append(animal)
    "3. Тварину вилікувано",                          # animals.remove(animal), animals_cured.append(animal)
    "4. Показати список вилікуваних тварин",          # print(animals_cured)
    "5. Вийти з програми",                            # break
#############################################################################################################
    "6. Видалити помилково додану тварину за ім'ям",
    "7. Видалити помилково додану тварину за номером",
    "8. Відсортувати список тварин за ім'ям",
    "9. Змінити ім'я тварини",                        # Видалити та вставити на її місце іншу (animals.insert(0, animal))
    "10. Знайти номер тварини за ім'ям"
]
