# if True:
#     print()
# else:
#     print()

                # b = 8

# b = ""
#       a = 5 if 5 > b else 10

# a = b or 6


# fruct_1 = "apple"
# fruct_1_w = 40
# fruct_2 = "strawberry"
# fruct_2_w = 80

# # if fruct_1_w > 50 and fruct_2_w > 50:
#     # pass

# for char in fruct_1:
#     print(char, end="hello\n")


# numbers = [5, 4, 5, 9]
# print(numbers)
# suma = 0

# for number in numbers:
# 	suma += number

# print(suma)
# a = 50

# for i in range(2, a + 1, 3):
#     print(f"В циклі {i=}")

# print(f"Поза циклом {i=}")



















# a = 1
# b = 5
# c = 1
# d = 5


# # print header
# print(end = '\t')
# for i in range(c, d + 1) :
#     print(i, end = '\t')
# print("")

# #print table
# for i in range(a, b + 1) :
#     print(i, end = '\t')
#     input()
#     for j in range(c, d + 1) :
#         print(i * j, end = '\t')
#     print("")


# a = 0

# while True:
#     command = input()

# string = ""

# for char in string:
#     pass
# else:
#     pass

# while True:
#     name = input('Enter name:')
#     if name == 'stop':
#         print("bye")
#         break
#     print('Hello', name)


# a = 0
# while a < 60:
#     a = a + 1
#     if a % 3:
#         continue
#     print(a)



# while True:
#     name = input('Enter name:')
#     if name == 'stop': break
#     print('Hello', name)



# a = 0
# while a < 6:
#     a = a + 1
#     if not a % 2:
#         continue
#     print(a)


# Організувати безперервне введення з клавіатури чисел.
# Якщо число більше 20, то вивести його на екран.
# Якщо число більше 100 — закінчити роботу програми.

# while True:
#     i = int(input())

#     if i > 100 :
#         break

#     if i < 20 :
#         continue

#     print(i)



# Оператори continue і break працюють тільки всередині одного циклу.
# У ситуації вкладених циклів немає способу вийти з усіх циклів одразу

# while True:
#     number = input("number = ")
#     number = int(number)
#     while True:
#         print(number)
#         number = number - 1
#         if number < 0:
#             break






# Порахувати середнє арифметичне всіх чисел кратних 5 з певного інтервалу







# Написати програму, яка буде підраховувати суму всіх парних чисел від 1 до 100.
# start = 1
# end = 100

# sum = 0

# for i in range(start, end + 1):
#     if i % 2 == 0:
#         sum += i

# print(sum)







# Написати програму, яка приймає на вхід рядок, введений з клавіатури,
# і підраховує кількість входження в рядок останньої літери,
# якою закінчується цей рядок.
# string = "Привіт. Мене звати Олександр. Живу в Одеській облас"

# count = 0

# for char in string:
#     if char == string[-2]:
#         count += 1

# print(f"К-ть {string[-1]} = {count}")

# while 0:
#     print("Hello")
# else:
#     print("hello")

########################



# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.
# count = int(input("Введіть к-ть товарів: "))

# coast = 85
# price = coast * count
# delivery = 150

# if price > 1300:
#     print("Безкоштовна доставка")
#     delivery = 0

# if price > 1000:
#     print("Знижка 10%")
#     price -= 0.1 * price
# elif price > 500:
#     print("Знижка 5%")
#     price -= 0.05 * price

# print(f"Ваш рахунок: {price + delivery}")







# Написати код який буде просити команду і відразу її друкувати
# до поки користувач не напише "stop", "exit" aбо "bye".
# stop = ["stop", "exit", "bye"]

# while True:
#     command = input("Введіть свою команду > ")

#     # if command == "stop" or command == "exit" or command == "bye":
#     if command in stop:
#         print("Bye bye")
#         break

#     print(f"{command = }")






# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).
# a = 57
# b = 60
# c = 56

# if a > b > c or a < b < c:
#     print(f"{b = }")
# elif b > a > c or b < a < c:
#     print(f"{a = }")
# elif a < c < b or a > c > b:
#     print(f"{c = }")






# Написати код який рахує добуток всіх чисел в діапазоні який задав користувач
# start = int(input("Введіть початок діапазону > "))
# end = int(input("Введіть кінець діаапзону > "))

# result = 1

# for i in range(start, end + 1):
#     result *= i

# print(f"Добуток чисел від {start} до {end} дорівнює {result}")








# Арифметичні дії над числами пронумеровані
# таким чином: 1 — додавання, 2 — віднімання, 3 — множення, 4 — ділення.
# Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0).
# Виконати над числами вказану дію та вивести результат.
# print("Дії: 1 — додавання, 2 — віднімання, 3 — множення, 4 — ділення")
# A = float(input("Введіть число A: "))
# B = float(input("Введіть число B: "))
# N = int(input("Введіть номер дії: "))

# result = 0

# if N == 1:
#     result = A + B
# elif N == 2:
#     result = A - B
# elif N == 3:
#     result = A * B
# elif N == 4:
#     result = A / B

# print(f"Дія {N} з числами {A} та {B}: {result}")




# Написати програму, яка виведе список квадратів чисел.
# a = "Hello"

# for _ in range(5):
#     print(a)






# Одиниці вимірювання довжини пронумерованітак:
# 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр.
# Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та
# довжина відрізка в цих одиницях(дійсне ціле).
# Знайти довжину відрізка в метрах.
# while True:
#     l = float(input("Введіть довжину відрізка > "))
#     n = int(input("1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр: "))

#     if n == 1:
#         l /= 10
#     elif n == 2:
#         l *= 1000
#     elif n == 4:
#         l /= 1000
#     elif n == 5:
#         l /= 100

#     print(f"Довжина відрізка {l} м")









# Написати програму, яка виведе числа від 7 до 77 використовуючи цикл





# На технічній співбесіді претенденти на посаду одержують оцінку за тест.
# У наступний тур співбесіди проходять кандидати, які склали тест на 83 бали включно або вище.
# Реалізуйте оператор контролю виконання так, щоб він привласнив логічній змінній is_next значення True,
# якщо кількість набраних балів буде більшою або дорівнює 83.
# В іншому випадку значення змінної дорівнює False.






# Дано змінну a = -56. Виводити a, поки a <= 15, збільшуючи змінну на 3





# Дано ціле число, що лежить у діапазоні 1-999.
# Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.






# Написати програму, яка на початку додасть “I am glad to see you, ” до кожного із імен в списку
# і виведе привітання на екран.
# lst=["Alex", "Petro", "Max", "Andrii", "Lev"]. Приклад — I am glad to see you, Alex!






# Необхідно обчислити корінь квадратного рівняння.
# a · x2 + b · x + c = 0
# Дискримінант рівняння помістіть у змінну D
# D = b2 - 4 · a · c
# Корінь рівняння помістіть у змінні x1 та x2
# x1 = (-b + D ** 0.5) / (2 · a)
# x2 = (-b - D ** 0.5) / (2 · a)










# Дано слово "Молоко". За допомогою циклу порахувати скільки літер "о" містить в собі це слово.
# string = "Молоко"








# Зробити попередню програму більш універсальною:
# Запитувати у користувача речення та літеру для пошуку.









# Використати блок “else” щоб вивести повідомлення "Цикл повністю завершився"
# після успішного виходу з циклу (довільний)








# Написати програму, яка порахує і виведе числа у квадраті від 1 до числа, яке задасть користувач









# Дано дійсне число — ціна 2 л молока. Вивести вартість 1, 2, ..., 10 л молока.








# Дано дійсне число - ціна 3 кг сала. Вивести вартість 1.2, 1.4, ..., 2 кг сала.









# Дано діапазон чисел від -100 до 0. Вивести на екран лише числа, які закінчуються на нуль








# Дано діапазон чисел (Користувач обирає сам (input)).
# Вивести на екран лише числа, які діляться на 3 та закінчуються на нуль







# Написати програму, яка виведе факторіал числа, яке задасть користувач (цикл while)






# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”



