# if True:
#     print()
# else:
#     print()

                # b = 8

# b = ""
#       a = 5 if 5 > b else 10

# a = b or 6


# fruct_1 = "apple"
# fruct_1_w = 40
# fruct_2 = "strawberry"
# fruct_2_w = 80

# # if fruct_1_w > 50 and fruct_2_w > 50:
#     # pass

# for char in fruct_1:
#     print(char, end="hello\n")


# numbers = [5, 4, 5, 9]
# print(numbers)
# suma = 0

# for number in numbers:
# 	suma += number

# print(suma)
# a = 50

# for i in range(2, a + 1, 3):
#     print(f"В циклі {i=}")

# print(f"Поза циклом {i=}")



















# a = 1
# b = 5
# c = 1
# d = 5


# # print header
# print(end = '\t')
# for i in range(c, d + 1) :
#     print(i, end = '\t')
# print("")

# #print table
# for i in range(a, b + 1) :
#     print(i, end = '\t')
#     input()
#     for j in range(c, d + 1) :
#         print(i * j, end = '\t')
#     print("")


# a = 0

# while True:
#     command = input()

# string = ""

# for char in string:
#     pass
# else:
#     pass

# while True:
#     name = input('Enter name:')
#     if name == 'stop':
#         print("bye")
#         break
#     print('Hello', name)


# a = 0
# while a < 60:
#     a = a + 1
#     if a % 3:
#         continue
#     print(a)



# while True:
#     name = input('Enter name:')
#     if name == 'stop': break
#     print('Hello', name)



# a = 0
# while a < 6:
#     a = a + 1
#     if not a % 2:
#         continue
#     print(a)


# Організувати безперервне введення з клавіатури чисел.
# Якщо число більше 20, то вивести його на екран.
# Якщо число більше 100 — закінчити роботу програми.

# while True:
#     i = int(input())

#     if i > 100 :
#         break

#     if i < 20 :
#         continue

#     print(i)



# Оператори continue і break працюють тільки всередині одного циклу.
# У ситуації вкладених циклів немає способу вийти з усіх циклів одразу

# while True:
#     number = input("number = ")
#     number = int(number)
#     while True:
#         print(number)
#         number = number - 1
#         if number < 0:
#             break






# Порахувати середнє арифметичне всіх чисел кратних 5 з певного інтервалу







# Написати програму, яка буде підраховувати суму всіх парних чисел від 1 до 100.
# start = 1
# end = 100

# sum = 0

# for i in range(start, end + 1):
#     if i % 2 == 0:
#         sum += i

# print(sum)







# Написати програму, яка приймає на вхід рядок, введений з клавіатури,
# і підраховує кількість входження в рядок останньої літери,
# якою закінчується цей рядок.
# string = "Привіт. Мене звати Олександр. Живу в Одеській облас"

# count = 0

# for char in string:
#     if char == string[-2]:
#         count += 1

# print(f"К-ть {string[-1]} = {count}")

# while 0:
#     print("Hello")
# else:
#     print("hello")

########################



# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.






# Написати код який буде просити команду і відразу її друкувати
# до поки rjhbcnedfx не напише "stop", "exit" aбо "bye".






# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).







# Написати код який рахує добуток всіх чисел в діапазоні який задав користувач




# Арифметичні дії над числами пронумеровані
# таким чином: 1 — додавання, 2 — віднімання, 3 — множення, 4 — ділення.
# Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0).
# Виконати над числами вказану дію та вивести результат.






# Написати програму, яка виведе список квадратів чисел.





# Одиниці вимірювання довжини пронумерованітак:
# 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр.
# Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та довжина відрізка в цих одиницях(дійсне ціле).
# Знайти довжину відрізка в метрах.








# Написати програму, яка виведе числа від 7 до 77 використовуючи цикл





# На технічній співбесіді претенденти на посаду одержують оцінку за тест.
# У наступний тур співбесіди проходять кандидати, які склали тест на 83 бали включно або вище.
# Реалізуйте оператор контролю виконання так, щоб він привласнив логічній змінній is_next значення True,
# якщо кількість набраних балів буде більшою або дорівнює 83.
# В іншому випадку значення змінної дорівнює False.






# Дано змінну a = -56. Виводити a, поки a <= 15, збільшуючи змінну на 3





# Дано ціле число, що лежить у діапазоні 1-999.
# Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.






# Написати програму, яка на початку додасть “I am glad to see you, ” до кожного із імен в списку
# і виведе привітання на екран.
# lst=["Alex", "Petro", "Max", "Andrii", "Lev"]. Приклад — I am glad to see you, Alex!
