# a = 1
# b = 5
# c = 1
# d = 5


# #print header
# print(end = '\t')
# for i in range(c, d + 1) :
#     print(i, end = '\t')
# print("")

# #print table
# for i in range(a, b + 1) :
#     print(i, end = '\t')
#     for j in range(c, d + 1) :
#         print(i * j, end = '\t')
#     print("")


# a = 0
# while True:
#     print(a)
#     if a >= 20:
#         break
#     a = a + 1



# while True:
#     name = input('Enter name:')
#     if name == 'stop': break
#     print('Hello', name)



# a = 0
# while a < 6:
#     a = a + 1
#     if not a % 2:
#         continue
#     print(a)




# Організувати безперервне введення з клавіатури чисел.
# Якщо число більше 20, то вивести його на екран.
# Якщо число більше 100 — закінчити роботу програми.





# Оператори continue і break працюють тільки всередині одного циклу.
# У ситуації вкладених циклів немає способу вийти з усіх циклів одразу

# while True:
#     number = input("number = ")
#     number = int(number)
#     while True:
#         print(number)
#         number = number - 1
#         if number < 0:
#             break






# Порахувати середнє арифметичне всіх чисел кратних 5 з певного інтервалу
# start = int(input("Початок діапазону > "))
# end = int(input("Кінець діапазону > "))







# Написати програму, яка буде підраховувати суму всіх парних чисел від 1 до 100. ---------1






# Написати програму, яка приймає на вхід рядок, введений з клавіатури, ---------------2
# і підраховує кількість входження в рядок останньої літери,
# якою закінчується цей рядок.







# Дано ціле число, що лежить у діапазоні 1-999.
# Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.








# Написати код який буде просити команду і відразу її друкувати
# до поки він його не напише "stop", "exit" aбо "bye".









# Написати код який рахує добуток всіх чисел в діапазоні який задав користувач





# У нас є три логічні змінні.
# Перша визначає статус користувача is_active, яка дорівнює True або False.
# Друга is_admin визначає, чи є у користувача права адміністратора теж булевого типу.
# Третя is_permission — чи дозволено доступ, теж булевого типу.
# Приведіть змінні is_active, is_admin та is_permission до булевого вигляду.
# Надайте змінній access значення, яке покаже, чи є доступ у користувача. Використовуйте логічні оператори.
# Адміністратор завжди має доступ, незалежно від значень змінних is_permission та is_active.
# Користувач має доступ, тільки якщо is_permission дорівнює True та is_active також дорівнює True.








# Написати програму, яка виведе список квадратів чисел.












# Написати програму, яка виведе числа від 7 до 77 використовуючи цикл







# Як відомо, зазвичай розробників заведено поділяти на три категорії:
# Джун (Junior), Мідл ( Middle) — основний розробник у компанії та Сеньйор (Senior) — старший розробник.
# Орієнтовно можна вважати, що до 1 року роботи включно — це Джуніор,
# понад 5 років — це Сеньйор розробник, а від одного року до 5 включно — мідл.
# Є змінна work_experience, що визначає стаж роботи програміста.
# Залежно від стажу роботи, присвоїти змінній developer_type значення "Junior", "Middle" або "Senior".








# Дано змінну a = -56. Виводити a, поки a <= 15, збільшуючи змінну на 3












# Написати програму, яка на початку додасть “I am glad to see you, ” до кожного із імен в списку
# і виведе привітання на екран.
# lst = ["Alex", "Petro", "Max", "Andrii", "Lev"]. Приклад — I am glad to see you, Alex!








# Необхідно обчислити корінь квадратного рівняння.
# a · x2 + b · x + c = 0
# Дискримінант рівняння помістіть у змінну D
# D = b2 - 4 · a · c
# Корінь рівняння помістіть у змінні x1 та x2
# x1 = (-b + D ** 0.5) / (2 · a)
# x2 = (-b - D ** 0.5) / (2 · a)








# Дано слово "Молоко". За допомогою циклу порахувати скільки літер "о" містить в собі це слово.







# Зробити попередню програму більш універсальною — Запитувати у користувача речення та літеру для пошуку.









# Використати блок “else” щоб вивести повідомлення "Цикл повністю завершився" після успішного виходу з циклу (довільний)








# Написати програму, яка порахує і виведе числа у 4 степені від 1 до числа, яке задасть користувач









# Дано дійсне число — ціна 1 кг цукерок. Вивести вартість 1, 2, ..., 10 кг цукерок.
# Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 1.2, 1.4, ..., 2 кг цукерок.
# Дано діапазон чисел від 0 до 100. Вивести на екран лише парні числа
# Дано діапазон чисел (Користувач обирає сам (input)). Вивести на екран лише непарні числа і 0 (в кінці)
# Написати програму, яка виведе факторіал числа, яке задасть користувач (цикл while)
# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”



