

# Ввести рядок з клавіатури. Видалити з неї всі цифри

one_line_text = '''Textual data in Py453thon is handle345d with str objects, or strings.
            	Strings are immutable seque8888nces of Unicode code points.889
            	String lit11erals are written in a variety5443 of ways.'''

# new_string = ""
# for char in one_line_text:
#     if not char.isdigit():
#         new_string += char

# print(new_string)
# chars = [char for char in one_line_text if not char.isdigit()]
# new_string = "".join(chars)
# print(new_string)





# print(one_line_text[-10:-20:-2])

# one_line_text[5] = "Абабагаламага"

# delimiter = "Hi there! " * 100
# print(delimiter)




# number_1 = input("Введіть число: ") # 5
# number_2 = input("Введіть число: ") # 6
# numbers = number_1 + number_2
# print(numbers)
# print(type(number))

# a = 5
# b = 6
# print(a)
# print(one_line_text + str(a))

# numbers = [1, 5, 6, 9]
# index = numbers.index(5)
# numbers[1] = 10
# print(numbers)


# str_by_numbers = str(numbers)
# new_numbers = list(str_by_numbers)
# print(new_numbers)

# print(f"{numbers[0] = }")
# print(f"{str_by_numbers[3] = }")

# print(type(str_by_numbers))












# Створіть програму, яка приймає від користувача два рядки та виводить повідомлення, де більше символів.
# string_1 = "ка приймає від користувача д"
# string_2 = "оріть програму"

# max_string = max(string_1, string_2, key=len)
# print(max_string)

# if len(string_1) > len(string_2):
#     print("string_1 > string_2")
# else:
#     print("string_1 < string_2")

# print("string_1 > string_2" if len(string_1) > len(string_2) else "string_1 < string_2")














# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”
# a = -569
# b = 842
# c = 9

# # count = 0
# # for number in range(a, b+1):
# #     if number % c == 0:
# #         count += 1 # count = count + 1

# # numbers = [number for number in range(a, b+1) if number % c == 0]
# numbers = [1 for number in range(a, b+1) if number % c == 0]
# count_1 = len(numbers)
# count_2 = sum(numbers)
# # print(f"{numbers = }")

# print(f"Кількість чисел, які діляться на {c} в діапазоні від {a} до {b} дорівнює {count_1}")
# print(f"Кількість чисел, які діляться на {c} в діапазоні від {a} до {b} дорівнює {count_2}")









# Створіть програму, яка приймає від користувача дві строки та порівнює їх лексикографічно (за алфавітом).
# Виведіть результат порівняння у вигляді логічного значення (True або False).

string_1 = "творіть програму, яка приймає від користувача дві"
string_2 = "творітьg програму, яка приймає від користувача дві"

# if string_1 == string_2:
#     print("Рядки однакові")
# else:
#     print("Рядки різні")

print("Рядки однакові" if string_1 == string_2 else "Рядки різні")







# Створіть програму, яка приймає від користувача строку та знаходить кількість слів у цьому рядку
# (слово — це послідовність символів, розділених пробілами). Виведіть цю кількість.

# string = "Створіть програму, яка приймає від користувача строку та знаходить кількість слів"











# Потрібно написати програму, що верифікує пароль
# Умовами верифікації є:
#  - довжина більше 6 символів;
#  - містить хоча б одну цифру, але не лише цифри;
#  - якщо пароль довший за 9 - попередня умова (про цифри) не вимагається;
#  - рядок не повинен містити слово "password" в жодному регістрі










# Створіть програму, яка приймає від користувача строку та знаходить кількість голосних літер у цьому рядку.
# Виведіть цю кількість.
# string = "Створіть програму, яка приймає від користувача строку та знаходить кількість голосних літер у цьому рядку"












# перевірити, чи всі елементи вказані в списку є однаковими
# first_list = [1, 1, 2, 1, 5]
# second_list = ["b", "b", "b", "b", "b"]
# third_list = [5, 5, "5", 5, "5"]


















# Створіть програму, яка приймає від користувача строку
# та знаходить кількість приголосних літер у цьому рядку.
# Виведіть цю кількість.




# Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]





# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).












# Даний список повинен бути "стиснутий" таким чином, щоб замість двох (або більше) однакових значень підряд було одне значення
# my_list = [5, 5, 5, 4, 5, 6, 6, 5, 5, 7, 8, 0, 0] # -> [5, 4, 5, 6, 5, 7, 8, 0]
# my_list = [1, 1, 1, 1, 2, 2, 2, 1, 1, 1] # -> [1, 2, 1]












# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).












# Тобі дано список з цілими числами. Твоя задача в цій місії - продублювати нулі
# my_list =  [100, 10, 0, 101, 1000] # -> [100, 10, 0, 0, 101, 1000]













# Створіть програму, яка приймає від користувача строку та перетворює її у список,
# де кожен елемент — це слово зі строки. Виведіть цей список.












# Створіть програму, яка приймає від користувача дві строки та перетворює їх у список,
# де перший елемент — це перша літера першої строки, другий елемент — перша літера другої строки, і т.д.
# Виведіть цей список.











# Створіть програму, яка приймає від користувача строку та знаходить кількість цифр у цій строці. Виведіть цю кількість.
