# обчислення факторіалу числа n (n!)










# Необхідно написати рекурсивну функцію для
# обчислення n-го числа Фібоначчі.
# Послідовність Фібоначчі починається з двох
# чисел 0 та 1, а кожне наступне число є сумою двох попередніх чисел.













# Створимо рекурсивну функцію, яка шукає
# елемент у списку і повертає True, якщо
# елемент знайдений, та False - в іншому випадку.










# Завдання 1: Сума чисел від 1 до N
# Вам потрібно написати рекурсивну функцію, яка обчислює суму
# усіх натуральних чисел від 1 до N,
# де N - це невід'ємне ціле число, передане як аргумент функції.















# Завдання 2: Перевернути рядок
# Створіть рекурсивну функцію, що приймає рядок як
# аргумент та повертає цей рядок у зворотньому порядку.
# Спробуйте не використовувати зрізи рядків або цикли.












# Завдання 3: Підрахунок кількості "x" у рядку
# Напишіть рекурсивну функцію, яка підраховує,
# скільки разів символ "x" зустрічається у даному рядку.
# Функція повинна бути чутливою до регістру.
