# LOGIN = "hello"
# PASS = "123456"
# print(LOGIN)

# LOGIN = "bay"
# print(LOGIN)

# a = 5
# b = 6

# if a < b:
#     print(a)
# else:
    # print("Тут нічого немає")


# elif a < b:
#     print(b)
# else:
#     print()

# if a == b:
#     print("a = b")


# user_name = input("Enter your name: ")
# print(user_name)
# if user_name:
# 	print(f"Hello {user_name}")
# else:
# 	print("Hi Anonym!")




# name = "Alex"
# age = 22
# has_driver_licence = True

# if name and age >= 18 and has_driver_licence:
#     print(f"User {name} can rent a car")
# else:
#     print("No name - no car")


# a = -5

# abs_number = a if a >=0 else -a
# print(abs_number)

# a = 5
# b = 1

# number = a or b or "aaaa"
# print(number)





# a = True or False
# print(a)




# a = True or False
# print(a)



# a = not 2 < 0
# print(a)


# is_nice = false
# state = "nice" if is_nice else "not nice"
# print(state)

# some_data = 123
# msg = "" or some_data
# print(msg)


# score = 5
# grade = "Pass" if score >= 60 else "Fail"
# print(grade)


# Оголосити змінні х, у, z  (числа). За допомогою умовного оператора перевірити яке число більше.
# x = 78
# y = 90
# z = 134





# Прийняти на вхід число — вік користувача. Перевірити чи може користувач самостійно відкрити рахунок у банку (вік >= 18)
# age = int(input("Введіть свій вік > "))






# Створити програму-помічник, яка приймає на вхід температуру води (float).
# Після цього програма проведе аналіз та підкаже, який стан води. (Принаймі 2 умови)





# Прийняти на вхід число, перевірити, чи закінчується число на 0.







# Дано ціле число. Якщо воно негативне, додати до нього 20; інакше відняти 5. Вивести отримане число.



# Дано ціле число. Якщо воно є позитивним, помножити його на 5; інакше піднести до степеня 3. Вивести отримане число.




# Дано чотири числа. Знайти кількість чисел, які діляться на 5.








# Дано п'ять чисел. Знайти кількість чисел, які ділять на 2 та к-ть чисел які діляться на 3 у даному наборі.






# Дано дві змінні дійсного типу: A, B.
# Перерозподілити значення даних змінних так, щоб в A опинилось більше значення, а B — менше.
# Вивести нові значення змінних A та B.








# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.








# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).






# Арифметичні дії над числами пронумеровані таким чином: 1 — додавання, 2 — віднімання, 3 — множення, 4 — ділення. Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0). Виконати над числами вказану дію та вивести результат.
# Одиниці вимірювання довжини пронумеровані так: 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр. Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та довжина відрізка в цих одиницях(дійсне ціле). Знайти довжину відрізка в метрах.
# Дано ціле число, що лежить у діапазоні 1-999. Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.