# my_list = ["a", "z", "c"]
# # my_list.sort(reverse=True)
# my_list_2 = sorted(my_list, reverse=True)
# print(my_list)
# print(my_list_2)



























# Створити програму, яка приймає список слів та повертає список слів у зворотньому порядку.

















# Створити програму, яка приймає список чисел та повертає список елементів, які є менші за середнє значення списку.
# my_list = [5, 12, -78, 100, -12]

# a / b
















# Написати програму, яка знайде список слів, які мають 5 і більше символів
# my_list = ["Привіт", "Кіт", "Житомир", "Собака", "Риба"]

# my_list_2 = [world + "4" for world in my_list if len(world) >= 5]

# for world in my_list:
#     if len(world) >= 5:
#         world += "4"
#         my_list_2.append(world) # 

# print(my_list_2)
















# З'єднати два списки
# my_list_1 = [1, 5, 8, 10]
# my_list_2 = ["Кіт", "Собака"]






















# До одного списку додати інший у зворотньому напрямку
# my_list_1 = [1, 5, 8, 10]
# my_list_2 = ["Кіт", "Собака"]



















# Написати програму, яка виведе факторіал числа, яке задасть користувач (цикл while)
# factorial(5) = 5 * 4 * 3 * 2 * 1




















# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”
a = 5
b = 4793
c = 7













# Потрібно написати програму, що верифікує пароль
# Умовами верифікації є:
#  - довжина більше 6 символів;
#  - містить хоча б одну цифру, але не лише цифри;
#  - якщо пароль довший за 9 - попередня умова (про цифри) не вимагається;
#  - рядок не повинен містити слово "password" в жодному регістрі
















# перевірити, чи всі елементи вказані в списку є однаковими
# first_list = [1, 1, 2, 1, 5]
# second_list = ["b", "b", "b", "b", "b"]
# third_list = [5, 5, "5", 5, "5"]


















# Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]











# Даний список повинен бути "стиснутий" таким чином, щоб замість двох (або більше) однакових значень підряд було одне значення
# my_list = [5, 5, 5, 4, 5, 6, 6, 5, 5, 7, 8, 0, 0] # -> [5, 4, 5, 6, 5, 7, 8, 0]
# my_list = [1, 1, 1, 1, 2, 2, 2, 1, 1, 1] # -> [1, 2, 1]















# Тобі дано список з цілими числами. Твоя задача в цій місії - продублювати нулі
# my_list =  [100, 10, 0, 101, 1000] # -> [100, 10, 0, 0, 101, 1000]