# Створити програму, яка приймає список слів та повертає список слів у зворотньому порядку.

















# Створити програму, яка приймає список чисел та повертає список елементів, які є менші за середнє значення списку.


















# Написати програму, яка знайде список слів, які мають 5 і більше символів


















# З'єднати два списки






















# До одного списку додати інший у зворотньому напрямку



















# Написати програму, яка виведе факторіал числа, яке задасть користувач (цикл while)




















# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”








# У цій місії тобі потрібно написати функцію, що верифікує пароль
# Умовами верифікації є:
# довжина більше 6 символів;
# містить хоча б одну цифру, але не лише цифри;
# якщо пароль довший за 9 - попередня умова (про цифри) не вимагається;
# рядок не повинен містити слово "password" в жодному регістрі