# string = "Ввести рядок 789 з клавіа11тури. Видалити102 з неї всі цифри7"

# string_clear = ""
# for char in string:
#     if char.isalpha():
#         string_clear += char

# print(string_clear)





















# Створіть програму, яка приймає від користувача дві строки та перетворює їх у список,
# де перший елемент — це перша літера першої строки, другий елемент — друга літера першої строки,
# третій елемент — перша літера другої строки, четвертий — друга літера другої строки і т.д.
# Виведіть цей список.
# first_string = "Створіть програму, яка приймає від користувача дві строки та перетворює їх у список"
# second_string = "третій елемент — перша літера другої строки"

# # my_list = ["С", "т", "т", "р", "в", "о", "е", "т"]
# my_list = []

# for i in range(0, len(first_string), 2):
#     if i < len(second_string) - 1:
#         my_list.extend([first_string[i], first_string[i+1], second_string[i], second_string[i+1]])
#     else:
#         break

# print(my_list)










# Створіть програму, яка приймає від користувача два рядки та виводить повідомлення, де більше символів.

# first_string = "Створіть програму, яка прийм"
# second_string = "третій елемент — перша літера другої строки"

# print("Перший рядок більший за другий" if len(first_string) > len(second_string) else "Другий рядок більший за перший")

























# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”
# a = 5
# b = 4793
# c = 7

# count = 0

# for i in range(a, b + 1):
#     if i % c == 0:
#         count += 1

# print(count)

















# Створіть програму, яка приймає від користувача дві строки та порівнює їх лексикографічно (за алфавітом).
# Виведіть результат порівняння у вигляді логічного значення (True або False).

# string_1 = "Створіть програму,  яка"
# string_2 = "Створіть програму, яка"

# is_eqv = string_1 == string_2

# print(is_eqv)











# Створіть програму, яка приймає від користувача строку та знаходить кількість слів у цьому рядку
# (слово — це послідовність символів, розділених пробілами). Виведіть цю кількість.
# string = "Створіть програму, яка приймає від користувача строку та знаходить кількість слів у цьому"
# my_list = [1 for char in string if char == " "]
# count_1 = len(my_list) + 1
# count_2 = sum(my_list) + 1

# print(f"Кількість слів у нашому рядку дорівнює: {count_1}")
# print(f"Кількість слів у нашому рядку дорівнює: {count_2}")
















# Потрібно написати програму, що верифікує пароль
# Умовами верифікації є:
#  - довжина більше 6 символів;
#  - містить хоча б одну цифру, але не лише цифри;
#  - якщо пароль довший за 9 - попередня умова (про цифри) не вимагається;
#  - рядок не повинен містити слово "password" в жодному регістрі
# password = input("Введіть свій пароль: ")

# is_valid = False

# if len(password) > 9 and "password" not in password.lower():
#     is_valid = True

# elif len(password) > 6 and "password" not in password.lower() and not password.isdigit():
#     for char in password:
#         if char.isdigit():
#             is_valid = True

# print(f"Пароль пройшов перевірку: {"Так" if is_valid else "Ні"}")














# Створіть програму, яка приймає від користувача строку та знаходить кількість голосних літер у цьому рядку.
# Виведіть цю кількість.
# string = "Створіть програму, яка приймає від користувача строку та знаходить кількість"
# my_list = ["о", "і", "а", "у", "е", "и", "я", "є", "ї"]

# count = 0
# for char in string:
#     if char in my_list:
#         count += 1

# count_list = ["sdsdsagjbkjdg" for char in string if char in my_list]
# print(count_list)

# print(f"Клькість голосних букв дорівнює: {len(count_list)}")













# перевірити, чи всі елементи вказані в списку є однаковими
# first_list = [1, 1, 2, 1, 5] # False
# second_list = ["b", "b", "b", "b", "b"] # True
# third_list = [5, 5, "5", 5, "5"] # False

# answ = True

# for i in range(1, len(third_list)):
#     if third_list[i] != third_list[i-1]:
#         answ = False
#         break


# print(answ)













# Створіть програму, яка приймає від користувача строку
# та знаходить кількість приголосних літер у цьому рядку.
# Виведіть цю кількість.




# Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]





# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).












# Даний список повинен бути "стиснутий" таким чином, щоб замість двох (або більше) однакових значень підряд було одне значення
# my_list = [5, 5, 5, 4, 5, 6, 6, 5, 5, 7, 8, 0, 0] # -> [5, 4, 5, 6, 5, 7, 8, 0]
# my_list = [1, 1, 1, 1, 2, 2, 2, 1, 1, 1] # -> [1, 2, 1]












# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).












# Тобі дано список з цілими числами. Твоя задача в цій місії - продублювати нулі
# my_list =  [100, 10, 0, 101, 1000] # -> [100, 10, 0, 0, 101, 1000]












# Створіть програму, яка приймає від користувача строку та перетворює її у список,
# де кожен елемент — це слово зі строки. Виведіть цей список.












# Створіть програму, яка приймає від користувача дві строки та перетворює їх у список,
# де перший елемент — це перша літера першої строки, другий елемент — перша літера другої строки, і т.д.
# Виведіть цей список.











# Створіть програму, яка приймає від користувача строку та знаходить кількість цифр у цій строці. Виведіть цю кількість.
