# LOGIN = "hello"
# PASS = "123456"
# print(LOGIN)

# LOGIN = "bay"
# print(LOGIN)

# a = None
# b = 6

# if a < b:
#     print(a)
# else:
    # print("Тут нічого немає")


# elif a < b:
#     print(b)
# else:
#     print()

# if a == b:
#     print("a = b")


# user_name = "0" #input("Enter your name: ")
# print(user_name)
# if user_name:
# 	print(f"Hello {user_name}")
# else:
# 	print("Hi Anonym!")




# name = ""
# age = 22
# has_driver_licence = True

# if name and age >= 18 and has_driver_licence:
#     print(f"User {name} can rent a car")
# else:
#     print("No name - no car")


# a = -5

# abs_number = a if a >=0 else -a
# print(abs_number)

# a = 5
# b = 1

# number = a or b or "aaaa"
# print(number)


# X = float(input("Введіть X="))
# Y = float(input("Введіть Y="))

# if X > 0 and Y > 0:
#     print("1")

# elif X < 0 and Y > 0:
#     print("2")

# elif X < 0 and Y < 0:
#     print("3")

# elif X > 0 and Y < 0:
#     print("4")



# a = True or False
# print(a)




# a = True or False
# print(a)



# a = not 2 < 0
# print(a)


# is_nice = false
# state = "nice" if is_nice else "not nice"
# print(state)

# some_data = 123
# msg = "" or some_data
# print(msg)


# score = 5
# grade = "Pass" if score >= 60 else "Fail"
# print(grade)


# Оголосити змінні х, у, z  (числа). За допомогою умовного оператора перевірити яке число більше.
# x = 78
# y = 90
# z = 134

# if x > y:
#     if x > z:
#         print(x)
#     else:
#         print(z)
# elif y > z:
#     print(y)
# else:
#     print(z)

# if x > y and x > z:
#     print(x)
# elif x > y and x < z:
#     print(z)





# Прийняти на вхід число — вік користувача. Перевірити чи може користувач самостійно відкрити рахунок у банку (вік >= 18)
# age = int(input("Введіть свій вік > "))

# conclusion = "Ви можете відкрити рахунок" if age >= 18 else "Нажаль Ви не зможете відкрити рахунок"
# print(conclusion)




# Створити програму-помічник, яка приймає на вхід температуру води (float).
# Після цього програма проведе аналіз та підкаже, який стан води. (Принаймі 2 умови)
# temp = float(input("Температура="))

# if temp >= 100:
#     print("Пара")

# elif temp > 0:
#     print("Рідина")

# else:
#     print("Лід")




# Прийняти на вхід число, перевірити, чи закінчується число на 0.
# a = 1301

# if a % 10:
#     print("Не закінчується на '0'")
# else:
#     print("Закінчується на '0'")
#################################################################





# Дано ціле число. Якщо воно негативне, додати до нього 20; інакше відняти 5. Вивести отримане число.



# Дано ціле число. Якщо воно є позитивним, помножити його на 5; інакше піднести до степеня 3. Вивести отримане число.




# Дано чотири числа. Знайти кількість чисел, які діляться на 5.








# Дано п'ять чисел. Знайти кількість чисел, які ділять на 2 та к-ть чисел які діляться на 3 у даному наборі.






# Дано дві змінні дійсного типу: A, B.
# Перерозподілити значення даних змінних так, щоб в A опинилось більше значення, а B — менше.
# Вивести нові значення змінних A та B.








# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.








# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).






# Арифметичні дії над числами пронумеровані таким чином: 1 — додавання, 2 — віднімання, 3 — множення, 4 — ділення. Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0). Виконати над числами вказану дію та вивести результат.
# Одиниці вимірювання довжини пронумеровані так: 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр. Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та довжина відрізка в цих одиницях(дійсне ціле). Знайти довжину відрізка в метрах.
# Дано ціле число, що лежить у діапазоні 1-999. Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.