# Trailing Spaces
# Rainbow Brackets

# Print

# print("Hello' world", 5, 7.4)

# print(((((('Hello'))))))

# print("Hello")
# print("Ім'я")

# print('''Hello''')
# print("""Моє ім'я "підставити своє ім'я" """)

#  __      ______  _________   ___ __ __  ______        ________  _________
# /_/\    /_____/\/________/\ /__//_//_/\/_____/\      /_______/\/________/\
# \:\ \   \::::_\/\__.::.__\/ \::\| \| \ \::::_\/_     \__.::._\/\__.::.__\/
#  \:\ \   \:\/___/\ \::\ \    \:.      \ \:\/___/\       \::\ \    \::\ \
#   \:\ \___\::___\/_ \::\ \    \:.\-/\  \ \::___\/_      _\::\ \__  \::\ \
#    \:\/___/\:\____/\ \::\ \    \. \  \  \ \:\____/\    /__\::\__/\  \::\ \
#     \_____\/\_____\/  \__\/     \__\/ \__\/\_____\/    \________\/   \__\/


# print("""
#  __      ______  _________   ___ __ __  ______        ________  _________
# /_/\\    /_____/\\/________/\\ /__//_//_/\\/_____/\\      /_______/\\/________/\\
# \\:\\ \\   \\::::_\\/\\__.::.__\\/ \\::\\| \\| \\ \\::::_\\/_     \\__.::._\\/\\__.::.__\\/
#  \\:\\ \\   \\:\\/___/\\ \\::\\ \\    \\:.      \\ \\:\\/___/\\       \\::\\ \\    \\::\\ \\
#   \\:\\ \\___\\::___\\/_ \\::\\ \\    \\:.\\-/\\  \\ \\::___\\/_      _\\::\\ \\__  \\::\\ \\
#    \\:\\/___/\\:\\____/\\ \\::\\ \\    \\. \\  \\  \\ \\:\\____/\\    /__\\::\\__/\\  \\::\\ \\
#     \\_____\\/\\_____\\/  \\__\\/     \\__\\/ \\__\\/\\_____\\/    \\________\\/   \\__\\/
# """)

# Типи змінних

a = 9 # int - integer
b = 4.6 # float
c = "Hi" # str - string
print("a1", a)
print('')
a = 7
print("a2", a)
# print(f"{a}")
# print(f"{a=}")
# print(f"{a = }")

# print("{}".format(a))
# print("{a}".format(a=a))
# print("{a}".format(a=9))
# print("{b}".format(b=a))


# b = 11
# print("a + b =", a + b, end=", ")
# print(f"a + b = {a + b}")
# print(a, '+', b, '=', a + b)

# print(1, 2, 3, 4, 5, 6, sep='-')
# print(1, 2, 3, 4, 5, 6, sep='\n')

# Мене-!-звати-!-Микола-!-Олександрович

# print("12" + "25")



# Input

# input("What is your name? My name is ")

# name = input("Enter your name: ")
# print(f"My name is {name}")

# age = input("How old are you? ")
# print("Мені {}".format(age))

# city = input("Where do you live? ")
# print(f"Я живу у місті {city}")

# print(f"Мене звати {name}. Мені {age} років. На даний час я проживаю в місті {city}")

# a = int(input("Введіть число 1: "))
# b = int(input("Введіть число 2: "))
# print(a + b)

# Передати програмі кількість своїх домашніх тварин.
# Порахувати скільки всього тварин є в домогосподарстві,
# та вивести повідомлення у форматі "Котів: 5, собак: 1, корів: 9. Всього тварин 15"



# float

# a = int(float(input("Введіть перше ціле число:\n")))
# b = int(float(input("Введіть друге ціле число:\n")))
# print(a, '+', b, '=', a + b)
# print(a, '-', b, '=', a - b)
# print(a, '*', b, '=', a * b)
# print(a, '/', b, '=', a / b)
# print(a, '**', b, '=', a ** b)
# print(a, '//', b, '=', a // b)
# print(a, '%', b, '=', a % b)

# Написати програму, яка буде рахувати площу поля за довжиною та шириною

# length = input("Введіть довжину поля: ")
# width = input("Введіть ширину поля: ")

# area = float(length) * float(width)

################

# Напишіть програму для підрахунку дрібних грошей. Вона повинна питати:

# «Скільки у вас монет по 50 копійок?»;
# «Скільки у вас монет по 25 копійок?»;
# «Скільки у вас монет по 10 копійок?»;
# «Скільки у вас монет по 5 копійок?».
# Після цього на екрані повинна з'явитися загальна сума.

# count_50 = int(input("Скільки у вас монет по 50 копійок? "))
# count_25 = int(input("Скільки у вас монет по 25 копійок? "))
# count_10 = int(input("Скільки у вас монет по 10 копійок? "))
# count_5 = int(input("Скільки у вас монет по 5 копійок? "))



# Обчисліть добуток перших 20 натуральних чисел. Виведіть на екран обчислене значення.




# Запишіть букву 'A' (латинську, велику) 87 разів поспіль.





# Запишіть слово 'Python' 53 раз поспіль.