# user_name = input("Введи своє ім'я: ")

# if user_name:
#     print(f"Вітаю {user_name} в нашій системі")

# else:
#     print(f"Вітаю в нашій системі")

# name = "Тарас"
# age = 25
# has_driver_licence = True

# if name and age >= 18 and not has_driver_licence:
#     print("Щасливої дороги")

# else:
#     print("У Вас не має дозволу рухатись далі")

# age = 15
# is_adult = True if age >= 18 else False

# if age >= 18:
#     is_adult = True
# else:
#     is_adult = False

# count_apple = 1
# print("На складі залишилось мало яблук" if count_apple < 2 else "Яблук на складі достатньо")

# apple = None
# count = apple or False
# print(count)

# x = -89
# y = 5

# if x > 0 and y > 0:
#     print("Перша четверть")

# elif x < 0 and y > 0:
#     print("Друга четверть")

# elif x < 0 and y < 0:
#     print("Третя четверть")

# elif x > 0 and y < 0:
#     print("Четверта четверть")

# name = input("Введіть ім'я студента: ")
# score = input("Введіть бал студента: ")
# score = float(score)

# if name and score > 80:
#     print(f"Студент '{name}' здав іспит")
# elif not name:
#     print("Ім'я студента є обов'язковим")
# else:
#     print(f"Студент '{name}' не здав іспит")




# Оголосити змінні х, у, z  (числа). За допомогою умовного оператора перевірити яке число більше.
# x = 78000
# y = 900
# z = 134

# if x > y and x > z:
#     print(f"Число {x=} найбільше")
# elif y > x and y > z:
#     print(f"Число {y=} найбільше")
# else:
#     print(f"Число {z=} найбільше")






# Прийняти на вхід число — вік користувача. Перевірити чи може користувач самостійно відкрити рахунок у банку (вік >= 18)
# age = input("Введи свій вік: ")
# age = int(age)
# print("Користувач може відкрити рахунок" if age >= 18 else "Користувач не може відкрити рахунок")









# Створити програму-помічник, яка приймає на вхід температуру води (float).
# Після цього програма проведе аналіз та підкаже, який стан води. (Принаймі 2 умови)
# temp = input("Введіть температуру: ")
# temp = float(temp)

# if temp < 0 :
#     print("Вода знаходиться у твердому стані")
# elif 0 <= temp < 100:
#     print("Вода знаходиться у рідкому стані")
# else:
#     print("Вода знаходиться у газоподібному стані")





# Прийняти на вхід число, перевірити, чи закінчується число на 0.
# a = input("Введи число: ")
# a = float(a)
# if a % 10 == 0:
#     print("Число закінчується на нуль")
# else:
#     print("Число не закінчується на нуль")









# Дано ціле число. Якщо воно від'ємне, додати до нього 20; інакше відняти 5.
# Вивести отримане число.
# a = input("Введи ціле число: ")
# a = int(a)

# # if a < 0:
# #     a += 20 # a = a + 20
# # else:
# #     a -= 5 # a = a - 5

# a = a + 20 if a < 0 else a - 5

# print(a)

# +=
# -=
# *=
# /=
#  **=



# Дано ціле число. Якщо воно є позитивним, помножити його на 5; інакше піднести до степеня 3.
# Вивести отримане число.







# Дано чотири числа. Знайти кількість чисел, які діляться на 5.
# a = 13
# b = 11
# c = -85
# d = 9719

# count = 0

# if a % 5 == 0:
#     count += 1

# if b % 5 == 0:
#     count += 1

# if c % 5 == 0:
#     count += 1

# if d % 5 == 0:
#     count += 1

# string = f"Кількість чисель, які діляться на 5 дорівнює {count}" if count else "Відсутні такі числа"
# print(string)






# Дано п'ять чисел.
# Знайти кількість чисел, які ділять на 2 та к-ть чисел які діляться на 3 у даному наборі.






# Дано дві змінні дійсного типу: A, B.
# Перерозподілити значення даних змінних так, щоб в A опинилось більше значення, а B — менше.
# Вивести нові значення змінних A та B.





# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.








# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).






# Дано три числа.
# Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).





# Арифметичні дії над числами пронумеровані таким чином:
# 1 — ділення на ціло, 2 — залишок від ділення, 3 — піднесення до 2 степення, 4 — піднесення до 3 степеня.
# Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0).
# Виконати над числами вказану дію та вивести результат.






# Одиниці вимірювання довжини пронумеровані так:
# 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр.
# Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та довжина відрізка в цих одиницях(дійсне ціле).
# Знайти довжину відрізка в метрах.









# На технічній співбесіді претенденти на посаду одержують оцінку за тест.
# У наступний тур співбесіди проходять кандидати, які склали тест на 83 бали включно або вище.
# Реалізуйте оператор контролю виконання так, щоб він привласнив логічній змінній is_next значення True,
# якщо кількість набраних балів буде більшою або дорівнює 83.
# В іншому випадку значення змінної дорівнює False.









# Дано ціле число, що лежить у діапазоні 1-999.
# Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.








# У нас є три логічні змінні.
# Перша визначає статус користувача is_active, яка дорівнює True або False.
# Друга is_admin визначає, чи є у користувача права адміністратора теж булевого типу.
# Третя is_permission — чи дозволено доступ, теж булевого типу.
# Приведіть змінні is_active, is_admin та is_permission до булевого вигляду.
# Надайте змінній access значення, яке покаже, чи є доступ у користувача. Використовуйте логічні оператори.
# Адміністратор завжди має доступ, незалежно від значень змінних is_permission та is_active.
# Користувач має доступ, тільки якщо is_permission дорівнює True та is_active також дорівнює True.





# Як відомо, зазвичай розробників заведено поділяти на три категорії:
# Джун (Junior), Мідл ( Middle) — основний розробник у компанії та Сеньйор (Senior) — старший розробник.
# Орієнтовно можна вважати, що до 1 року роботи включно — це Джуніор,
# понад 5 років — це Сеньйор розробник, а від одного року до 5 включно — мідл.
# Є змінна work_experience, що визначає стаж роботи програміста.
# Залежно від стажу роботи, присвоїти змінній developer_type значення "Junior", "Middle" або "Senior".








# Необхідно обчислити корінь квадратного рівняння.
# a · x2 + b · x + c = 0
# Дискримінант рівняння помістіть у змінну D
# D = b2 - 4 · a · c
# Корінь рівняння помістіть у змінні x1 та x2
# x1 = (-b + D ** 0.5) / (2 · a)
# x2 = (-b - D ** 0.5) / (2 · a)

