# Оголосити змінні х, у, z  (числа). За допомогою умовного оператора перевірити яке число більше.
# x = 78
# y = 90
# z = 134







# Прийняти на вхід число — вік користувача. Перевірити чи може користувач самостійно відкрити рахунок у банку (вік >= 18)






# Створити програму-помічник, яка приймає на вхід температуру води (float).
# Після цього програма проведе аналіз та підкаже, який стан води. (Принаймі 2 умови)






# Прийняти на вхід число, перевірити, чи закінчується число на 0.
# a = 1301









# Дано ціле число. Якщо воно від'ємне, додати до нього 20; інакше відняти 5.
# Вивести отримане число.




# Дано ціле число. Якщо воно є позитивним, помножити його на 5; інакше піднести до степеня 3.
# Вивести отримане число.







# Дано чотири числа. Знайти кількість чисел, які діляться на 5.









# Дано п'ять чисел.
# Знайти кількість чисел, які ділять на 2 та к-ть чисел які діляться на 3 у даному наборі.






# Дано дві змінні дійсного типу: A, B.
# Перерозподілити значення даних змінних так, щоб в A опинилось більше значення, а B — менше.
# Вивести нові значення змінних A та B.





# Магазин дає знижку 5%, якщо покупець здійснить покупку більше ніж на 500 грн, 10% - більше 1000 грн.
# Доставка коштує 150 грн, але при покупці більше ніж на 1300 грн доставка безкоштовна.
# Завдання: Запитати у користувача кількість купленого товару. Нехай одна одиниця товару коштує 85 грн.
# Перевірити та порахувати загальну суму для користувача.








# Дано три числа. Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).






# Дано три числа.
# Знайти середнє з них (тобто число, розташоване між найменшим та найбільшим).





# Арифметичні дії над числами пронумеровані таким чином:
# 1 — ділення на ціло, 2 — залишок від ділення, 3 — піднесення до 2 степення, 4 — піднесення до 3 степеня.
# Дано номер дії N (ціле число в діапазоні 1–4) та дійсні числа A та B (B не дорівнює 0).
# Виконати над числами вказану дію та вивести результат.






# Одиниці вимірювання довжини пронумеровані так:
# 1 — дециметр, 2 — кілометр, 3 — метр, 4 — міліметр, 5 — сантиметр.
# Дано номер одиниці вимірювання довжини (ціле число в діапазоні 1–5) та довжина відрізка в цих одиницях(дійсне ціле).
# Знайти довжину відрізка в метрах.









# На технічній співбесіді претенденти на посаду одержують оцінку за тест.
# У наступний тур співбесіди проходять кандидати, які склали тест на 83 бали включно або вище.
# Реалізуйте оператор контролю виконання так, щоб він привласнив логічній змінній is_next значення True,
# якщо кількість набраних балів буде більшою або дорівнює 83.
# В іншому випадку значення змінної дорівнює False.









# Дано ціле число, що лежить у діапазоні 1-999.
# Вивести рядок-опис виду «парне двозначне число», «непарне тризначне число» тощо.








# У нас є три логічні змінні.
# Перша визначає статус користувача is_active, яка дорівнює True або False.
# Друга is_admin визначає, чи є у користувача права адміністратора теж булевого типу.
# Третя is_permission — чи дозволено доступ, теж булевого типу.
# Приведіть змінні is_active, is_admin та is_permission до булевого вигляду.
# Надайте змінній access значення, яке покаже, чи є доступ у користувача. Використовуйте логічні оператори.
# Адміністратор завжди має доступ, незалежно від значень змінних is_permission та is_active.
# Користувач має доступ, тільки якщо is_permission дорівнює True та is_active також дорівнює True.





# Як відомо, зазвичай розробників заведено поділяти на три категорії:
# Джун (Junior), Мідл ( Middle) — основний розробник у компанії та Сеньйор (Senior) — старший розробник.
# Орієнтовно можна вважати, що до 1 року роботи включно — це Джуніор,
# понад 5 років — це Сеньйор розробник, а від одного року до 5 включно — мідл.
# Є змінна work_experience, що визначає стаж роботи програміста.
# Залежно від стажу роботи, присвоїти змінній developer_type значення "Junior", "Middle" або "Senior".








# Необхідно обчислити корінь квадратного рівняння.
# a · x2 + b · x + c = 0
# Дискримінант рівняння помістіть у змінну D
# D = b2 - 4 · a · c
# Корінь рівняння помістіть у змінні x1 та x2
# x1 = (-b + D ** 0.5) / (2 · a)
# x2 = (-b - D ** 0.5) / (2 · a)

