# Наслідування (Inheritance)
















# Інкапсуляція (Encapsulation)









# Завдання
# 1. Створити клас BankAccount, який матиме публічний
# атрибут account_holder, захищений атрибут _balance
# та приватний атрибут __pin_code.
# 2. Забезпечити можливість взаємодії з балансом через публічні методи, не дозволяючи змінювати баланс напряму.
# 3. Використати захищений метод для перевірки балансу.
# 4. Забезпечити приватний метод для оновлення PIN-коду.



# Завдання 2
# Створити клас Student, який матиме публічний атрибут name,
# захищений атрибут _marks і приватний атрибут __grade.
# Реалізувати метод для додавання оцінок з перевіркою допустимих значень.
# Додати гетери та сетери для доступу до оцінок і зміни їх.
# Реалізувати метод для визначення успішності студента на основі середньої оцінки.







# Використання гетерів та сетерів


# клас Employee, що матиме приватний атрибут __salary.
# Реалізувати гетер та сетер для зміни зарплати, де
# сетер перевірятиме, чи нове значення зарплати більше за 0.
# Створити метод для збільшення зарплати на певний відсоток із використанням сетера.
