[
  {
    "name": "Garfield: The Movie",
    "description": "Garfield: The Movie is a 2004 American comedy film based on Jim Davis' comic strip Garfield. Directed by Peter Hewitt and written by Joel Cohen and Alec Sokolow, it stars Breckin Meyer as Jon Arbuckle, Jennifer Love Hewitt as Dr. Liz Wilson and features Bill Murray as the voice of Garfield, who was created with computer-generated imagery.",
    "rating": 3.52,
    "genre": "Fantasy",
    "actors": [
      "Breckin Meyer",
      "Jennifer Love Hewitt",
      "Stephen Tobolowsky",
      "Bill Murray"
    ],
    "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/e/eb/Garfield_ver6.jpg/220px-Garfield_ver6.jpg"
  },
  {
    "name": "Повстання Штатів",
    "description": "«Повстання Штатів»[6] (англ. Civil War, дослівний переклад: Громадянська війна) — британсько-американський антиутопічний воєнний бойовик сценариста і режисера Алекса Ґарленда. У головних ролях Кірстен Данст, Вагнер Моура, Кейлі Спейні, Стівен Гендерсон і Нік Офферман.\n\nПісля політичної кризи частина штатів проголошують свою незалежність і ведуть війська на Вашингтон. Американський уряд вирішує придушити повстання. За подіями спостерігає команда журналістів, прямуючи до Вашингтона, щоб взяти в президента інтерв'ю.",
    "rating": 7.6,
    "genre": "бойовик",
    "actors": [
      "Кірстен Данст[2]",
      "Ваґнер Моура[2]",
      "Stephen McKinley Hendersond[2]",
      "Кейлі Спейні[2]",
      "Карл Ґлусман[2]",
      "Соноя Мідзуно[2]",
      "Джоніка Т. Гіббсd[2]",
      "Джессі Племенс[2]",
      "Нік Офферман[2]",
      "Jefferson Whited[2]",
      "Juani Felizd[2]",
      "Nelson Leed[2]",
      "Edmund Donovand[2]",
      "Jin Had[2]",
      "Evan Laid[2]",
      "Greg Hilld"
    ],
    "poster": "https://upload.wikimedia.org/wikipedia/uk/0/08/Civil_War_2024_film_poster.jpg"
  },
  {
    "name": "Думками навиворіт",
    "description": "Цей мультиплікаційний фільм є фантастичною комедією і зроблений в 3d форматі. Події цього оригінального і захоплюючого мультфільму відбуваються в мозку безтурботної 11-річної дівчини на ім'я Райлі. Вона повинна з батьком покинути рідний Середній Захід, а саме Міннесоту, і перебратися в місто Сан-Франциско, оскільки його тут чекає нова робота.",
    "rating": "10",
    "genre": "Мультфільми",
    "actors": [
      "Роналдо Дель Кармен",
      "Емі Полер",
      "Філліс Сміт",
      "Річард Кайнд",
      "Білл Гейдер",
      "Льюіс Блек"
    ],
    "poster": "https://www.lifecell.ua/uploads/cache/c6/ef/c6ef22753de94a54b20c8415f346131f.jpg"
  }
]