# Створіть програму, яка приймає список товарів та повертає список,
# в якому кожен елемент дорівнює кількості букв, з яких складається товар.














# Написати програму, що перевірить чи є щось в списку, і якщо є, то виведе кількість елементів у ньому.











# Написати програму, яка видалить зі списку 1-й, 3-й і 6-й елементи зі списку

















# Піднести кожен із елементів списку до четвертого степеня






# Видалити слово "Банани" зі списку.
# products = ["Хліб", "Банани", "Риба", "Банани", "Насіння", "Майонез", "Кетчуп", "Банани", "Соус"]







# Написати програму, яка порахує і виведе числа у квадраті від 1 до числа, яке задасть користувач







# Написати програму, що прибере дублікати зі списку.






# Дано дійсне число - ціна 3 кг сала. Вивести вартість 1.2, 1.4, ..., 2 кг сала.







# Написати програму, що порахує кількість додатніх елементів у списку та кількість від’ємних
# numbers = []






# Дано діапазон чисел від -100 до 0. Вивести на екран лише числа, які закінчуються на нуль





# Написати програму, що порахує кількість унікальних елементів у списку.