
# count = string.count(char, 5, 15)
# print(f"Буква '{char}' зустрічається {count} р.")

# string_2 = string.lower()
# print(string_2)


# # command = "Exit"
# if command.lower() == "EXIT":
# #     print("Exit")

# string_3 = string.upper()
# print(string_3)

# string = string.capitalize()
# string = string.title()
# string = string.swapcase()
# print(string)

# char = "о"
# index = string.rfind(char)
# print(index)

# my_list = string.split("о", 2)
# my_list = [string[:10], string[10:20], string[20:]]
# print(my_list)
# new_string = "Абабагаламага".join(my_list)
# print(new_string)

# string = "        Вивести таблицю проданих за день товарів в наступному форматі    aaa\n \t    і,   "
# print(string)
# print(len(string))
# clear_string = string.rstrip(" Ві,")
# print(clear_string)
# print(len(clear_string))


# map = {
#     ord("а"): "Q",
#     ord("ю"): "U"
# }

# new_string = string.translate(map)
# print(new_string)


# age = 45
# name = "Alex"
# print(f"Мене звати {name}, мені {age} років")
# print("Мене звати {}, мені {} років".format(name, age))
# print("Мене звати {name}, мені {age} років".format(age=age, name=name))
# print("Мене звати %s, мені %d років" % (name, age))

# Порахувати, яка літера найчастіше зустрічається у вашому прізвищі.

# string = "орахувати, яка літера найчастіше зустрічається у вашому прізвищі".lower()

# count = 0
# char = ""

# for c in string:
#     if count < string.count(c):
#         count = string.count(c)
#         char = c

# print(f"Символ '{char}' зустрічається в нашому речені '{count}' разів")


# Вивести таблицю проданих за день товарів в наступному форматі:
# номер, назва, кількість, ціна.
# --------------------------------------------------
# |  №  |Товар               | Кількість|  Вартість|
# --------------------------------------------------
# |  0  |Апельсин            |         6|        15|
# |  1  |Лимон               |         8|       367|
# |  2  |Картопля            |        10|        80|
# --------------------------------------------------

# head = ["№", "Товар", "Кількість", "Вартість"]
# products = [["Апельсин", 6, 15], ["Лимон", 8, 367], ["Картопля", 10, 80]]

# delimiter = "-" * 45
# template = "|{:^5}|{:*<15}|{:a>10}|{:`>10}|"

# print(delimiter)
# # print(template.format(head[0], head[1], head[2], head[3]))
# print(template.format(*head))
# print(delimiter)

# for i, product in enumerate(products):
#     # print(template.format(i, product[0], product[1], product[2]))
#     print(template.format(i, *product))

# print(delimiter)






# Порахувати, яка літера найчастіше зустрічається у вашому прізвищі.
# string = "Пороахувоати, яока лоіотероа"






# Порахувати, яка літера найменше зустрічається у вашому прізвищі.
# string = "Ппороаххуувоати, яока лоіотероа".lower()

# count = 9798765654
# most_char = ""

# for char in string:
#     if count > string.count(char):
#         count = string.count(char)
#         most_char = char

# print(f"Символ '{most_char}' зустрічається в нашому речені '{count}' разів")



# Ввести довільне повідомлення з клавіатури.
# Якщо в повідомленні трапляються слова «купити», «продати», «реклама»,
# то помітити це повідомлення як спам.

string = "кщо в повід  про дати мленні трапляються слова реклама  "

words_spam = ["купити", "продати", "реклама"]

for word_spam in words_spam:
    if word_spam in string:
        print(f"Вам надійшов спам зі словом '{word_spam}'")
        break
else:
    print("Вам не надходив спам")







# перевірити, чи всі елементи вказані в списку є однаковими
# first_list = [1, 1, 2, 1, 5]
# second_list = ["b", "b", "b", "b", "b"]
# third_list = [5, 5, "5", 5, "5"]


















# Створіть програму, яка приймає від користувача строку
# та знаходить кількість приголосних літер у цьому рядку.
# Виведіть цю кількість.







# Напишіть програму, яка приймає рядок, та перевертає його за допомогою слайсингу











# Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]











# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).















# Напишіть програму, яка приймає рядок, та перевертає його без використання слайсингу (1. Використання списків. 2. Використання циклу.)














# Даний список повинен бути "стиснутий" таким чином, щоб замість двох (або більше) однакових значень підряд було одне значення
# my_list = [5, 5, 5, 4, 5, 6, 6, 5, 5, 7, 8, 0, 0] # -> [5, 4, 5, 6, 5, 7, 8, 0]
# my_list = [1, 1, 1, 1, 2, 2, 2, 1, 1, 1] # -> [1, 2, 1]












# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).













# Створіть програму, яка перевіряє чи рядок включає в собі лише цифри.
















# Створіть програму, яка приймає рядок, та повертає рядок, з якого було видалено всі пробіли.






# Створіть програму, яка приймає рядок, та повертає рядок у якому кожне слово буде з великої букви.







# Створіть програму, яка приймає рядок від користувача, та повертає перший неповторюваний символ у рядку.








# Дано список із рядками. Відсортуйте його за спаданням довжини кожного елемента. Переверніть список, виведіть кожен елемент на екран.
# my_list = ["Дано", "список", "із", "рядками", "Відсортуйте", "його"]
# my_list.sort(key=len)
# print(my_list)








# Створіть програму, яка приймає рядок та повертає найдовший повторюваний підрядок у ньому.
# Створіть програму, яка приймає рядок, та повертає кількість паліндромних підрядків у рядку.
# Створіть програму, яка приймає на вхід рядок від користувача та повертає частоту кожного слова у рядку.