# Що виведе наступний код?
# numbers = [1, 2, 3, 4, 5]
# numbers.insert(2, 10)
# print(numbers)

# Як отримати останній елемент кортежу t = (10, 20, 30, 40, 50)?

# my_set = {1, 2, 3, 3, 4, 4, 5}
# print(len(my_set))

# Як додати [7, 8] як новий підсписок у вкладений список nested_list?
# nested_list = [[1, 2], [3, 4], [5, 6]]

# Завдання 1. Виправ помилку
# fruits = ["яблуко", "банан", "вишня"]
# fruits.remove("апельсин")
# print(fruits)


# Завдання 2. Список чи словник?
# Для кожної задачі визначте, яку структуру краще використати:
#     Зберігати імена учасників марафону в порядку фінішу - (Список (List))
#     Зберігати ціни товарів за їх назвами - (Словник (Dict))
#     Зберігати історію переглянутих відео - (Список (List))
#     Швидко перевіряти, чи є користувач у базі - (Множина (Set) або Словник (Dict))
#     Зберігати координати точок на карті - (Список (List) або Словник (Dict))


# Завдання 3.
# Маючи список продажів
# sales = [250, 300, 150, 400, 200]
# Зробіть операції додавання, видалення та сортування щоб у кінці отримати ось такий вивід

# Продажі після додавання: [250, 300, 150, 400, 200, 350]
# Продажі після видалення: [250, 300, 400, 200, 350]
# Відсортовані продажі: [200, 250, 300, 350, 400]
# Середній продаж: 300.0


# Завдання 4. Оптимізуй код
# Цей код працює, але повільно при великих даних. Оптимізуй його:
# # Перевірка, чи є дублікати в списку
# def has_duplicates_slow(arr):
#     for i in range(len(arr)):
#         for j in range(len(arr)):
#             if i != j and arr[i] == arr[j]:
#                 return True
#     return False

# Складність: O(n²) — дуже повільно!
# Завдання: Напиши функцію has_duplicates_fast() зі складністю O(n)
# # Оптимізований код -> O(n)
# def contains_duplicates_good(arr):
#     seen = set()
#     for x in arr:
#         if x in seen:
#             return True
#         seen.add(x)
#     return False


# Завдання 5.
# Об’єднайте два кортежі tuple1 = (1, 2, 3) та tuple2 = (4, 5, 6). Повторіть отриманий кортеж двічі.

# tuple1 = (1, 2, 3)
# tuple2 = (4, 5, 6)
# new_tuple = (tuple1 + tuple2) * 2
# print(new_tuple)


# Завдання 6.
# Створіть множину з усіма студентами класу та іншу
# множину з присутніми на занятті.
# Знайдіть студентів, які не прийшли на заняття.
# set_1 = {1, 2, 3, 4}
# set_2 = {1, 4}
# print(set_1 ^ set_2)


# Завдання 7.
# Створіть функцію find_user_by_email(email), яка повертає ID користувача або None, якщо такого email немає.
# users = {
#     101: {"name": "Alice", "email": "alice@example.com", "age": 25},
#     102: {"name": "Bob", "email": "bob@example.com", "age": 30},
#     103: {"name": "Charlie", "email": "charlie@example.com", "age": 22}
# }
# # Створіть функцію пошуку за email
# assert find_user_by_email("bob@example.com") == 102, "❌ Помилка у пошуку користувача!"
# assert find_user_by_email("notfound@example.com") is None, "❌ Неправильне значення для неіснуючого користувача!"