# all

# Перевірка, чи всі елементи списку позитивні
# numbers = [1, 2, 3, 4, 5]
# all_positive = all(number > 0 for number in numbers)
# print(all_positive)






# Перевірка, чи всі рядки у списку мають значення
# words = ["apple", "banana", "cherry", ""]
# all_non_empty = all(words)
# print(all_non_empty)






# Перевірка наявності виключно позитивних чисел у списку
# Це зручно використовувати для перевірки, чи всі числа в списку
# є позитивними, що може бути корисно у фінансових аналізах або при обробці даних.






# any

# Перевірка на наявність позитивних чисел у списку







# Перевірка на наявність слів, що починаються з великої літери








# sorted
# sorted(iterable, key=None, reverse=False)

# Відсортувати список чисел за зростанням








# Сортування списку кортежів другим елементом
# tuples = [(1, 'd'), (2, 'b'), (4, 'a'), (3, 'c')]








# сортування в порядку спадання
# words = ["banana", "apple", "cherry"]





# data = [("apple", 2), ("banana", 1), ("cherry", 3)]







# Створіть скрипт, який зчитує список цілих чисел
# (можна використовувати генератор випадкових чисел),
# використовує all() для перевірки, чи всі числа позитивні,
# а потім застосовує sorted() для сортування цих чисел за зростанням.







# Напишіть програму, яка дозволяє користувачеві
# ввести рядок символів та використати any() для
# перевірки, чи містить рядок будь-які голосні букви.
# Виведіть результат перевірки.