# my_string = "Hello world!\rN0000000"

# print(my_string)








# Створіть програму, яка приймає від користувача два рядки та виводить повідомлення, де більше символів.
# string_1 = input("Введіть перший рядок: ")
# string_2 = input("Введіть другий рядок: ")

# count_1 = 0
# count_2 = 0

# for _ in string_1:
#     count_1 += 1

# for _ in string_2:
#     count_2 += 1

# print("Перший рядок довший" if count_1 > count_2 else "Другий рядок довший")
# print("Перший рядок довший" if len(string_1) > len(string_2) else "Другий рядок довший")














# Написати програму, яка зчитає 3 числа (a, b, c) та порахує скільки чисел лежить між “a” i “b”, які діляться на “с”










# Створіть програму, яка приймає від користувача дві строки та порівнює їх лексикографічно (за алфавітом).
# Виведіть результат порівняння у вигляді логічного значення (True або False).










# Створіть програму, яка приймає від користувача строку та знаходить кількість слів у цьому рядку
# (слово — це послідовність символів, розділених пробілами). Виведіть цю кількість.













# Потрібно написати програму, що верифікує пароль
# Умовами верифікації є:
#  - довжина більше 6 символів;
#  - містить хоча б одну цифру, але не лише цифри;
#  - якщо пароль довший за 9 - попередня умова (про цифри) не вимагається;
#  - рядок не повинен містити слово "password" в жодному регістрі










# Створіть програму, яка приймає від користувача строку та знаходить кількість голосних літер у цьому рядку.
# Виведіть цю кількість.
# string = "Створіть програму, яка приймає від користувача строку та знаходить кількість голосних літер у цьому рядку"












# перевірити, чи всі елементи вказані в списку є однаковими
# first_list = [1, 1, 2, 1, 5]
# second_list = ["b", "b", "b", "b", "b"]
# third_list = [5, 5, "5", 5, "5"]


















# Створіть програму, яка приймає від користувача строку
# та знаходить кількість приголосних літер у цьому рядку.
# Виведіть цю кількість.








# Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]








# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).












# Даний список повинен бути "стиснутий" таким чином, щоб замість двох (або більше) однакових значень підряд було одне значення
# my_list = [5, 5, 5, 4, 5, 6, 6, 5, 5, 7, 8, 0, 0] # -> [5, 4, 5, 6, 5, 7, 8, 0]
# my_list = [1, 1, 1, 1, 2, 2, 2, 1, 1, 1] # -> [1, 2, 1]












# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).












# Тобі дано список з цілими числами. Твоя задача в цій місії - продублювати нулі
# my_list =  [100, 10, 0, 101, 1000] # -> [100, 10, 0, 0, 101, 1000]













# Створіть програму, яка приймає від користувача строку та перетворює її у список,
# де кожен елемент — це слово зі строки. Виведіть цей список.












# Створіть програму, яка приймає від користувача дві строки та перетворює їх у список,
# де перший елемент — це перша літера першої строки, другий елемент — перша літера другої строки, і т.д.
# Виведіть цей список.











# Створіть програму, яка приймає від користувача строку та знаходить кількість цифр у цій строці. Виведіть цю кількість.
