import numpy as np


# array = np.arange(1000000)

# print(array.sum())

# array = [[j for j in range(i, i+3)] for i in range(1, 10, 3)]
# print(array)

# matrix = np.array(array)
# print(matrix.T)

# from sklearn.linear_model import LinearRegression


# X = np.array([[1], [2], [3], [4], [5]])
# y = np.array([2, 4, 6, 8, 10])

# model = LinearRegression()
# model.fit(X, y)

# prediction = model.predict(np.array([[7]]))
# print("Прогноз для 6:", prediction)


# from PIL import Image

# image = Image.open('image.jpg')
# image_array = np.array(image)

# brightened = image_array + 50
# brightened = np.clip(brightened, 0, 255)

# brightened_image = Image.fromarray(brightened.astype('uint8'))
# brightened_image.save('brightened_image.png')


# zeros_array = np.zeros(5)
# ones_tensor = np.ones((2, 3, 4), dtype=float)
# range_step_array = np.arange(0, 20, 2)
# linspace_array = np.linspace(0, 1, 5)

# Використовуючи функцію array(), створіть масив з наступного списку: [10, 20, 30, 40, 50].
# За допомогою функції zeros() створіть двовимірний масив розміру 2x3, заповнений нулями.
# Використовуючи функцію ones(), створіть тривимірний масив розміру 2x2x2, заповнений одиницями.
# Створіть масив з чисел від 5 до 15 з кроком 1 за допомогою функції arange().
# За допомогою функції linspace() створіть масив з 8 чисел, рівномірно розподілених між 0 та 2π (приблизно 6.283).

# flat_array = np.arange(12)
# reshaped_array = flat_array.reshape((3, 2, 2))
# print(reshaped_array)

# np.mean - Середнє значення
# np.median - Медіана
# np.std - Стандартне відхилення
# np.prod - добуток


# matrix = [
#     [2, 4, 6],
#     [8, 10, 12],
#     [14, 16, 18]
# ]
# Перетворіть цей список у масив NumPy та обчисліть суму всіх елементів матриці. Виведіть результат.


# two_d_data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
# two_d_array = np.array(two_d_data)
# array = two_d_array.reshape((1, 3, 3))
# ones = np.ones((1, 1, 3), dtype=float)
# print(np.concatenate((array, ones), axis=1))


# Створіть масив NumPy з числами [1, 2, 3, 4, 5] типу int64. Потім перетворіть цей масив у тип float32 та обчисліть суму елементів нового масиву.
# array_int64 = np.array([1, 2, 3, 4, 5], dtype=np.int64)
# array_float32 = array_int64.astype(np.float32)


# Створіть масив NumPy з булевими значеннями [True, False, True, False, True] типу bool. Виведіть масив та його тип даних.
# bool_array = np.array([....], dtype=...)
# print(bool_array)
# print(bool_array.dtype)


# Створіть масив NumPy з числами [2, 4, 6, 8, 10] типу int32. Перетворіть цей масив у тип complex64 та виведіть новий масив та його тип даних

# Створіть два масиви NumPy з числами від 0 до 9999. Перший масив має тип int64, а другий — int16. Порівняйте обсяг пам'яті, який займає кожен масив.
# large_int64 = np....(...)
# print(large_int64.nbytes)


# Створіть два масиви NumPy з 1,000,000 випадкових чисел типу float64 та float32. Обчисліть суму елементів кожного масиву та порівняйте час виконання.


# Створіть масив NumPy з числами від 1 до 1000 типу int32.
# Перетворіть цей масив у тип float32, а потім створіть новий масив,
# де кожен елемент дорівнює квадрату відповідного елемента перетвореного масиву. Обчисліть суму всіх елементів нового масиву.


# Створіть масив NumPy з числами [5, 10, 15, 20, 25] типу int16. Перевірте його тип даних та розмір масиву.
# array_int16 = ....
# print(array_int16)
# print(array_int16.dtype)
# print(array_int16.shape)


# Створіть масив NumPy з числами [2.2, 4.4, 6.6, 8.8] типу float64. Перетворіть його у тип int32 та обчисліть середнє значення нового масиву.


# Основні операції з масивами
# 1. Елементне додавання масивів
# 2. Елементне множення масивів

# Індексація окремого елемента
# matrix = np.array([[1, 2, 3],
#                    [4, 5, 6],
#                    [7, 8, 9]])
# element = matrix[1, 2]

# Зріз рядка
# row = matrix[0, :]
# Зріз стовпця
# column = matrix[:, 1]
# Зріз підмасиву
# sub_matrix = matrix[0:2, 1:3]

# Зміна форми масиву за допомогою reshape(): [[ 1 2 3 4 5 6 7 8 9 ]] (1, 9)
# Перетворення масиву у одновимірний за допомогою flatten(): [ 1 2 3 4 5 6 7 8 9 ] (9,)

# matrix = np.array([[1, 2], [3, 4]])
# reshaped = matrix.reshape(4)
# print(reshaped)

# Створіть двовимірний масив NumPy з числами від 1 до 9 розміром 3x3. Отримайте елемент на позиції рядка 2 та стовпця 3.

# Використовуючи створений масив matrix, отримайте перший рядок та другий стовпець.
# matrix = np.array([[4, 2, 4],
#                    [4, 2, 6],
#                    [3, 8, 1]])

# Створимо одновимірний масив з числами. Змінимо його форму на 2x3.
# array = np.array([1, 2, 3, 4, 5, 6])

# Використовуючи масив reshaped_array з попереднього завдання, перетворіть його у одновимірний масив.
# reshaped_array = np.array([[4, 3, 3], [4, 1, 615]])
# flattened_array = reshaped_array.flatten()
# print(flattened_array)


# Створіть масив NumPy з числами [2.2, 4.4, 6.6, 8.8] типу float64.
# Перетворіть його у тип int32 та обчисліть середнє значення нового масиву.


# Створіть масив NumPy з числами від 1 до 1000 типу int32.
# Перетворіть цей масив у тип float32, а потім створіть новий масив, де кожен елемент
# дорівнює квадрату відповідного елемента перетвореного масиву. Обчисліть суму всіх елементів нового масиву.


# Урок 5. Операції з масивами

# 1.Створіть двовимірний масив розміром 3x3 з наступних чисел:

# [[2, 5, 8],
#  [3, 6, 9],
#  [4, 7, 10]]
# Знайдіть суму всіх елементів масиву.
# Обчисліть середнє значення елементів масиву.
# Змініть форму масиву на одновимірний.


# 2.Виконайте наступні операції з масивами:

# Створіть масив a = np.array([1, 2, 3]) та масив b = np.array([4, 5, 6]).
# Обчисліть їхній добуток.
# Знайдіть різницю між масивами a та b.
# Виконайте елементний поділ масиву b на масив a.


# Очікувані результати:

# Сума елементів першого масиву: 54
# Середнє значення: 6.0
# Одновимірний масив: [2, 5, 8, 3, 6, 9, 4, 7, 10]
# Добуток масивів: [4, 10, 18]
# Різниця між масивами: [-3, -3, -3]
# Поділ масивів: [4.0, 2.5, 2.0]


# array = np.arange(10)
# indices = np.where(array > 5)
# print(indices)


# array = np.random.randint(0, 21, size=10)
# filtered_array = array[np.where(array % 2 == 0)]
# print(filtered_array)


# array = np.random.randint(10, 50, size=12)
# filtered_array = array[np.where((array > 20) & (array < 40))]
# print(filtered_array)


# array = np.random.randint(0, 100, size=(5, 5))
# indices = np.where(array > 75)
# print(indices)


# array = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
# Після цього порахуємо середнє. Обчислюємо середнє значення масиву за допомогою array.mean(), яке дорівнює 55.
# average = array.mean()
# Знайдемо усі елементи, які більші за середнє. Використовуючи np.where(array > average), ми знаходимо індекси всіх елементів, що перевищують середнє значення. Ц
# high_values = array[indices]
# print(high_values)


# Також можемо зробити інший масив.
# Зараз наше завдання зробити заміну негативних чисел на нулі.
# array = np.array([-5, 3, -1, 7, -9, 2, -6, 8, -4, 10])
# У цьому прикладі створюється масив array, що містить як негативні, так і позитивні числа.
# Використовуючи np.where(array < 0), ми знаходимо індекси всіх негативних елементів.
# indices = np.where(array < 0)
# array[indices] = 0
# print(array)
# Потім ці елементи замінюються на 0 за допомогою array[indices] = 0.
# array[indices] = 0
# Результатом є масив, де всі негативні числа замінені на нулі, а позитивні залишилися без змін.


# Зробимо більш складну вимогу.
# Нам дан масив
# array = np.array([12, 7, 22, 5, 18, 30, 9, 16, 25, 40])
# Нам необхідно знайти усі елементи більше за 10 та менше за 30.
# Обʼєднаємо умови за допомогою оператора & .
# Використовуючи np.where((array > 10) & (array < 30))
# , ми знаходимо індекси всіх елементів, які більші за 10 і менші за 30
# indices = np.where((array > 10) & (array < 30))
# Та для вибору індексів. Ці індекси використовуються для вибору відповідних елементів з масиву array, які зберігаються в новому масиві selected_elements. Таким чином, selected_elements містить лише ті числа, що відповідають обом умовам.
# selected_elements = array[indices]
# print(selected_elements)


# Оберемо з списку числа які дорівнюють 4.
# array = np.array([4, 7, 4, 9, 4, 12, 4, 15])
# У цьому прикладі створюється масив array, який містить кілька повторюваних значень 4.
# Використовуючи np.where(array == 4), ми знаходимо індекси всіх елементів, що дорівнюють 4.
# indices = np.where(array == 4)


# Створимо інший масив array з чисел від 1 до 10.
# Завданням є знайти індекси всіх парних елементів більших за 5 за замінити їх на негативні числа, інші числа залишити без змін.
# Використовуючи np.where((array % 2 == 0) & (array > 5)), ми знаходимо індекси всіх парних елементів, більших за 5.
# indices = np.where((array % 2 == 0) & (array > 5))
# Потім ці елементи замінюються на їхні негативні значення за допомогою 
# array[indices] = -array[indices]
# print(array)


# Візьмемо випадковий масив
# array = np.array([15, 22, 8, 19, 31, 14, 27, 33, 9, 21])
# Потрібно знайти індекси усіх елементів, які кратні 3 чи 5.
# Для цього використовуємо
# array % 3 == 0
# та
# array % 5 == 0
# Поєдуємо умови та використовуючи np.where((array % 3 == 0) | (array % 5 == 0)), ми знаходимо індекси всіх елементів, які кратні 3 або 5.
# indices = np.where((array % 3 == 0) | (array % 5 == 0))
# Та зберігаємо індекси.
# Ці індекси використовуються для вибору відповідних елементів з масиву array, які зберігаються в новому масиві selected_elements.
# selected_elements = array[indices]
# print(selected_elements)