# Trailing Spaces
# Rainbow Brackets
# Live Share

# Print

# print("Hello' world", 5, 7.4)

# print(((((('Hello')))))) # Даний текст для тестування

# print("Hello")
# print("Ім'я")
# print('Ім\'я')

# print('''Hello''')
# print("Моє ім'я \"підставити своє ім'я\" ")

#  __      ______  _________   ___ __ __  ______        ________  _________
# /_/\    /_____/\/________/\ /__//_//_/\/_____/\      /_______/\/________/\
# \:\ \   \::::_\/\__.::.__\/ \::\| \| \ \::::_\/_     \__.::._\/\__.::.__\/
#  \:\ \   \:\/___/\ \::\ \    \:.      \ \:\/___/\       \::\ \    \::\ \
#   \:\ \___\::___\/_ \::\ \    \:.\-/\  \ \::___\/_      _\::\ \__  \::\ \
#    \:\/___/\:\____/\ \::\ \    \. \  \  \ \:\____/\    /__\::\__/\  \::\ \
#     \_____\/\_____\/  \__\/     \__\/ \__\/\_____\/    \________\/   \__\/


# print("""
#  __      ______  _________   ___ __ __  ______        ________  _________
# /_/\\    /_____/\\/________/\\ /__//_//_/\\/_____/\\      /_______/\\/________/\\
# \\:\\ \\   \\::::_\\/\\__.::.__\\/ \\::\\| \\| \\ \\::::_\\/_     \\__.::._\\/\\__.::.__\\/
#  \\:\\ \\   \\:\\/___/\\ \\::\\ \\    \\:.      \\ \\:\\/___/\\       \\::\\ \\    \\::\\ \\
#   \\:\\ \\___\\::___\\/_ \\::\\ \\    \\:.\\-/\\  \\ \\::___\\/_      _\\::\\ \\__  \\::\\ \\
#    \\:\\/___/\\:\\____/\\ \\::\\ \\    \\. \\  \\  \\ \\:\\____/\\    /__\\::\\__/\\  \\::\\ \\
#     \\_____\\/\\_____\\/  \\__\\/     \\__\\/ \\__\\/\\_____\\/    \\________\\/   \\__\\/
# """)

# Типи змінних
# str
# int
# float
# print(type(7.8))

# number = input("Введи число: ")
# number = float(number)
# print(number)
# print(type(number))

# a = "7"
# None
# wether = request.get("url-city=Ababagalanmaga")
# print(10 ** 4200)


# a = 9 # int - integer - int()
# b = 4.6 # float - float()
# c = "Hi" # str - string - str()

# print("12- !" * 25)
# print(type(c))


# hoby = "програмування"
# city = "Одеса"
# lang = "Python"

# message_1 = "Моє хобі {hoby}. Мова програмування яку я вивчаю {lang}. Проживаю у місті {city}".format(hoby=hoby, city=city, lang=lang)
# message_2 = "Моє хобі {0}. Мова програмування яку я вивчаю {2}. Проживаю у місті {1}".format(hoby, city, lang)
# message_3 = "Моє хобі {}. Мова програмування яку я вивчаю {}. Проживаю у місті {}".format(hoby, lang, city)
# print(f"{message_1 = }")
# print(f"{message_2 = }")
# print(f"{message_3 = }")

# Input
# print("Hello!")
# number = input("Введи кількість років: ")
# print("Варіант 1:", "Мені", number, "років")
# # print("Робота завершена")

# print(f"Варіант 2: Мені {number} років")
# print("Варіант 3: Мені {number_1} років".format(number_1=number))
# print("Варіант 4: Мені {} років".format(89))


# input(f"What is your name?{a} My name is ")

# name = input("Введіть своє ім'я: ")
# print(f"Мене звати {name}")

# age = input("Скільки тобі років ")
# print(type(age))
# print("Мені {}".format(age))

# city = input("Де ти проживаєш? ")
# print(f"Я живу у місті {city}")

# print(f"Мене звати {name}. Мені {age} років. На даний час я проживаю в місті {city}")
# input("Натисніть 'enter' щоб закрити програму")
# a = input("Введіть ціле число 1: ")
# print(type(a))
# a = int(a)
# print(type(a))

# b = input("Введіть ціле число 2: ")
# print(type(b))
# b = float(b)
# print(type(b))
# print(a + b)

# b: int = 5
# b = 6.5
# b = "Hello"
# b = None
# print(str(b))

# Передати програмі кількість своїх домашніх тварин.
# Порахувати скільки всього тварин є в домогосподарстві,
# та вивести повідомлення у форматі "Котів: 5, собак: 1, корів: 9. Всього тварин 15"
# cats = input("Введи кількість котів: ")
# print(f"{ cats = }")
# cats = int(cats.split()[0])
# print(f"{ cats = }")

# dogs = input("Введи кількість собак: ")
# dogs = int(dogs)
# cows = input("Введи кількість корів: ")
# cows = int(cows)
# sum = cats + dogs + cows
# print(f"Котів: {cats}, собак: {dogs}, корів: {cows}. Всього тварин {sum}")





# float

# a = int(float(input("Введіть перше ціле число:\n")))
# b = int(float(input("Введіть друге ціле число:\n")))
# +, -, *, /, **, //, %

# print(25 ** .5)





# Написати програму, яка буде рахувати площу поля за довжиною та шириною

# length = input("Введіть довжину поля: ")
# length = int(length)
# width = input("Введіть ширину поля: ")
# width = int(width)
# area = length * width
# message = f"Довжина поля: {length}, а ширина: {width}. Тоді площа даного поля дорівнює '{area}' кв.м"
# print(message)







# Напишіть програму для підрахунку дрібних грошей. Вона повинна питати:

# «Скільки у вас монет по 50 копійок?»;
# «Скільки у вас монет по 25 копійок?»;
# «Скільки у вас монет по 10 копійок?»;
# «Скільки у вас монет по 5 копійок?».
# Після цього на екрані повинна з'явитися загальна сума.

# count_50 = int(input("Скільки у вас монет по 50 копійок? "))
# count_25 = int(input("Скільки у вас монет по 25 копійок? "))
# count_10 = int(input("Скільки у вас монет по 10 копійок? "))
# count_5 = int(input("Скільки у вас монет по 5 копійок? "))
# sum_coin = count_50 * 50 + count_25 * 25 + count_10 * 10 + count_5 * 5
# grn_coin = sum_coin // 100
# other_coin = sum_coin % 100
# print(f"Загальна сума монет {sum_coin} коп.\n{grn_coin} грн. та {other_coin} коп.")


# Обчисліть добуток перших 20 натуральних чисел. Виведіть на екран обчислене значення.




# Запишіть букву 'A' (латинську, велику) 87 разів поспіль.
# print("Animal " * 87)
# print("*\n" + "*" * 2 + "\n" + "*" * 3)




# Запишіть слово 'Python' 53 раз поспіль.
