# 1. Вивести на екран фразу: "Я обожнюю GoITeens"

# 2. Вивести на екран 5 довільних чисел використовуючи лише одну команду.

# 3. Вивести на екран своє ім’я та прізвище у форматі “My name is … . My surname is … . “ (Вписати свої ім’я та прізвище)

# 4. Вивести на екран своє хобі.

# 5. Вивести на екран свій настрій.

# 6. Вивести на екран 7 своїх позитивних рис характеру.

# 7. Вивести на екран повідомлення:"I decided to learn Python because..." (вписуємо чому ти вирішив вивчати Python)

# 8. За допомогою команди print(), створи зоряний трикутник.

# 9. За допомогою команди print(), створи перевернутий зоряний трикутник.

# 10. Напишіть програму, яка просить користувача ввести його прізвище.
# Та виводить його на екран у парі з іменем (без використання input(). note:
# передати як аргумент в команді print() )
sur_name = input("Введіть своє прізвище: ")
message_1 = f"Олег {sur_name}"
message_2 = "Олег", {sur_name}
print(message_1)
print(type(message_1))
print(message_2)
print(type(message_2))

# 11. Напишіть програму, яка просить користувача ввести його вік. Та виводить це число на екран.

# 12. Напишіть програму, яка просить користувача ввести спочатку улюбленого актора. Наступний запит - улюблений фільм, в якому знімався даний актор. Потім вивести на екран повідомлення у форматі: “This beautiful actor - … was filmed in this film … .” (Вписати актора та фільм)

# 13. Напишіть програму, яка просить користувача ввести місто, у якому він живе. Виведіть назву міста разом із фразою «is a wonderful place!». Наприклад: Kyiv is a wonderful place!

# 14. Напишіть програму, яка запитує у користувача ( якщо має домашню тварину ) — спочатку назву тварини, а потім її ім’я. Вивести повідомлення у форматі: “My … is a beautiful animal. Its name is … .” (Вписати назву тварини та ім’я). Наприклад: My cat is a beautiful animal. Its name is Barsik.