# Зробити перевірку того, чи є число 3 в множині перших дев'яти простих чисел prime_numbers:
# prime_numbers = {2, 3, 5, 7, 11, 13, 17, 19, 23}

# # if 3 in prime_numbers:
# #     print("3 міститься у множині")
# # else:
# #     print("Немає")


# print("3 міститься у множині" if 3 in prime_numbers else "Немає")



cities = {
    'Київ'    : 0,
    'Вінниця' : 240,
    'Харків'  : 470,
    'Ужгород' : 808,
    'Львів'   : 540,
    'Житомир' : 120,
    'Одеса'   : 430
}

# if cities in values()

# print(max(cities, key=cities.get))

print(min(cities, key=cities.get))

# Дано список міст, в яких працює Укрпошта та Нова Пошта.
# Користувач вводить місто з клавіатури.
# Запропонувати користувачеві доставку поштовим
# оператором або вивести повідомлення про неможливість доставки.
# post_ukr = {'Київ', 'Фастів', 'Ірпінь', 'Боярка'}
# post_new = {'Київ', 'Фастів', 'Кагарлик', 'Узин', 'Ірпінь', 'Гатне', 'Боярка', 'Гостомель'}
# user_city_min_lenth = 3


# input('Введіть місто в якому хочете отримати посилку')
# if ('Київ', 'Фастів'):
#     print('post_ukr', 'post_new')
# elif ('Ірпінь', 'Боярка'):
#     print('post_ukr ')
# else:
#     print('post_new')





# if len(user_city) < user_city_min_lenth:
#     print("Введене місто надто коротке. Спробуйте ще раз.")


# if 



# city_input = input("Введіть місто > ")
# if city_input in post_ukr:
#     print("Укр-пошта може доставити посилку у ваше місто")
# else:
#     print("Укр-пошта не може доставити посилку у ваше місто")

# if city_input in post_new:
#         print("Нова-пошта може доставити посилку у ваше місто")
# else:
#     print("Нова-пошта не може доставити посилку у ваше місто")
