# Створіть лямбда-функцію для обчислення куба числа.
# func = lambda x: x ** 3
# print(func(5))






# Напишіть лямбда-функцію, яка перевіряє,
# чи є одне число кратним іншому, і перевірте її для різних пар чисел.
# func = lambda x, y: x % y == 0
# print(func(50, 3))






# Створіть лямбда-функцію для обчислення середнього арифметичного двох чисел.






# Напишіть лямбда-функцію для конвертації температури з Цельсія в Фаренгейт і навпаки.
# C = (F - 32) / 1.8
# F = 1.8 * C + 32




# Використовуючи теорему Піфагора,
# створіть лямбда-функцію для обчислення довжини гіпотенузи прямокутного трикутника за даними катетами.






# Створіть лямбда-функцію для перевірки, чи є заданий рік високосним.
# Високосний рік ділиться на 4, але якщо він ділиться на 100, то має ділитися і на 400.






# Напишіть лямбда-функцію для визначення максимального з трьох чисел.







# Створіть декілька лямбда-функцій для виконання основних математичних операцій:
# додавання, віднімання, множення, ділення.
# Потім створіть просту програму-калькулятор,
# яка використовує ці функції для обчислення результату введеного користувачем виразу.