#  len()




# max(), min()





# abs()




# sum()



# datetime, strftime, fromtimestamp, locale
# https://acode.com.ua/method-strftime-python/
# from datetime import date, time, datetime, timedelta
# import locale




# time
# import time

# print(time.gmtime())
# print(time.localtime())


# Розробіть скрипт, який запитує у користувача
# дві дати (у форматі рррр-мм-дд) і
# обчислює різницю між ними в днях.







# math, sqrt, log, ceil, floor, sin, asin, degrees






# os, sys, random
# import os
# os.chdir("C:\\Users\\user\\Documents")
# print(os.getcwd())
# print(os.listdir())









# Створіть програму, яка використовує функції len(), max(), min(), і abs()
# для обчислення різних статистичних характеристик списку чисел, введених
# користувачем. Наприклад, програма має знаходити максимальне,
# мінімальне значення, довжину списку та обчислювати модуль різниці
# між максимальним і мінімальним значеннями.






# Використовуючи модуль datetime, розробіть скрипт,
# який дозволяє користувачу вводити важливі дати (наприклад, дні народження)
# та зберігає їх у форматі datetime. Програма повинна вміти показувати скільки
# днів залишилось до кожної з дат.





# Використовуючи модуль time, створіть скрипт, що перетворює
# час з однієї часової зони в іншу, користувач вводить час та вказує
# з якої та в яку часову зону потрібно перевести час.






# Розробіть програму, що використовує функції модуля math,
# такі як sqrt(), log(), ceil(), floor(), а також тригонометричні
# функції для вирішення складних математичних завдань,
# які користувач може задавати у формі рівнянь.


