# Реалізуйте програму, яка зчитує вміст файла "data.txt" і виводить кількість слів у цьому файлі.








# Напишіть функцію, яка отримує шлях до файла і слово як аргументи.
# Функція повинна перевіряти, скільки разів слово зустрічається у файлі.








# Реалізуйте програму, яка зчитує вміст кількох файлів і об'єднує їх у новий файл "combined.txt".







# Напишіть функцію, яка перевіряє, чи є файл "data.txt" порожнім.







# Напишіть функцію, яка отримує шлях до файла і перевіряє, чи містить файл лише числа.
# Поверніть True, якщо так, і False — у протилежному випадку.







# Реалізуйте програму, яка знаходить найдовший рядок у файлі "data.txt" і виводить його разом із його довжиною.









# Реалізуйте програму, яка видаляє всі порожні рядки з файла "data.txt".