# Вивести таблицю проданих за день товарів в наступному форматі:
# номер, назва, кількість, ціна.
# --------------------------------------------------
# |  №  |Товар               | Кількість|  Вартість|
# --------------------------------------------------
# |  0  |Апельсин            |         6|        15|
# |  1  |Лимон               |         8|       367|
# |  2  |Картопля            |        10|        80|
# --------------------------------------------------













# Порахувати, яка літера найрідше зустрічається у речені.















# Ввести довільне повідомлення з клавіатури.
# Якщо в повідомленні трапляються слова «купити», «продати», «реклама»,
# то помітити це повідомлення як спам.






# перевірити, чи всі елементи вказані в списку є однаковими
# first_list = [1, 1, 2, 1, 5]
# second_list = ["b", "b", "b", "b", "b"]
# third_list = [5, 5, "5", 5, "5"]


















# Створіть програму, яка приймає від користувача строку
# та знаходить кількість приголосних літер у цьому рядку.
# Виведіть цю кількість.










# Напишіть програму, яка приймає рядок, та перевертає його за допомогою слайсингу











# Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]











# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).















# Напишіть програму, яка приймає рядок, та перевертає його без використання слайсингу (1. Використання списків. 2. Використання циклу.)














# Даний список повинен бути "стиснутий" таким чином, щоб замість двох (або більше) однакових значень підряд було одне значення
# my_list = [5, 5, 5, 4, 5, 6, 6, 5, 5, 7, 8, 0, 0] # -> [5, 4, 5, 6, 5, 7, 8, 0]
# my_list = [1, 1, 1, 1, 2, 2, 2, 1, 1, 1] # -> [1, 2, 1]












# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).













# Створіть програму, яка перевіряє чи рядок включає в собі лише цифри.

