# Вивести таблицю проданих за день товарів в наступному форматі:
# номер, назва, кількість, ціна.
# --------------------------------------------------
# |  №  |Товар               | Кількість|  Вартість|
# --------------------------------------------------
# |  0  |Апельсин            |         6|        15|
# |  1  |Лимон               |         8|       367|
# |  2  |Картопля            |        10|        80|
# --------------------------------------------------

# head = ["№", "Товар", "Кількість", "Вартість"]
# products = [["Апельсин", 6, 15], ["Лимон", 8, 367], ["Картопля", 10, 80]]

# delimeter = "-" * 50
# template = "|{:^5}|{:<20}|{:>10}|{:>10}|"

# print(delimeter)
# # print("|{:^5}|{:<20}|{:>10}|{:>10}|".format(head[0], head[1], head[2], head[3]))
# print(template.format(*head))
# print(delimeter)

# for i, product in enumerate(products):
#     # print("|{:^5}|{:<20}|{:>10}|{:>10}|".format(i, product[0], product[1], product[2]))
#     print(template.format(i, *product))

#     print(delimeter)





# Порахувати, яка літера найрідше зустрічається у речені.
# string = "Вивести таблицю проданих за день товарів в наступному форматі"

# letter = ""
# count_letter = 50000000000

# for char in string:
#     count = string.count(char)
#     if count < count_letter:
#         letter = char
#         count_letter = count

# print(f"Символ '{letter}' зустрічається найрідще, а саме {count_letter} р.")












# Ввести довільне повідомлення з клавіатури.
# Якщо в повідомленні трапляються слова «купити», «продати», «реклама»,
# то помітити це повідомлення як спам.
# string = "Якщо в повідомленні трапляються слова «купити»"

# words = ["купити", "продати", "реклама"]
# for word in words:
#     if word in string:
#         print("Spaaaaaaaaaaaaaaaaammmmmmmmmmm!!!!!!!!!!!!!")
#         break
# else:
#     print("Повідомлення безпечне")















# перевірити, чи всі елементи вказані в списку є однаковими
# first_list = [1, 1, 2, 1, 5]
# first_list = ["b", "b", "b", "b", "b"]
# first_list = [5, 5, "5", 5, "5"]

# for i in range(len(first_list)):
#     if first_list[i] != first_list[i-1]:
#         print(False)
#         break
# else:
#     print(True)














# Створіть програму, яка приймає від користувача строку
# та знаходить кількість приголосних літер у цьому рядку.
# Виведіть цю кількість.
# string = "Створіть програму, яка приймає від користувача строку"
# letters = ["а", "о", "и", "і", "е", "у", " ", ","]

# count = 0
# for char in string:
#     if char.lower() not in letters:
#         count += 1

# print(f"Кількість приголосних в рядку дорівнює {count}. Загальна кількість літер {len(string)}")








# Створіть програму, яка приймає рядок, та повертає рядок у якому кожне слово буде з великої букви.
# string = "Створіть програму, яка приймає рядок, та повертає рядок у якому кожне слово"
# string_1 = string.title()

# print(string)
# print(string_1)









# Дано список із рядками. Відсортуйте його за спаданням довжини кожного елемента. Переверніть список, виведіть кожен елемент на екран.
# my_list = ["Дано", "із", "список", "Відсортуйте", "за", "спаданням"]
# my_list.sort(key=len)
# my_list_reversed = my_list[::-1]
# my_list.reverse()
# print(my_list)
# print(my_list_reversed)






#### Напишіть програму, яка приймає рядок, та перевертає його за допомогою слайсингу

# string = "Напишіть програму, яка приймає рядок"
# string_reverse = string[::-1]
# print(string_reverse)








#### Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]











# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).















# Напишіть програму, яка приймає рядок, та перевертає його без використання слайсингу (1. Використання списків. 2. Використання циклу.)














# Даний список повинен бути "стиснутий" таким чином, щоб замість двох (або більше) однакових значень підряд було одне значення
# my_list = [5, 5, 5, 4, 5, 6, 6, 5, 5, 7, 8, 0, 0] # -> [5, 4, 5, 6, 5, 7, 8, 0]
# my_list = [1, 1, 1, 1, 2, 2, 2, 1, 1, 1] # -> [1, 2, 1]












# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).













# Створіть програму, яка перевіряє чи рядок включає в собі лише цифри.












# Створіть програму, яка приймає рядок, та повертає рядок, з якого було видалено всі пробіли.







# Створіть програму, яка приймає рядок від користувача, та повертає перший неповторюваний символ у рядку.