# Записати сторони трикутника, та знайти його площу
# S = sqrt(p(p-a)(p-b)(p-c))
# p = (a + b + c) / 2
# a = 5
# b = 6
# c = 7
# p = (a + b + c) / 2
# print(type(p))
# S = (p * (p - a) * (p - b) * (p - c)) ** 0.5
# print(f"Площа трикутника = {S}")





# М'яч падає з висоти h. Знайти максимальну швидкість м'яча та за який час він упаде на землю.
# v = sqrt(2 * g * h)
# t = sqrt((2 * h) / g)
# g = 9.8
# h = 20
# v = (2 * g * h) ** 0.5
# t = ((2 + h) / g) ** 0.5
# print(f"Максимальна швидкість м'яча {v} м/с\nчас падіння: {t} с")






first_number = 45.3
second_number = -96.1
# bool_type = (first_number < second_number) or (first_number < 0) or (second_number < 0)
# print(bool_type)
# print(type(bool_type))
# name = "Олександр" if first_number < 0 else "Максим"
# print(name)



# Оголосити змінну “city”, в яку присвоїти назву міста.
city = "Odesa"






# Оголосити три змінні, одна з яких дорівнюватиме довільному числу. Друга - в двічі більше число, третя - з протилежним знаком до другої змінної.
a = 5
b = a * 2
# c = -b
с = 5
# print(f"Перше число: {a}\nДруге число: {b}\nТретє число: {c}")







# Оголосити змінну - довжина ребра куба. Обчислити його об'єм і вивести на екран.
# a = 78
# V = a ** 3
# print(f"Об'єм куба {V} кв.см.")







# Оголосити змінні — сторони довільного шестикутника. Обчислити периметр шестикутника та вивести його на екран.
a = 5
b = 8
c = 12
d = 79
e = 41
f = 123
# print(f"Периментр шестикутника дорвінює {a + b + c + d + e + f}")







# Оголосити змінні — площа круга. Визначити довжину кола та сторону вписаного правильного трикутника.
# Вивести на екран довжину кола та довжину сторони трикутника.
# R = sqrt(S / Pi)
# l = 2 * Pi * R
# a = R * sqrt(3)
S = 45
Pi = 3.14
R = (S / Pi) ** 0.5
l = 2 * Pi * R
l = int(l)
a = int(R * 3 ** 0.5)
# print(f"Довжина кола: {l}\nСторона трикутника: {a}")





# Оголосити змінні — 4 кути (їхня градусна міра).
# Оголосити наступну змінну is_quad, аби отримати булеве значення чи являється дана фігура чотирикутником
a1 = 45
a2 = 13
a3 = 79
a4 = 123
is_quad = a1 + a2 + a3 + a4 == 360
# print(is_quad)





# Автомобіль на першій половині часу їхав зі швидкістю 36 км/год, а на другій — зі швидкістю 88.8 км/год.
# Знайти середню швидкість на всьому шляху.
# Vc = (V1 + V2) / 2
V1 = 36
V2 = 88.8
Vc = (V1 + V2) / 2
# print(f"Середня швидкість автомобіля {Vc} км/год")










# Автомобіль на першій половині шляху їхав зі швидкістю 25.5 км/год, а на другій — зі швидкістю 101.3 км/год.
# Знайти середню швидкість на всьому шляху.
# Vc = (2 * V1 * V2) / (V1 + V2)
V1 = 25.5
V2 = 101.3
Vc = (2 * V1 * V2) / (V1 + V2)
Vcc = (V1 + V2) / 2
# print(f"Середня швидкість автомобіля {Vc} км/год")
# print(f"Середнє арифметичне: {Vcc}")









# Створити програму звертання до користувача, щоб він ввів довільний символ.
# Побудувати за його допомогою квадрат
# var = input("Введіть довільний стмвол > ")
# print(f"{var} " * 5)
# print(f"{var}       {var}\n" * 2, end="")
# print(f"{var} " * 5)







# Створити програму обрахунку віку. Користувач вводить рік народження і поточний рік.
# birth_year = int(input("Введіть рік народження > "))
# now_year = int(input("Введіть поточний рік > "))
# print(f"Мені {now_year - birth_year} років")









# Дано змінні A, B, C, D.
# Змінити їх значення, перемістивши вміст A — в D , D — в C , C — в B, B - в A і вивести нові значення змінних A, B, C, D.
A = 5
B = 6
C = 7
D = 8

E = D ###############
D = A #
F = C ###############
C = E #
E = B ###############
B = F #
A = E
# print(A, B, C, D)

# A = 5
# B = 6
# C = 7
# D = 8
# D, C, B, A = A, D, C, B
# print(A, B, C, D)






# Відомо, що X кг борошна коштує B гривень. Визначити, скільки коштує 1 кг та Y кг борошна.
X = 45
B = 500
Y = 1000
price_1 = B / X
price_y = Y * price_1
print(f"Кілограм борошна коштує {price_1} гривень, а за тону потрібно викласти {price_y} гривень")

age = 14
city = "Київ"
cat_name = "Мурзя"
name = "Олександр"
print("Я {name}. Мені {age} років. Мою улюблену кішку звати {cat_name}. Я проживаю у місті {city}".format(name=name, age=age, cat_name=cat_name, city=city))




# Дана відстань L в кілометрах. Використовуючи операцію ділення націло, визначити кількість повних кіл з радіусом R, у метрах, яку необхідно пробігти на таку відстань.




# Дано розмір файлу в мегабайтах. Використовуючи операцію ділення націло, знайти кількість повних гігабайт, які займає даний файл. (1 гігабайт = 1024 мегабайти).






############
bool(0)
bool(1)
bool("Hello")
bool(" ")
bool("")






# Дано тризначне число. Знайти суму та добуток його цифр.




# Нехай нам необхідно розрахувати послуги споживання електрики.
# У змінній rate у нас знаходиться тариф за електроенергію 1.68,
# а в змінній value — значення показання лічильника, задайте для неї розумне ціле число в кіловатах.
# Розрахуйте та помістіть у змінну payment рахунок за електрику.







# З початку доби пройшло N хвилин (N — ціле). Знайти кількість повних днів, місяців, років.







# Дано ціле число A. Перевірити істинність висловлювання: Число A є негативне.







# У змінній rate у нас знаходиться тариф за електроенергію — 1.68.
# Але тепер нам потрібно вести розрахунок денного та нічного тарифу.
# Нічний тариф розраховується як половина денного.
# У змінній value_day — денні показання лічильника, а в змінній value_night — нічні.
# Розрахуйте та помістіть у змінну payment рахунок за електрику, але вже з урахуванням денного та нічного тарифів.






# Створити дві змінні first_name, яка містить ім'я, та last_name, в яку помістити прізвище.
# Давайте зробимо конкатенацію цих двох змінних через символ пробілу і помістимо результат у змінну full_name.




# На цю мить у нас є три змінні: first_name, last_name та full_name
# Додамо змінну message, яка фактично буде прототипом шаблонного листа користувачеві, який купив квиток.
# Цю змінну ми сформуємо за допомогою f-рядка.
# У змінну message ми, за допомогою f-рядка, помістимо рядок наступного змісту:
# "Dear <підставляємо first_name>, we inform you that you have purchased a ticket to travel to the island of Mauritius.
# Departure June 31 of this year. Have a passport at <підставляємо full_name>. We are looking forward to seeing you!"




# Перша змінна a дорівнює -2 + 3j і друга змінна b дорівнює 4 + 2.1j.
# Результат додавання необхідно помістити у змінну result.




# Необхідно обчислити корені квадратного рівняння.
# a · x2 + b · x + c = 0
# Задайте змінні коефіцієнти a, b, c зі значеннями -2, 7, -6 відповідно
# Дискримінант рівняння помістіть у змінну D
# D = b^2 - 4 · a · c
# Корені рівняння помістіть у змінні x1 та x2, відповідно.
# x1 = (-b + D^0.5) / (2 · a)
# x2 = (-b - D^0.5) / (2 · a)




# Заведіть чотири змінні різного типу та надайте їм значення відповідного типу.
# name — рядкова змінна
# age — числова змінна
# is_active — булева змінна
# subscription — встановити значення None


