# Записати сторони трикутника, та знайти його площу
# S = sqrt(p(p-a)(p-b)(p-c))
# p = (a + b + c) / 2
# a = 5
# b = 6
# c = 7
# p = (a + b + c) / 2
# print(type(p))
# S = (p * (p - a) * (p - b) * (p - c)) ** 0.5
# print(f"Площа трикутника = {S}")





# М'яч падає з висоти h. Знайти максимальну швидкість м'яча та за який час він упаде на землю.
# v = sqrt(2 * g * h)
# t = sqrt((2 * h) / g)
# g = 9.8
# h = 20
# v = (2 * g * h) ** 0.5
# t = ((2 + h) / g) ** 0.5
# print(f"Максимальна швидкість м'яча {v} м/с\nчас падіння: {t} с")






first_number = 45.3
second_number = -96.1
# bool_type = (first_number < second_number) or (first_number < 0) or (second_number < 0)
# print(bool_type)
# print(type(bool_type))
# name = "Олександр" if first_number < 0 else "Максим"
# print(name)



# Оголосити змінну “city”, в яку присвоїти назву міста.
city = "Odesa"






# Оголосити три змінні, одна з яких дорівнюватиме довільному числу. Друга - в двічі більше число, третя - з протилежним знаком до другої змінної.
a = 5
b = a * 2
# c = -b
с = 5
# print(f"Перше число: {a}\nДруге число: {b}\nТретє число: {c}")







# Оголосити змінну - довжина ребра куба. Обчислити його об'єм і вивести на екран.
a = 78
V = a ** 3
print(f"Об'єм куба {V} кв.см.")







# Оголосити змінні — сторони довільного шестикутника. Обчислити периметр шестикутника та вивести його на екран.







# Оголосити змінні — площа круга. Визначити довжину кола та сторону вписаного правильного трикутника. Вивести на екран довжину кола та довжину сторони трикутника.
# R = sqrt(S / Pi)
# l = 2 * Pi * R
# a = R * sqrt(3)






# Оголосити змінні — 4 кути (їхня градусна міра). Оголосити наступну змінну is_quad, аби отримати булеве значення чи являється дана фігура чотирикутником







# Автомобіль на першій половині часу їхав зі швидкістю 36 км/год, а на другій — зі швидкістю 88.8 км/год. Знайти середню швидкість на всьому шляху.
# Vc = (V1 + V2) / 2








# None!!!!!!!!!!!!!!
# bool
# Автомобіль на першій половині шляху їхав зі швидкістю 25.5 км/год, а на другій — зі швидкістю 101.3 км/год. Знайти середню швидкість на всьому шляху.
# Vc = (2 * V1 * V2) / (V1 + V2)









# Створити програму звертання до користувача, щоб він ввів довільний символ. Побудувати за його допомогою квадрат







# Створити програму обрахунку віку. Користувач вводить рік народження і поточний рік.









# Дано змінні A, B, C, D. Змінити їх значення, перемістивши вміст A — в D , D — в C , C — в B і вивести нові значення змінних A, B, C, D.


