# Записати сторони трикутника, та знайти його площу
# p = (a + b + c) / 2
# S = (p(p-a)(p-b)(p-c)) ** 0.5
# a = 3
# b = 4
# c = 5

name = input("Введи своє ім'я: ")
age = input("Введи свій вік: ")
pet = input("Введи свою улюблену тваринку: ")
pet_name = input("Введи ім'я тваринки: ")
city = input("Введи місто в якому проживаєш: ")

print(f"Мене звати {name}. Мені {age} р. Проживаю у місті {city}. Моя улюблена тваринка {pet} на ім'я {pet_name}")
print("Мене звати {name}. Мені {age} р. Проживаю у місті {city}. Моя улюблена тваринка {pet} на ім'я {pet_name}".format(name=name, age=age, city=city, pet=pet, pet_name=pet_name))
print("Мене звати", name, ".Мені", age, "р. Проживаю у місті", city, ". Моя улюблена тваринка", pet, "на ім'я", pet_name)

# print(bool())
# print(bool(0))
# print(bool(None))
# print(bool(""))
# print(bool(False))
# print(bool([]))
# print(bool(True))

# is_positiv = True



# М'яч падає з висоти h. Знайти максимальну швидкість м'яча та за який час він упаде на землю.
# v = sqrt(2 * g * h)
# t = sqrt((2 * h) / g)
# h = 50
# g = 9.8

# Оголосити змінну “city”, в яку присвоїти назву міста.
# city = "Одеса"





# first_number = 45.3
# second_number = -96.1
# bool_type = (first_number < second_number) and (first_number > 0) and (second_number < 0)
# print(bool_type)

















# Оголосити три змінні, одна з яких дорівнюватиме довільному числу.
# Друга - в двічі більше число, третя - з протилежним знаком до другої змінної.
# a = -10
# b = a * 2
# c = -b

# print(a)
# print(f"{b = }")
# print("c =", c)










# Оголосити змінну - довжина ребра куба. Обчислити його об'єм і вивести на екран.
# V = a ^ 3
# a = 5
# V = a ** 3
# print(V)







# Оголосити змінні — сторони довільного шестикутника. Обчислити периметр шестикутника та вивести його на екран.
# a = 5
# b = 6
# c = 45
# d = 78
# e = 65
# f = 11
# P = a + b + c + d + e + f




# Оголосити змінні — площа кола.
# Визначити довжину кола та сторону вписаного правильного трикутника.
# Вивести на екран довжину кола та довжину сторони трикутника.
# R = sqrt(S / Pi)
# l = 2 * Pi * R
# a = R * sqrt(3)
# S = 56
# Pi = 3.14
# R = (S / Pi) ** 0.5
# l = 2 * Pi * R
# a = R * 3 ** 0.5
# print(f"Радіус кола = {R}, довжина кола {l}, сторона вписано правильного трикутника {a}")






# Оголосити змінні — 4 кути (їхня градусна міра).
# Оголосити наступну змінну is_quad, аби отримати булеве значення чи являється дана фігура чотирикутником
# a = 5
# b = 22
# c = 187
# d = 97
# sum = a + b + c + d
# print(f"{sum = }")
# is_quad = sum == 360
# print(is_quad)






# Автомобіль на першій половині часу їхав зі швидкістю 36 км/год,
# а на другій — зі швидкістю 88.8 км/год. Знайти середню швидкість на всьому шляху.
V1 = 36
V2 = 88.8
Vc = (V1 + V2) / 2
print(f"Середня швидкість автомобіля на всьому шляху дорівнює {Vc}")






# Автомобіль на першій половині шляху їхав зі швидкістю 25.5 км/год,
# а на другій — зі швидкістю 101.3 км/год.
# Знайти середню швидкість на всьому шляху.
# Vc = (2 * V1 * V2) / (V1 + V2)







# Створити програму звертання до користувача, щоб він ввів довільний символ. Побудувати квадрат








# Створити програму обрахунку віку. Користувач вводить рік народження і поточний рік.
birthday = (input("Введи свій рік народження: "))
birthday = int(birthday)

now_year = input("Введи поточний рік: ")
now_year = int(now_year)
print(f"Твій вік {now_year - birthday}")








# Дано змінні A, B, C, D. Змінити їх значення, перемістивши вміст A — в D , D — в C , C — в B, B - в A і вивести нові значення змінних A, B, C, D.











# Відомо, що X кг борошна коштує B гривень. Визначити, скільки коштує 1 кг та Y кг борошна.







# Дана відстань L в кілометрах. Використовуючи операцію ділення націло, визначити кількість повних кіл з радіусом R, у метрах, яку необхідно пробігти на таку відстань.
# L = 10 # км
# R = 15 # м








# Дано розмір файлу в мегабайтах. Використовуючи операцію ділення націло, знайти кількість повних гігабайт, які займає даний файл. (1 гігабайт = 1024 мегабайти).
# file_size_mb = 54798211354 # Mb




############
# bool(0)
# bool(1)
# bool("Hello")
# bool(" ")
# bool("")



# Дано тризначне число. Знайти суму та добуток його цифр.
# a = 429








# Нехай нам необхідно розрахувати послуги споживання електрики.
# У змінній rate у нас знаходиться тариф за електроенергію 1.68,
# а в змінній value — значення показання лічильника, задайте для неї розумне ціле число в кіловатах.
# Розрахуйте та помістіть у змінну payment рахунок за електрику.







# З початку доби пройшло N хвилин (N — ціле). Знайти кількість повних днів, місяців, років.
# N = 45468788411









# Дано ціле число A. Перевірити істинність висловлювання: Число A є негативне.
# A = 456








# У змінній rate у нас знаходиться тариф за електроенергію — 1.68.
# Але тепер нам потрібно вести розрахунок денного та нічного тарифу.
# Нічний тариф розраховується як половина денного.
# У змінній value_day — денні показання лічильника, а в змінній value_night — нічні.
# Розрахуйте та помістіть у змінну payment рахунок за електрику, але вже з урахуванням денного та нічного тарифів.






# Створити дві змінні first_name, яка містить ім'я, та last_name, в яку помістити прізвище.
# Давайте зробимо конкатенацію цих двох змінних через символ пробілу і помістимо результат у змінну full_name.




# На цю мить у нас є три змінні: first_name, last_name та full_name
# Додамо змінну message, яка фактично буде прототипом шаблонного листа користувачеві, який купив квиток.
# Цю змінну ми сформуємо за допомогою f-рядка.
# У змінну message ми, за допомогою f-рядка, помістимо рядок наступного змісту:
# "Dear <підставляємо first_name>, we inform you that you have purchased a ticket to travel to the island of Mauritius.
# Departure June 31 of this year. Have a passport at <підставляємо full_name>. We are looking forward to seeing you!"




# Перша змінна a дорівнює -2 + 3j і друга змінна b дорівнює 4 + 2.1j.
# Результат додавання необхідно помістити у змінну result.




# Необхідно обчислити корені квадратного рівняння.
# a · x2 + b · x + c = 0
# Задайте змінні коефіцієнти a, b, c зі значеннями -2, 7, -6 відповідно
# Дискримінант рівняння помістіть у змінну D
# D = b^2 - 4 · a · c
# Корені рівняння помістіть у змінні x1 та x2, відповідно.
# x1 = (-b + D^0.5) / (2 · a)
# x2 = (-b - D^0.5) / (2 · a)




# Заведіть чотири змінні різного типу та надайте їм значення відповідного типу.
# name — рядкова змінна
# age — числова змінна
# is_active — булева змінна
# subscription — встановити значення None






