# Створіть програму, яка приймає список товарів та повертає список,
# в якому кожен елемент дорівнює кількості букв, з яких складається товар.

# Створення пустого списку продуктів
products = []

while True:
    # Даємо можливість користувачу ввести назву товару
    product = input("Введіть товар для покупки, або введіть 'stop' > ")

    # Якщо користувач ввів "stop" тоді зупиняємо програму
    if product == "stop":
        break

    # Додаємо новий товар
    products.append(product)

print(products)    # Виводимо на екран наш список

# Створюємо пустий список з кількість букв
chars_count = []

for i, product in enumerate(products):
    char_count = len(product)    # Рахує кількість букв в слові
    chars_count.append(char_count)    # Додаємо кількість до списку chars_count

    # Виводимо на екран список продуктів та кількість букв
    print(f"{i + 1}. Товар {product} має таку кількість букв: {char_count}")











# Написати програму, що рахує добуток всіх чисел у списку.
# numbers = [1, 5, -9, -7.1]

# result = 1

# for number in numbers:
#     result *= number

# print(f"Добуток числе дорівнює {result}")







# Написати програму, яка виведе числа від 7 до 77 використовуючи цикл
# start = int(input())
# end = int(input())

# for i in range(7, 78, 78):
#     print(i)


#############################
# другий метод рахунку



# На технічній співбесіді претенденти на посаду одержують оцінку за тест.
# У наступний тур співбесіди проходять кандидати, які склали тест на 83 бали включно або вище.
# Реалізуйте оператор контролю виконання так, щоб він привласнив логічній змінній is_next значення True,
# якщо кількість набраних балів буде більшою або дорівнює 83.
# В іншому випадку значення змінної дорівнює False.





# Написати програму, що перевірить чи є щось в списку, і якщо є, то виведе кількість елементів у ньому.





# Дано змінну a = -56. Виводити a, поки a <= 15, збільшуючи змінну на 3





# Написати програму, яка видалить зі списку 1-й, 3-й і 6-й елементи зі списку





# Написати програму, яка на початку додасть “I am glad to see you, ” до кожного із імен в списку
# і виведе привітання на екран.
# lst=["Alex", "Petro", "Max", "Andrii", "Lev"]. Приклад — I am glad to see you, Alex!






# Написати програму, що дістає мінімальне число зі списку.







# Запитувати у користувача речення та літеру для пошуку.
# Порахувати скільки даних літер у речені






# Піднести кожен із елементів списку до четвертого степеня






# Видалити слово "Банани" зі списку.
# products = ["Хліб", "Банани", "Риба", "Банани", "Насіння", "Майонез", "Кетчуп", "Банани", "Соус"]







# Написати програму, яка порахує і виведе числа у квадраті від 1 до числа, яке задасть користувач







# Написати програму, що прибере дублікати зі списку.






# Дано дійсне число - ціна 3 кг сала. Вивести вартість 1.2, 1.4, ..., 2 кг сала.







# Написати програму, що порахує кількість додатніх елементів у списку та кількість від’ємних
# numbers = []






# Дано діапазон чисел від -100 до 0. Вивести на екран лише числа, які закінчуються на нуль





# Написати програму, що порахує кількість унікальних елементів у списку.