# Видалити слово "Кетчуп" зі списку.
# products = ["Хліб", "Банани", "Риба", "Банани", "Насіння", "Майонез", "Кетчуп", "Банани", "Соус", "Кетчуп"]

# products.index


# Написати програму, що перевірить чи є слово "Насіння" в списку, і якщо є, то виведе кількість елементів у ньому.
# products = ["Хліб", "Банани", "Риба", "Банани", "Насіння", "Майонез", "Кетчуп", "Банани", "Соус", "Кетчуп"]
# product = input("Ввеіть слово для підрахунку кількості: ")
# count = products.count(product)
# print(type(count))
# print(count)


# Написати програму, яка видалить зі списку 2-й, 4-й і 5-й елементи зі списку
products = ["Хліб", "Банани", "Риба", "Банани", "Насіння", "Майонез", "Кетчуп", "Банани", "Соус", "Кетчуп"]
product = products.pop(0)
