# prime_numbers = {2, 3, 5, 7, 11, 13, 17, 19, 23}
# if 3 in prime_numbers:
#     print("Цифра 3 є в списку")
# else:
#     print("Цифри 3 немає у списку")
    

# Створити словник із наступними ключами (дивись нижче).
# Зробити перевірку чи є елемент 'age' серед ключів словника та вивести інформацію, яка подана в Результаті.

# user = {
#     "name": "Bill",
#     "surname": "Bosh",
#     "age": 22
# }

# age_ver = user.get("age", "Не знайдено")
# print(f"Вік - {age_ver}")


# Задано словник, що містить відстані від Києва до обласних центрів. Знайти обласний центр, найбільш віддалений від Києва.
# cities = {
#     'Київ'    : 0,
#     'Вінниця' : 240,
#     'Харків'  : 470,
#     'Ужгород' : 808,
#     'Львів'   : 540,
#     'Житомир' : 120,
#     'Одеса'   : 430
# }

# max_dist = 0
# for city, dist in cities.items():
#     if dist > max_dist:
#         max_dist = dist
# print(f"Найвіддаліненіше місто від Києва на відстані - {max_dist}")

# Дано список міст, в яких працює Укрпошта та Нова Пошта.
# Користувач вводить місто з клавіатури.
# Запропонувати користувачеві доставку поштовим оператором або вивести повідомлення про неможливість доставки.
# post_ukr = {'Київ', 'Фастів', 'Ірпінь', 'Боярка'}
# post_new = {'Київ', 'Фастів', 'Кагарлик', 'Узин', 'Ірпінь', 'Гатне', 'Боярка', 'Гостомель'}
# user_city_min_lenth = 3

# delivery = input("Введіть місто в яке ви хочете доставити посилку ")
# if delivery in post_ukr and delivery in post_new:
#     print("Ви можете забрати посилку і в укр і в новій пошті")
# elif delivery in post_ukr:
#     print("Ви можете забрати посилку в укр пошті")
# elif delivery in post_new:
#     print("Ви можете забрати посилку в новій пошті")
# else:
#     print("На жаль, в ваше місто не надходять посилки")




# Задано список туристичних ваучерів, в яких зазначено готель,
# прізвище власника, кількість подорожуючих.
# Підрахувати, скільки туристів їдуть в кожен з готелів.
# clients = [
#     ['White House', 'Іванов', 3],
#     ['Shelter', 'Іванова', 5],
#     ['Верховина', 'Іванова', 5],
#     ['Верховина', 'Бронювальник', 8],
#     ['Буковель', 'Іванова', 5]
# ]

# for client in clients:


# Напишіть програму, яка приймає список чисел та повертає новий список,
# що містить лише унікальні елементи вхідного.

numbers = [1, 5, 9, 1, 5, 7, 4, 5]
unique_numbers = set()
for char in numbers:
    unique_numbers.add(char)
    input(unique_numbers)

# print(set(numbers))