# # prime_numbers = {2, 3, 5, 7, 11, 13, 17, 19, 23}
# # if 3 in prime_numbers:
# #     print("число 3 є у списку")
# # else:
# #     print("Такого числа немає у списку")


# # Створити словник із наступними ключами (дивись нижче).
# # Зробити перевірку чи є елемент 'age' серед ключів словника та вивести інформацію, яка подана в Результаті.

# # user = {
# #     "name": "Bill",
# #     "surname": "Bosh",
# #     "age": 22
# # }

# # age = user.get("age", "")





# # Напишіть програму, яка приймає словник, та змінює всі значення на їх квадрати.

# #numbers = {
# #    "one": 1,
# #    "two": 2,
# #    "three": 3
# #}

# for key in numbers:
#     numbers[key] = numbers[key] ** 2
# print(numbers)



# # Створіть програму, яка приймає список рядків та повертає список унікальних слів,



# # які зустрічаються в цих рядках.

# strings = ["Створіть програму, яка приймає список", "зустрічаються в цих рядках", "список", "# Створіть програму, яка приймає список рядків\
#             та повертає список унікальних слів, \n# які зустрічаються в цих рядках."]


# unique_words = set()
# for string in strings:
#     for word in string.replase("#", "").replace("\n", "").split():
#         unique_words.add(word)

# print(list(unique_words))



# Напишіть програму, яка приймає список рядків та повертає список,
# в якому кожен елемент — це рядок, який містить першу літеру кожного слова в вхідному рядку.
# strings = ["Створіть програму, яка приймає список", "зустрічаються в цих рядках", "список", "# \
#            Створіть програму, яка приймає список рядків та повертає список унікальних слів, \n# які зустрічаються в цих рядках."]
# first_letter = []
# for string in strings:
#     for word in string.split():
#         first_letter.append(word[0])
#         string.replace(",","")
# print(first_letter)


# # Створіть програму, яка приймає список та повертає рядок,
# # який містить всі елементи вхідного списку, розділені комами.

# strings = ["Створіть програму, яка приймає список", "зустрічаються в цих рядках", "список", "# \
#            Створіть програму, яка приймає список рядків та повертає список унікальних слів, \n# які зустрічаються в цих рядках."]



# Створіть програму, яка приймає список та повертає рядок,# Напишіть програму, яка приймає два словника та повертає словник,
# що містить ключі та значення обох вхідних словників.

# dict_1 = {
#     "one": 1,
#     "two": 2
# }

# dict_2 = {
#     "tree": 3
# }

# який містить всі елементи вхідного списку, розділені комами.

#numbers = list(range(100))
#numbers = [str(numbers) for number in numbers]
#numbers = ",".join(numbers)
#print(numbers)

# Напишіть програму, яка приймає два словника та повертає словник,
# що містить ключі та значення обох вхідних словників.

#dict_1 = {
#    "one": 1,
#    "two": 2
#}

#dict_2 = {
#    "tree": 3
#}

#dict_1.update(dict_2)
#print(dict_1)


