# Додайте анотації типів до функції,
# яка приймає два цілі числа як аргументи і повертає їх суму.

# def my_func(a: int, b: int) -> int:
#     pass








# import matplotlib.pyplot as plt
# import numpy as np


# x = np.linspace(0, 2, 100)

# plt.plot(x, x, label='linear')  # Plot some data on the (implicit) axes.
# plt.plot(x, x**2, label='quadratic')  # etc.
# plt.plot(x, x**3, label='cubic')
# plt.xlabel('x label')
# plt.ylabel('y label')
# plt.title("Simple Plot")
# plt.legend()
# plt.show()

























# Створити власний модуль my_module.py, який містить функцію print_message(msg),
# що приймає один аргумент msg та виводить його на екран.
# Потім імпортувати функцію print_message() в головний файл програми та викликати її.















# Створити власний модуль my_math.py, який містить функції add(x, y) та subtract(x, y).
# Імпортувати модуль та використати ці функції для додавання та віднімання чисел.














# Створити власний модуль my_geometry.py, який містить функції circle_area(radius)
# та rectangle_area(width, height).
# Імпортувати модуль та використати ці функції для обчислення площі кола та прямокутника.














# Створити власний модуль my_data.py, який містить список даних (наприклад, список чисел).
# Імпортувати модуль та вивести список даних на екран.















# Створити власний модуль my_statistics.py, який містить функції для обчислення
# статистичних показників (наприклад, середнього значення, медіани, дисперсії) для списку даних.
# Імпортувати модуль та використати ці функції для обробки списку даних.
# D(X)= E(X^2) − μ^2
# E(X^2) = sum(X_i^2) / N
# μ^2 = sum(x_i)^2


















# Створити графік лінійної функції y = 2x + 1 за допомогою бібліотеки matplotlib.







# Створити графік квадратичної функції y = x^2 за допомогою бібліотеки matplotlib.








# Створити графік функції sin(x) за допомогою бібліотеки matplotlib.
