# import re
# my_string = "  777 овертає кількість разів, коли вказане знаколичення з’являється в рядку. "\
# "Ви можете обмежити пошук, вказавши додаткові аргументи start і end:    \n000"

# print(ord("ю"))

# new_string = my_string.replace("коли", "мабуть").replace("7", "9")
# print(new_string)

# print(len(my_string))
# count = my_string.count("і", 20, 25)
# print(count)

# index = my_string.rfind("і")
# print(index)
# my_string.
# print(re.findall("і", my_string))

# strings = my_string.split(". ")
# # print(strings)
# new_string = "!".join(strings)
# print(new_string)
# new_string = my_string.strip(".+- \n")
# print(len(new_string))
# print(new_string)


# print("|{left:<10}|{center:*^10}|{right:>10}|".format(left='left', right='right', center='center'))












# Вивести таблицю проданих за день товарів в наступному форматі:
# номер, назва, кількість, ціна.
# --------------------------------------------------
# |  №  |Товар               | Кількість|  Вартість|
# --------------------------------------------------
# |  0  |Апельсин            |         6|        15|
# |  1  |Лимон               |         8|       367|
# |  2  |Картопля            |        10|        80|
# --------------------------------------------------

delimiter = "-" * 50
header = ["№", "Товар", "Кількість", "Вартість"]
products = [["Апельсин", 6, 15], ["Лимон", 8, 367], ["Картопля", 10, 80]]
template = "|{:^5}|{:<20}|{:>10}|{:>10}|"

print(delimiter)
# print(template.format(header[0], header[1], header[2], header[3]))
print(template.format(*header))
print(delimiter)

for i, product in enumerate(products):
    # print(template.format(i, product[0], product[1], product[2]))
    print(template.format(i, *product))

print(delimiter)














# Ввести довільне повідомлення з клавіатури.
# Якщо в повідомленні трапляються слова «купити», «продати», «реклама»,
# то помітити це повідомлення як спам.











# перевірити, чи всі елементи вказані в списку є однаковими
# first_list = [1, 1, 2, 1, 5]
# second_list = ["b", "b", "b", "b", "b"]
# third_list = [5, 5, "5", 5, "5"]


















# Створіть програму, яка приймає від користувача строку
# та знаходить кількість приголосних літер у цьому рядку.
# Виведіть цю кількість.







# Напишіть програму, яка приймає рядок, та перевертає його за допомогою слайсингу











# Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]











# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).















# Напишіть програму, яка приймає рядок, та перевертає його без використання слайсингу (1. Використання списків. 2. Використання циклу.)














# Даний список повинен бути "стиснутий" таким чином, щоб замість двох (або більше) однакових значень підряд було одне значення
# my_list = [5, 5, 5, 4, 5, 6, 6, 5, 5, 7, 8, 0, 0] # -> [5, 4, 5, 6, 5, 7, 8, 0]
# my_list = [1, 1, 1, 1, 2, 2, 2, 1, 1, 1] # -> [1, 2, 1]












# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).













# Створіть програму, яка перевіряє чи рядок включає в собі лише цифри.
















# Створіть програму, яка приймає рядок, та повертає рядок, з якого було видалено всі пробіли.






# Створіть програму, яка приймає рядок, та повертає рядок у якому кожне слово буде з великої букви.







# Створіть програму, яка приймає рядок від користувача, та повертає перший неповторюваний символ у рядку.








# Дано список із рядками. Відсортуйте його за спаданням довжини кожного елемента. Переверніть список, виведіть кожен елемент на екран.
# my_list = ["Дано", "список", "із", "рядками", "Відсортуйте", "його"]
# my_list.sort(key=len)
# print(my_list)








# Створіть програму, яка приймає рядок та повертає найдовший повторюваний підрядок у ньому.
# Створіть програму, яка приймає рядок, та повертає кількість паліндромних підрядків у рядку.
# Створіть програму, яка приймає на вхід рядок від користувача та повертає частоту кожного слова у рядку.