# my_string = "Відокремлення ім’я та прізвища"
# print(my_string[:50])

















# Відокремлення ім’я та прізвища
# Заданий рядок, який містить ім’я та прізвище користувача, що розділені пробілом
# Написати програму з використанням зрізів, яка виокремить ім’я та прізвище

# delimiter = ","

# my_list = []

# if delimiter not in my_string:
#     print("Міститься тільки одне слово")
#     my_list.append(my_string)
# else:
#     delimiter_count = my_string.count(delimiter)

#     idx = 0
#     for _ in range(delimiter_count):
#         idx_start = idx
#         idx = my_string.find(delimiter, idx_start) + 1
#         word = my_string[idx_start:idx-1]
#         my_list.append(word)
#     else:
#         word = my_string[idx:]
#         my_list.append(word)

# print(f"{my_list = }")


# my_set = set()
# my_set = {1, 5, 8, 1, 5, 9, 1}
# print(my_set)
# my_set = set(my_string)
# # print(my_set)
# for char in my_set:
#     print(char)

numbers = {1, 5, 5, 1, 8, 1, 1, 1, 5, 8}
my_string = "Ivan,Ivanov,Ivanovich,hello"
my_set = set(my_string)
# numbers.add(1)
# numbers.add(10)
# numbers.remove(50)
# numbers.discard(10)

print(my_set)
print(my_set.pop())
print(my_set)






# Дано рядок, який містить довільне речення, слова в якому розділені пробілами.
# З використанням зрізів знайти і вивести слово, яке має найменшу довжину.

# string = "Дано рядок, який містить довільне речення, слова вв якому розділені пробілами. Зз використанням зрізів знайти іі вивести слово, яке має найбільшу довжину. 5"




















# my_set = set()
# print(my_set)
# print(type(my_set))

# my_set = {1, 5, 8}










# Задано список номерів мобільних телефонів:
# Вважаючи, що всі номери записані у форматі +38 (код) 111-11-11,
# порахувати кількість абонентів оператора, що має коди «067», «097», «068»









# Множини

### Створити множину
# numbers = set("Hello world!")
# print(numbers)



### Додати до неї новий елемент
# numbers.add("y")
# print(numbers)


### Видалити елемент з виключенням
# chars = set("hello")
# print(chars)
# chars.remove("d")
# print(chars)




### Видалити елемент з множини не викликаючи виключення
# chars.discard("d")
# print(chars)

# char = chars.pop()
# print(f"{char = }")
# char = chars.pop()
# print(f"{char = }")
# print(chars)








# Дано список клієнтів, які купили товар А та список клієнтів, які купили товар В.
# Знайти:
# - клієнтів, які купили обидва товари А і B
# - створити один список клієнтів, шляхом операції об’єднання
# clients_a = {"Олександр", "Артем", "Дмитро", "Максим"}
# clients_b = {"Артем", "Матвій", "Єгор", "Дмитро"}

# print(f"Список клієнтів, які купили обидва товари: {clients_a & clients_b}")
# print(clients_a.intersection(clients_b))

# print(f"Список клієнтів, які щось купили: {clients_a | clients_b}")
# print(clients_a.union(clients_b))

# print(clients_a ^ clients_b)
# print(f"Список клієнтів, які купили один із товарів, але не обидва: {clients_a.symmetric_difference(clients_b)}")








# Створіть список з чисел від 1 до 10 та використайте зрізи для виводу елементів від другого до п'ятого включно.
# numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]








# Створіть рядок та використайте зрізи для виводу перших трьох та останніх трьох символів.
# string = "Створіть рядок та використайте зрізи для виводу перших"












# Визначити, чи порядок значень у запропонованому списку є строго зростаючим
# numbers = [4, 5, 60, 80, 79, 95, 140]











# Створіть список зі стрічок та використайте зрізи для виводу останніх трьох символів з кожної стрічки.
# strings = ["Створіть список", "стрічок та", "зрізи для виводу", "трьох!"]











# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).










# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).








# Створіть список зі стрічок та використайте зрізи для виводу символів з кожної стрічки у зворотньому порядку.









# Створіть програму, яка перевіряє чи рядок включає в собі лише цифри.







# Створіть програму, яка приймає рядок, та повертає рядок, з якого було видалено всі пробіли.






# Створіть множину та перевірте, чи є вона підмножиною іншої множини.