# Зробити перевірку того, чи є число 3 в множині перших дев'яти простих чисел prime_numbers:
prime_numbers = {2, 3, 5, 7, 11, 13, 17, 19, 23}






# Створити словник із наступними ключами (дивись нижче).
# Зробити перевірку чи є елемент 'age' серед ключів словника та вивести інформацію, яка подана в Результаті.

user = {
    "name": "Bill",
    "surname": "Bosh",
    "age": 22
}






# Задано словник, що містить відстані від Києва до обласних центрів. Знайти обласний центр, найбільш віддалений від Києва.
cities = {
    'Київ'    : 0,
    'Вінниця' : 240,
    'Харків'  : 470,
    'Ужгород' : 808,
    'Львів'   : 540,
    'Житомир' : 120,
    'Одеса'   : 430
}







# Дано список міст, в яких працює Укрпошта та Нова Пошта.
# Користувач вводить місто з клавіатури.
# Запропонувати користувачеві доставку поштовим оператором або вивести повідомлення про неможливість доставки.
post_ukr = {'Київ', 'Фастів', 'Ірпінь', 'Боярка'}
post_new = {'Київ', 'Фастів', 'Кагарлик', 'Узин', 'Ірпінь', 'Гатне', 'Боярка', 'Гостомель'}
user_city_min_lenth = 3









# Задано список туристичних ваучерів, в яких зазначено готель,
# прізвище власника, кількість подорожуючих.
# Підрахувати, скільки туристів їдуть в кожен з готелів.
clients = [
    ['White House', 'Іванов', 3],
    ['Shelter', 'Іванова', 5],
    ['Верховина', 'Іванова', 5],
    ['Буковель', 'Іванова', 5]
]