# Trailing Spaces
# Rainbow Brackets
# Live Share

# Print

# print("Hello' world", 5, 7.4)

# print(((((('Hello')))))) # Даний текст для тестування

# print("Hello")
# print("Ім'я")
# print('Ім\'я')

# print('''Hello''')
# print("Моє ім'я \"підставити своє ім'я\" ")

#  __      ______  _________   ___ __ __  ______        ________  _________
# /_/\    /_____/\/________/\ /__//_//_/\/_____/\      /_______/\/________/\
# \:\ \   \::::_\/\__.::.__\/ \::\| \| \ \::::_\/_     \__.::._\/\__.::.__\/
#  \:\ \   \:\/___/\ \::\ \    \:.      \ \:\/___/\       \::\ \    \::\ \
#   \:\ \___\::___\/_ \::\ \    \:.\-/\  \ \::___\/_      _\::\ \__  \::\ \
#    \:\/___/\:\____/\ \::\ \    \. \  \  \ \:\____/\    /__\::\__/\  \::\ \
#     \_____\/\_____\/  \__\/     \__\/ \__\/\_____\/    \________\/   \__\/


# print("""
#  __      ______  _________   ___ __ __  ______        ________  _________
# /_/\\    /_____/\\/________/\\ /__//_//_/\\/_____/\\      /_______/\\/________/\\
# \\:\\ \\   \\::::_\\/\\__.::.__\\/ \\::\\| \\| \\ \\::::_\\/_     \\__.::._\\/\\__.::.__\\/
#  \\:\\ \\   \\:\\/___/\\ \\::\\ \\    \\:.      \\ \\:\\/___/\\       \\::\\ \\    \\::\\ \\
#   \\:\\ \\___\\::___\\/_ \\::\\ \\    \\:.\\-/\\  \\ \\::___\\/_      _\\::\\ \\__  \\::\\ \\
#    \\:\\/___/\\:\\____/\\ \\::\\ \\    \\. \\  \\  \\ \\:\\____/\\    /__\\::\\__/\\  \\::\\ \\
#     \\_____\\/\\_____\\/  \\__\\/     \\__\\/ \\__\\/\\_____\\/    \\________\\/   \\__\\/
# """)

# Типи змінних

# int

# a = "7"
# None
# print(10 ** 4200)


# a = 9 # int - integer - int()
# b = 4.6 # float - float()
# c = "Hi" # str - string - str()

# print("12- !" * 25)
# print(type(c))



# Input

# input(f"What is your name?{a} My name is ")

# name = input("Введіть своє ім'я: ")
# # print(f"My name is {name}")

# age = input("Скільки тобі років ")
# # print(type(age))
# # print("Мені {}".format(age))

# city = input("Де ти проживаєш? ")
# # print(f"Я живу у місті {city}")

# print(f"Мене звати {name}. Мені {age} років. На даний час я проживаю в місті {city}")
# input("Натисніть 'enter' щоб закрити програму")
# a = input("Введіть ціле число 1: ")
# print(type(a))
# a = int(a)
# print(type(a))

# b = input("Введіть ціле число 2: ")
# print(type(b))
# b = float(b)
# print(type(b))
# print(a + b)

# Передати програмі кількість своїх домашніх тварин.
# Порахувати скільки всього тварин є в домогосподарстві,
# та вивести повідомлення у форматі "Котів: 5, собак: 1, корів: 9. Всього тварин 15"






# float

# a = int(float(input("Введіть перше ціле число:\n")))
# b = int(float(input("Введіть друге ціле число:\n")))
# +, -, *, /, **, //, %






# Написати програму, яка буде рахувати площу поля за довжиною та шириною

# length = input("Введіть довжину поля: ")
# width = input("Введіть ширину поля: ")







# Напишіть програму для підрахунку дрібних грошей. Вона повинна питати:

# «Скільки у вас монет по 50 копійок?»;
# «Скільки у вас монет по 25 копійок?»;
# «Скільки у вас монет по 10 копійок?»;
# «Скільки у вас монет по 5 копійок?».
# Після цього на екрані повинна з'явитися загальна сума.

# count_50 = int(input("Скільки у вас монет по 50 копійок? "))
# count_25 = int(input("Скільки у вас монет по 25 копійок? "))
# count_10 = int(input("Скільки у вас монет по 10 копійок? "))
# count_5 = int(input("Скільки у вас монет по 5 копійок? "))



# Обчисліть добуток перших 20 натуральних чисел. Виведіть на екран обчислене значення.




# Запишіть букву 'A' (латинську, велику) 87 разів поспіль.





# Запишіть слово 'Python' 53 раз поспіль.