month = {
    1: "Січень",
    2: "Лютий",
    3: "Березень"
}

month[8] = "Серпень"
month.update({11: "Листопад"})

month[4] = "Квітень"
month.update({5: "Травень"})


month[6] ='Червень'
month.update({})



# Створіть словник з переліком фруктів та їх калорійністю.
# Виведіть на екран калорійність вашого улюбленого фрукту.

fruits = {
    "Яблуко": 1200,
    "Банан": 222,
    "Апельсин": 156,
    "Ківі": 100,
    "Груша": 567
}

print(fruits["Яблуко"])
print(fruits.get("ЯблукоКО", "Такого фрукту незнайдено."))

fruits = {
    'Банан': 100,
    'Авокадо': 20,
    'Мандарин': 75,
    'Кавун': 10,
    'Огірок': 5
}
print(fruits.get('Кавун'))


# Створіть словник з іменами та віком декількох людей.
# Виведіть на екран найстаршу людину.

names = {
    "Олег": 16,
    "Сергій": 12,
    "Степан": 10,
    "Петро": 26
}

# max_age = max(names, k)


people = {
    'Стефан': 16,
    'Вікторія': 18,
    
}


people = {
    "Сергій":64,
    "Олексій":38,
    "Макс":41,
    "Олекстандра":36,
} 




people_ages = {
    "Олег": 25,
    "Марія": 32,
    "Іван": 40,
    "Анна": 29,
    "Сергій": 35
}

oldest_person = max(people_ages, key=people_ages.get)
# print(oldest_person)


# Створіть список з чисел від 1 до 10 та використайте зрізи
# для виводу елементів від другого до п'ятого включно.
numbers = list(range(1, 11))

# print(numbers[1:5])


# Напишіть програму, яка об'єднує два словники в один.
# Ключі та значення в обох словниках повинні бути різними.
cities_1 = {'Київ': 2.884,'Харків': 1.419, 'Одеса': 1.010}
cities_2 = {'Дніпро': 0.968, 'Львів': 0.717}

cities_1 = {'Київ': 2.884,'Харків': 1.419, 'Одеса': 1.010}
cities_2 = {'Дніпро': 0.968, 'Львів': 0.717}
# cities_3 = 


join_cities = {**cities_1, **cities_2}
# print(join_cities)

cities = cities_1 | cities_2
print(cities)

cities_1 = {'Київ': 2.884,'Харків': 1.419, 'Одеса': 1.010}
cities_2 = {'Дніпро': 0.968, 'Львів': 0.717}
cities_1.update(cities_2)
print(cities_1)