# Зрізи
# numbers = list(range(1, 11))
# print(numbers[::2])
# print(numbers[1::2])
# print(numbers[2::3])












# Виокремлення ім’я та прізвища
# Заданий рядок, який містить ім’я та прізвище користувача, що розділені пробілом
# Написати програму з використанням зрізів, яка виокремить ім’я та прізвище

# my_string = "Ivan,Ivanov,Ivanovich,hello"
# delimiter = ","

# names = []
# idx = 0
# count_delimiter = my_string.count(delimiter)
# for _ in range(count_delimiter):
#     idx_start = idx
#     idx = my_string.find(delimiter, idx_start) + 1
#     name = my_string[idx_start:idx-1]
#     names.append(name)
# else:
#     names.append(my_string[idx:])

# print(names)













# Дано рядок, який містить довільне речення, слова в якому розділені пробілами.
# З використанням зрізів знайти і вивести слово, яке має найменшу довжину.

# string = "Дано рядок, який містить довільне речення, слова в якому розділені пробілами. З використанням зрізів знайти і вивести слово, яке має найбільшу довжину."
# string = string.replace(",", "").replace(".", "")
# delimiter = " "

# smallest_word = ""
# len_smallest_word = 756454987690

# idx = 0
# count_delimiter = string.count(delimiter)
# for _ in range(count_delimiter+1):
#     idx_start = idx
#     idx = string.find(delimiter, idx_start) + 1
#     word = string[idx_start:idx-1]

#     len_word = len(word)
#     if len_word < len_smallest_word:
#         len_smallest_word = len_word
#         smallest_word = word

# print(f"Найменше слово '{smallest_word}', яке має довжину {len_smallest_word}")


# numbers = [1, 5, 6, 1, 9, 6]
# my_set = set(numbers)
# # print(len(my_set))
# my_set.discard(89)
# print(my_set)




# Задано список номерів мобільних телефонів:
# Вважаючи, що всі номери записані у форматі +38 (код) 111-11-11,
# порахувати кількість абонентів оператора, що має коди «067», «097», «068»









# Множини

### Створити множину




### Додати до неї новий елемент



### Видалити елемент з виключенням



### Видалити елемент з множини не викликаючи виключення









# Дано список клієнтів, які купили товар А та список клієнтів, які купили товар В.
# Знайти:
# - клієнтів, які купили обидва товари А і B
# - створити один список клієнтів, шляхом операції об’єднання









# Створіть список з чисел від 1 до 10 та використайте зрізи для виводу елементів від другого до п'ятого включно.








# Створіть рядок та використайте зрізи для виводу перших трьох та останніх трьох символів.







# Визначи, чи порядок значень у запропонованому списку є строго зростаючим
# my_list = [4, 5, 6, 7, 3, 7, 9]







# Створіть список зі стрічок та використайте зрізи для виводу останніх трьох символів з кожної стрічки.








# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом
# (слово, яке читається однаково зліва направо та справа наліво).
# Виведіть результат у вигляді логічного значення (True або False).









# Створіть програму, яка приймає від користувача дві строки та перевіряє,
# чи є вони анаграмами (слова, у яких ті самі літери, але в різному порядку).
# Виведіть результат у вигляді логічного значення (True або False).





# Створіть список зі стрічок та використайте зрізи для виводу символів з кожної стрічки у зворотньому порядку.









# Створіть програму, яка перевіряє чи рядок включає в собі лише цифри.







# Створіть програму, яка приймає рядок, та повертає рядок, з якого було видалено всі пробіли.






# Створіть множину та перевірте, чи є вона підмножиною іншої множини.